# "anchor-remap dn8:19.4  1st ethics refrain",
  "dn8:18.7": "This pertains to their accomplishment in ethics. … ",

# "anchor  25th ethics refrain (map all DN8 ethics refrains to dn8:19.4)",
  "dn8:19.4": "This pertains to their accomplishment in ethics. ",

# "anchor-remap dn8:19.16  1st immersion refrain ",
  "dn8:19.12": "This pertains to their accomplishment in mind. … ",

# "anchor  4th immersion refrain (map all DN8 immersion refrains to dn8:19.16)",
  "dn8:19.16": "This pertains to their accomplishment in mind. ",

# "anchor-remap dn8:20.5  1st wisdom refrain",
  "dn8:20.3": "This pertains to their accomplishment in wisdom. … ",

# "8th wisdom refrain (map all DN8 wisdom refrains to dn8:20.5)",
  "dn8:20.5": "This pertains to their accomplishment in wisdom. ",


{
  "dn8:18.3": "“It’s when a Realized One arises in the world, perfected, a fully awakened Buddha … ",

# "this begins a run of 4 anchor segments that correspond to 4 contiguous DN 2 segments, inc 1st ethics refrain",
  "dn8:18.4": "Seeing danger in the slightest fault, a mendicant keeps the rules they’ve undertaken. They act skillfully by body and speech. They’re purified in livelihood and accomplished in ethical conduct. They guard the sense doors, have mindfulness and situational awareness, and are content. ",
  "dn8:18.5": "And how is a mendicant accomplished in ethics? ",
  "dn8:18.6": "It’s when a mendicant gives up killing living creatures. They renounce the rod and the sword. They’re scrupulous and kind, living full of sympathy for all living beings. ",

# "1st ethics refrain",

  "dn8:19.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. … ",

# "this begins the unusual run in DN 8 of 9 anchor segments that correspond to 8 contiguous DN 2 segments",
  "dn8:19.2": "",
  "dn8:19.3": "They refrain from such low lore, such wrong livelihood. ",

# "25th ethics refrain",

  "dn8:19.5": "A mendicant thus accomplished in ethics sees no danger in any quarter in regards to their ethical restraint. ",
  "dn8:19.6": "It’s like a king who has defeated his enemies. He sees no danger from his foes in any quarter. ",
  "dn8:19.7": "In the same way, a mendicant thus accomplished in ethics sees no danger in any quarter in regards to their ethical restraint. ",
  "dn8:19.8": "When they have this entire spectrum of noble ethics, they experience a blameless happiness inside themselves. ",
  "dn8:19.9": "That’s how a mendicant is accomplished in ethics. ",
  "dn8:19.10": "This, Kassapa, is that accomplishment in ethics. … ",
# "the above addendum segment ends the unusual run of 9 contiguous segments",

  "dn8:19.11": "They enter and remain in the first absorption … ",

# "1st immersion refrain",

  "dn8:19.13": "They enter and remain in the second absorption … ",
  "dn8:19.14": "third absorption … ",
  "dn8:19.15": "fourth absorption. ",

# "4th immersion refrain, with addendum",
  "dn8:19.17": "This, Kassapa, is that accomplishment in mind. ",

  "dn8:20.1": "When their mind is immersed like this, ",
  "dn8:20.2": "they project it and extend it toward knowledge and vision … ",
  
# "1st wisdom refrain",

  "dn8:20.4": "They understand: ‘… there is nothing further for this place.’ ",

# "8th wisdom refrain, with addendum (outside of ambit)",
  "dn8:20.6": "This, Kassapa, is that accomplishment in wisdom. ",
  "dn8:20.7": "And, Kassapa, there is no accomplishment in ethics, mind, and wisdom that is better or finer than this. "
}
