{
# "ANCHOR-REMAP",
  "dn9:7.7": "“It’s when a Realized One arises in the world, perfected, a fully awakened Buddha … ",
  "dn2:40.1": "“Consider when a Realized One arises in the world, perfected, a fully awakened Buddha, accomplished in knowledge and conduct, holy, knower of the world, supreme guide for those who wish to train, teacher of gods and humans, awakened, blessed. ",

  "dn2:40.2": "He has realized with his own insight this world—with its gods, Māras, and divinities, this population with its ascetics and brahmins, gods and humans—and he makes it known to others. ",
  "dn2:40.3": "He proclaims a teaching that is good in the beginning, good in the middle, and good in the end, meaningful and well-phrased. And he reveals a spiritual practice that’s entirely full and pure. ",

  "dn2:41.1": "A householder hears that teaching, or a householder’s child, or someone reborn in a good family. ",
  "dn2:41.2": "They gain faith in the Realized One ",
  "dn2:41.3": "and reflect: ",
  "dn2:41.4": "‘Life at home is cramped and dirty, life gone forth is wide open. ",
  "dn2:41.5": "It’s not easy for someone living at home to lead the spiritual life utterly full and pure, like a polished shell. ",
  "dn2:41.6": "Why don’t I shave off my hair and beard, dress in ocher robes, and go forth from the lay life to homelessness?’ ",
  "dn2:41.7": "After some time they give up a large or small fortune, and a large or small family circle. They shave off hair and beard, dress in ocher robes, and go forth from the lay life to homelessness. ",

  "dn2:42.1": "Once they’ve gone forth, they live restrained in the monastic code, conducting themselves well and resorting for alms in suitable places. Seeing danger in the slightest fault, they keep the rules they’ve undertaken. They act skillfully by body and speech. They’re purified in livelihood and accomplished in ethical conduct. They guard the sense doors, have mindfulness and situational awareness, and are content. ",

  "dn2:43.0.1": "4.3.1. Ethics ",
  "dn2:43.0.2": "4.3.1.1. The Shorter Section on Ethics ",
  "dn2:43.1": "And how, great king, is a mendicant accomplished in ethics? ",
  "dn2:43.2": "It’s when a mendicant gives up killing living creatures, renouncing the rod and the sword. They’re scrupulous and kind, living full of sympathy for all living beings. ",
  "dn2:43.3": "This pertains to their ethics. ",
  "dn2:43.4": "They give up stealing. They take only what’s given, and expect only what’s given. They keep themselves clean by not thieving. ",
  "dn2:43.5": "This pertains to their ethics. ",
  "dn2:43.6": "They give up unchastity. They are celibate, set apart, avoiding the vulgar act of sex. ",
  "dn2:43.7": "This pertains to their ethics. ",

  "dn2:44.1": "They give up lying. They speak the truth and stick to the truth. They’re honest and dependable, and don’t trick the world with their words. ",
  "dn2:44.2": "This pertains to their ethics. ",
  "dn2:44.3": "They give up divisive speech. They don’t repeat in one place what they heard in another so as to divide people against each other. Instead, they reconcile those who are divided, supporting unity, delighting in harmony, loving harmony, speaking words that promote harmony. ",
  "dn2:44.4": "This pertains to their ethics. ",
  "dn2:44.5": "They give up harsh speech. They speak in a way that’s mellow, pleasing to the ear, lovely, going to the heart, polite, likable and agreeable to the people. ",
  "dn2:44.6": "This pertains to their ethics. ",
  "dn2:44.7": "They give up talking nonsense. Their words are timely, true, and meaningful, in line with the teaching and training. They say things at the right time which are valuable, reasonable, succinct, and beneficial. ",
  "dn2:44.8": "This pertains to their ethics. ",

  "dn2:45.1": "They refrain from injuring plants and seeds. ",
  "dn2:45.2": "They eat in one part of the day, abstaining from eating at night and food at the wrong time. ",
  "dn2:45.3": "They refrain from seeing shows of dancing, singing, and music . ",
  "dn2:45.4": "They refrain from beautifying and adorning themselves with garlands, fragrance, and makeup. ",
  "dn2:45.5": "They refrain from high and luxurious beds. ",
  "dn2:45.6": "They refrain from receiving gold and currency, ",
  "dn2:45.7": "raw grains, ",
  "dn2:45.8": "raw meat, ",
  "dn2:45.9": "women and girls, ",
  "dn2:45.10": "male and female bondservants, ",
  "dn2:45.11": "goats and sheep, ",
  "dn2:45.12": "chickens and pigs, ",
  "dn2:45.13": "elephants, cows, horses, and mares, ",
  "dn2:45.14": "and fields and land. ",
  "dn2:45.15": "They refrain from running errands and messages; ",
  "dn2:45.16": "buying and selling; ",
  "dn2:45.17": "falsifying weights, metals, or measures; ",
  "dn2:45.18": "bribery, fraud, cheating, and duplicity; ",
  "dn2:45.19": "mutilation, murder, abduction, banditry, plunder, and violence. ",
  "dn2:45.20": "This pertains to their ethics. ",
  "dn2:45.21": "The shorter section on ethics is finished. ",

  "dn2:46.0": "4.3.1.2. The Middle Section on Ethics ",
  "dn2:46.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in injuring plants and seeds. ",
  "dn2:46.2": "These include plants propagated from roots, stems, cuttings, or joints; and those from regular seeds as the fifth. They refrain from such injury to plants and seeds. ",
  "dn2:46.3": "This pertains to their ethics. ",

  "dn2:47.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in storing up goods for their own use. ",
  "dn2:47.2": "This includes such things as food, drink, clothes, vehicles, bedding, fragrance, and things of the flesh. ",
  "dn2:47.3": "They refrain from storing up such goods. ",
  "dn2:47.4": "This pertains to their ethics. ",

  "dn2:48.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in seeing shows. ",
  "dn2:48.2": "This includes such things as dancing, singing, music, performances, and storytelling; clapping, gongs, and kettledrums; beauty pageants; pole-acrobatics and bone-washing displays of the corpse-workers; battles of elephants, horses, buffaloes, bulls, goats, rams, chickens, and quails; staff-fights, boxing, and wrestling; combat, roll calls of the armed forces, battle-formations, and regimental reviews. ",
  "dn2:48.3": "They refrain from such shows. ",
  "dn2:48.4": "This pertains to their ethics. ",

  "dn2:49.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in gambling that causes negligence. ",
  "dn2:49.2": "This includes such things as checkers with eight or ten rows, checkers in the air, hopscotch, spillikins, board-games, tip-cat, drawing straws, dice, leaf-flutes, toy plows, somersaults, pinwheels, toy measures, toy carts, toy bows, guessing words from syllables, guessing another’s thoughts, and imitating musical instruments. ",
  "dn2:49.3": "They refrain from such gambling. ",
  "dn2:49.4": "This pertains to their ethics. ",

  "dn2:50.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still make use of high and luxurious bedding. ",
  "dn2:50.2": "This includes such things as sofas, couches, woolen covers—shag-piled, colorful, white, embroidered with flowers, quilted, embroidered with animals, double-or single-fringed—and silk covers studded with gems, as well as silken sheets, woven carpets, rugs for elephants, horses, or chariots, antelope hide rugs, and spreads of fine deer hide, with a canopy above and red cushions at both ends. ",
  "dn2:50.3": "They refrain from such bedding. ",
  "dn2:50.4": "This pertains to their ethics. ",

  "dn2:51.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in beautifying and adorning themselves with garlands, fragrance, and makeup. ",
  "dn2:51.2": "This includes such things as applying beauty products by anointing, massaging, bathing, and rubbing; mirrors, ointments, garlands, fragrances, and makeup; face-powder, foundation, bracelets, headbands, fancy walking-sticks or containers, rapiers, parasols, fancy sandals, turbans, jewelry, chowries, and long-fringed white robes. ",
  "dn2:51.3": "They refrain from such beautification and adornment. ",
  "dn2:51.4": "This pertains to their ethics. ",

  "dn2:52.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in low talk. ",
  "dn2:52.2": "This includes such topics as talk about kings, bandits, and ministers; talk about armies, threats, and wars; talk about food, drink, clothes, and beds; talk about garlands and fragrances; talk about family, vehicles, villages, towns, cities, and countries; talk about women and heroes; street talk and well talk; talk about the departed; motley talk; tales of land and sea; and talk about being reborn in this or that place. ",
  "dn2:52.3": "They refrain from such low talk. ",
  "dn2:52.4": "This pertains to their ethics. ",

  "dn2:53.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in arguments. ",
  "dn2:53.2": "They say such things as: ‘You don’t understand this teaching and training. I understand this teaching and training. What, you understand this teaching and training? You’re practicing wrong. I’m practicing right. I stay on topic, you don’t. You said last what you should have said first. You said first what you should have said last. What you’ve thought so much about has been disproved. Your doctrine is refuted. Go on, save your doctrine! You’re trapped; get yourself out of this—if you can!’ ",
  "dn2:53.3": "They refrain from such argumentative talk. ",
  "dn2:53.4": "This pertains to their ethics. ",

  "dn2:54.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in running errands and messages. ",
  "dn2:54.2": "This includes running errands for rulers, ministers, aristocrats, brahmins, householders, or princes who say: ‘Go here, go there. Take this, bring that from there.’ ",
  "dn2:54.3": "They refrain from such errands. ",
  "dn2:54.4": "This pertains to their ethics. ",

  "dn2:55.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in deceit, flattery, hinting, and belittling, and using material things to chase after other material things. They refrain from such deceit and flattery. ",
  "dn2:55.2": "This pertains to their ethics. ",
  "dn2:55.3": "The middle section on ethics is finished. ",

  "dn2:56.0": "4.3.1.3. The Long Section on Ethics ",
  "dn2:56.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn2:56.2": "This includes such fields as limb-reading, omenology, divining celestial portents, interpreting dreams, divining bodily marks, divining holes in cloth gnawed by mice, fire offerings, ladle offerings, offerings of husks, rice powder, rice, ghee, or oil; offerings from the mouth, blood sacrifices, palmistry; geomancy for building sites, fields, and cemeteries; exorcisms, earth magic, snake charming, poisons; the lore of the scorpion, the rat, the bird, and the crow; prophesying lifespan, chanting for protection, and divining omens from wild animals. ",
  "dn2:56.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn2:56.4": "This pertains to their ethics. ",

  "dn2:57.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn2:57.2": "This includes reading the marks of gems, cloth, clubs, swords, spears, arrows, bows, weapons, women, men, boys, girls, male and female bondservants, elephants, horses, buffaloes, bulls, cows, goats, rams, chickens, quails, monitor lizards, rabbits, tortoises, or deer. ",
  "dn2:57.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn2:57.4": "This pertains to their ethics. ",

  "dn2:58.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn2:58.2": "This includes making predictions that the king will march forth or march back; or that our king will attack and the enemy king will retreat, or vice versa; or that our king will triumph and the enemy king will be defeated, or vice versa; and so there will be victory for one and defeat for the other. ",
  "dn2:58.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn2:58.4": "This pertains to their ethics. ",

  "dn2:59.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn2:59.2": "This includes making predictions that there will be an eclipse of the moon, or sun, or stars; that the sun, moon, and stars will be in conjunction or in opposition; that there will be a meteor shower, a fiery sky, an earthquake, or thunder in the heavens; that there will be a rising, a setting, a darkening, a brightening of the moon, sun, and stars. And it also includes making predictions about the results of all such phenomena. ",
  "dn2:59.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn2:59.4": "This pertains to their ethics. ",

  "dn2:60.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn2:60.2": "This includes predicting whether there will be plenty of rain or drought; plenty to eat or famine; an abundant harvest or a bad harvest; security or peril; sickness or health. It also includes such occupations as arithmetic, accounting, calculating, poetry, and cosmology. ",
  "dn2:60.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn2:60.4": "This pertains to their ethics. ",

  "dn2:61.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn2:61.2": "This includes making arrangements for giving and taking in marriage; for engagement and divorce; and for scattering rice inwards or outwards at the wedding ceremony. It also includes casting spells for good or bad luck, treating impacted fetuses, binding the tongue, or locking the jaws; charms for the hands and ears; questioning a mirror, a girl, or a god as an oracle; worshiping the sun, worshiping the Great One, breathing fire, and invoking Siri, the goddess of luck. ",
  "dn2:61.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn2:61.4": "This pertains to their ethics. ",

  "dn2:62.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn2:62.2": "This includes rites for propitiation, for granting wishes, for ghosts, for the earth, for rain, for property settlement, and for preparing and consecrating house sites, and rites involving rinsing and bathing, and oblations. It also includes administering emetics, purgatives, expectorants, and phlegmagogues; administering ear-oils, eye restoratives, nasal medicine, ointments, and counter-ointments; surgery with needle and scalpel, treating children, prescribing root medicines, and binding on herbs. ",
  "dn2:62.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn2:62.4": "This pertains to their ethics. ",

  "dn2:63.1": "A mendicant thus accomplished in ethics sees no danger in any quarter in regards to their ethical restraint. ",
  "dn2:63.2": "It’s like a king who has defeated his enemies. He sees no danger from his foes in any quarter. ",
  "dn2:63.3": "In the same way, a mendicant thus accomplished in ethics sees no danger in any quarter in regards to their ethical restraint. ",
  "dn2:63.4": "When they have this entire spectrum of noble ethics, they experience a blameless happiness inside themselves. ",

# "ANCHOR-REMAP",
  "dn9:7.8": "That’s how a mendicant is accomplished in ethics. … ",
  "dn2:63.5": "That’s how a mendicant is accomplished in ethics. ",

  "dn2:63.6": "The longer section on ethics is finished. ",

# "ANCHOR it's all dn9:8.1.x.y the rest of the way, but you can delete this segment",
  "dn9:8.1": "",

  "dn2:64.0.1": "4.3.2. Immersion ",
  "dn2:64.0.2": "4.3.2.1. Sense Restraint ",
  "dn2:64.1": "And how does a mendicant guard the sense doors? ",
  "dn2:64.2": "When a mendicant sees a sight with their eyes, they don’t get caught up in the features and details. ",
  "dn2:64.3": "If the faculty of sight were left unrestrained, bad unskillful qualities of covetousness and displeasure would become overwhelming. For this reason, they practice restraint, protecting the faculty of sight, and achieving its restraint. ",
  "dn2:64.4": "When they hear a sound with their ears … ",
  "dn2:64.5": "When they smell an odor with their nose … ",
  "dn2:64.6": "When they taste a flavor with their tongue … ",
  "dn2:64.7": "When they feel a touch with their body … ",
  "dn2:64.8": "When they know an idea with their mind, they don’t get caught up in the features and details. ",
  "dn2:64.9": "If the faculty of mind were left unrestrained, bad unskillful qualities of covetousness and displeasure would become overwhelming. For this reason, they practice restraint, protecting the faculty of mind, and achieving its restraint. ",
  "dn2:64.10": "When they have this noble sense restraint, they experience an unsullied bliss inside themselves. ",
  "dn2:64.11": "That’s how a mendicant guards the sense doors. ",

  "dn2:65.0": "4.3.2.2. Mindfulness and Situational Awareness ",
  "dn2:65.1": "And how does a mendicant have mindfulness and situational awareness? ",
  "dn2:65.2": "It’s when a mendicant acts with situational awareness when going out and coming back; when looking ahead and aside; when bending and extending the limbs; when bearing the outer robe, bowl and robes; when eating, drinking, chewing, and tasting; when urinating and defecating; when walking, standing, sitting, sleeping, waking, speaking, and keeping silent. ",
  "dn2:65.3": "That’s how a mendicant has mindfulness and situational awareness. ",

  "dn2:66.0": "4.3.2.3. Contentment ",
  "dn2:66.1": "And how is a mendicant content? ",
  "dn2:66.2": "It’s when a mendicant is content with robes to look after the body and almsfood to look after the belly. Wherever they go, they set out taking only these things. ",
  "dn2:66.3": "They’re like a bird: wherever it flies, wings are its only burden. ",
  "dn2:66.4": "In the same way, a mendicant is content with robes to look after the body and almsfood to look after the belly. Wherever they go, they set out taking only these things. ",
  "dn2:66.5": "That’s how a mendicant is content. ",

  "dn2:67.0": "4.3.2.4. Giving Up the Hindrances ",
  "dn2:67.1": "When they have this entire spectrum of noble ethics, this noble sense restraint, this noble mindfulness and situational awareness, and this noble contentment, ",
  "dn2:67.2": "they frequent a secluded lodging—a wilderness, the root of a tree, a hill, a ravine, a mountain cave, a charnel ground, a forest, the open air, a heap of straw. ",
  "dn2:67.3": "After the meal, they return from almsround, sit down cross-legged, set their body straight, and establish mindfulness in their presence. ",

  "dn2:68.1": "Giving up covetousness for the world, they meditate with a heart rid of covetousness, cleansing the mind of covetousness. ",
  "dn2:68.2": "Giving up ill will and malevolence, they meditate with a mind rid of ill will, full of sympathy for all living beings, cleansing the mind of ill will. ",
  "dn2:68.3": "Giving up dullness and drowsiness, they meditate with a mind rid of dullness and drowsiness, perceiving light, mindful and aware, cleansing the mind of dullness and drowsiness. ",
  "dn2:68.4": "Giving up restlessness and remorse, they meditate without restlessness, their mind peaceful inside, cleansing the mind of restlessness and remorse. ",
  "dn2:68.5": "Giving up doubt, they meditate having gone beyond doubt, not undecided about skillful qualities, cleansing the mind of doubt. ",

  "dn2:69.1": "Suppose a man who has gotten into debt were to apply himself to work, ",
  "dn2:69.2": "and his efforts proved successful. ",
  "dn2:69.3": "He would pay off the original loan and have enough left over to support his partner. ",
  "dn2:69.4": "Thinking about this, ",
  "dn2:69.5": "",
  "dn2:69.6": "",
  "dn2:69.7": "",
  "dn2:69.8": "he’d be filled with joy and happiness. ",

  "dn2:70.1": "Suppose there was a person who was sick, suffering, gravely ill. They’d lose their appetite and get physically weak. ",
  "dn2:70.2": "But after some time they’d recover from that illness, and regain their appetite and their strength. ",
  "dn2:70.3": "Thinking about this, ",
  "dn2:70.4": "",
  "dn2:70.5": "",
  "dn2:70.6": "",
  "dn2:70.7": "",
  "dn2:70.8": "they’d be filled with joy and happiness. ",

  "dn2:71.1": "Suppose a person was imprisoned in a jail. ",
  "dn2:71.2": "But after some time they were released from jail, safe and sound, with no loss of wealth. ",
  "dn2:71.3": "Thinking about this, ",
  "dn2:71.4": "",
  "dn2:71.5": "",
  "dn2:71.6": "they’d be filled with joy and happiness. ",

  "dn2:72.1": "Suppose a person was a bondservant. They would not be their own master, but indentured to another, unable to go where they wish. ",
  "dn2:72.2": "But after some time they’d be freed from servitude. They would be their own master, not indentured to another, an emancipated individual able to go where they wish. ",
  "dn2:72.3": "Thinking about this, ",
  "dn2:72.4": "",
  "dn2:72.5": "",
  "dn2:72.6": "they’d be filled with joy and happiness. ",

  "dn2:73.1": "Suppose there was a person with wealth and property who was traveling along a desert road, which was perilous, with nothing to eat. ",
  "dn2:73.2": "But after some time they crossed over the desert safely, arriving within a village, a sanctuary free of peril. ",
  "dn2:73.3": "Thinking about this, ",
  "dn2:73.4": "",
  "dn2:73.5": "",
  "dn2:73.6": "they’d be filled with joy and happiness. ",

  "dn2:74.1": "In the same way, as long as these five hindrances are not given up inside themselves, a mendicant regards them thus as a debt, a disease, a prison, slavery, and a desert crossing. ",
  "dn2:74.2": "But when these five hindrances are given up inside themselves, a mendicant regards this as freedom from debt, good health, release from prison, emancipation, and a place of sanctuary at last. ",
  "dn2:74.3": ""
}
