{
  "dn11:1.2": "This was the scene for some controversial discussions with Jains (<a href='https://suttacentral.net/mn56/en/sujato'>MN 56</a>, <a href='https://suttacentral.net/sn42.8/en/sujato'>SN 42.8</a>), and Sāriputta’s touching declaration of faith shortly before his passing (<a href='https://suttacentral.net/sn47.12/en/sujato'>SN 47.12</a>, <a href='https://suttacentral.net/dn16/en/sujato#1.16.1'>DN 16:1.16.1</a>, <a href='https://suttacentral.net/dn28/en/sujato'>DN 28</a>). It is probably the Pāvā (modern Pawapuri) at which Mahāvīra died according to the Jain tradition. ",
  "dn11:1.3": "Kevaḍḍha is mentioned only here. Manuscripts spell his name variously as Kevaddha or Kevaṭṭa (“fisherman”). The Chinese form <span lang='lzh'>堅固</span> means “sturdy” (from <i lang='pi' translate='no'>dṛḍha</i>) and thus supports Kevaḍḍha. ",
  "dn11:1.5": "I have been asked to do the same thing for the same reason. ",
  "dn11:1.9": "In fact it is forbidden in <a href='https://suttacentral.net/pli-tv-kd15/en/sujato#8.2.23'>Kd 15:8.2.23</a>. ",
  "dn11:2.2": "The reading <i lang='pi' translate='no'>dhaṁsemi</i> is dubious. An old Burmese manuscript has the reading <i lang='pi' translate='no'>dhammaṁ desemi</i>, which echoes the Buddha just above. Note too that Kevaḍḍha urges the Buddha to “direct” the monks (<i lang='pi' translate='no'>samādisatu</i>, from the same root as <i lang='pi' translate='no'>desemi</i>). I think the tension is deliberate: Kevaḍḍha says he isn’t telling the Buddha how to teach, but he absolutely is. Other readings convey the sense “attack, insult”, but this seems out of place. ",
  "dn11:3.8": "As noted previously, the basic sense of <i lang='pi' translate='no'>pāṭihāriya</i> is “demonstration”, and as the context here shows, it may or may not involve a “demonstration of wonders” i.e. a “miracle”. ",
  "dn11:3.10": "These three are mentioned frequently in the suttas. Only the last is endorsed by the Buddha, as it leads to genuine growth. ",
  "dn11:4.5": "Their priors have been confirmed. ",
  "dn11:5.1": "Note how a skeptical mindset sticks closer to the truth. ",
  "dn11:5.2": "“Spell” is <i lang='pi' translate='no'>vijjā</i> (Sanskrit <i lang='pi' translate='no'>vidyā</i>, “(potent) knowledge”, cf. English “wicca”, “wizard”, “witch”).  The commentary says it was practiced by the seers of Gandhāra (north-west Pakistan). Jain tradition also knows a Gandhārī mantra, but attribute it to certain <i lang='pi' translate='no'>vidyādhara</i> deities. Sanskrit tradition similarly knows of a <i lang='pi' translate='no'>vidyādevī</i> (“lore goddess”) named Gandhārī. Gandhāra was an ancient land of learning, and a convenient location for exotic magics. ",
  "dn11:5.7": "These feats that have nothing to do with spiritual growth, hence they may be produced or perhaps faked by a variety of means. ",
  "dn11:6.1": "“Revealing” is <i lang='pi' translate='no'>ādesana</i>, from root <i lang='pi' translate='no'>dis</i> “to indicate, show, or point”. ",
  "dn11:6.2": "The Pali terms here are <i lang='pi' translate='no'>citta</i>, <i lang='pi' translate='no'>cetasika</i>, <i lang='pi' translate='no'>vitakka</i>, and <i lang='pi' translate='no'>vicāra</i>. ",
  "dn11:6.3": "Here we have <i lang='pi' translate='no'>mano</i> (twice) and <i lang='pi' translate='no'>citta</i>. ",
  "dn11:7.2": "From <i lang='pi' translate='no'>maṇi</i>, “gem”. Magical gems are a common feature of Indian storytelling. Buddhist stories often feature the “wish-granting gem” (<i lang='pi' translate='no'>cintāmaṇi</i>), which according to the commentary is meant here. ",
  "dn11:9.1": "This is the start of the teaching on the Gradual Training, encompassing ethics (<i lang='pi' translate='no'>sīla</i>), meditation (<i lang='pi' translate='no'>samādhi</i>), and wisdom (<i lang='pi' translate='no'>paññā</i>). Only the ethics portion appeared in the Brahmajālasutta, while all three are restated in all the remaining suttas of this chapter, although in truncated form. | It is exceedingly rare for a Buddha to appear. ",
  "dn11:9.2": "The Buddha realizes the truth by his own understanding, not through divine intervention or other metaphysical means. ",
  "dn11:9.3": "It is good when first heard, when practicing, and when one has realized the fruits. ",
  "dn11:10.1": "The word “householder” (<i lang='pi' translate='no'>gahapati</i>) informally refers to any lay person, but more specifically indicates someone who owns a house, i.e. a person of standing. The renunciate life is not just for slaves or workers wishing to escape their station. ",
  "dn11:11.1": "This serves as a table of contents for the teachings to come. | Nowadays, the “monastic code” (<i lang='pi' translate='no'>pātimokkha</i>) means the list of rules for monks and nuns found in the Vinayapiṭaka. In the early texts, however, it has three main meanings. Sometimes it does refer to the list of rules, as at <a href='https://suttacentral.net/an10.36/en/sujato#1.6'>AN 10.36:1.6</a>. Here it refers to the code of conduct that follows, which is a non-legalistic set of guidelines that preceded the Vinayapiṭaka. At <a href='https://suttacentral.net/dn14/en/sujato#3.28.1'>DN 14:3.28.1</a> it refers to the verses summarizing monastic conduct known as the “Ovāda Pātimokkha”. ",
  "dn11:12.2": "While the precept includes any living creature, if a monastic murders a human being they are immediately and permanently expelled. ",
  "dn11:12.4": "To steal anything of substantial value is an expulsion offence. ",
  "dn11:12.6": "Buddhist monastics are forbidden from any form of sexual activity. To engage in penetrative intercourse is an expulsion offence. ",
  "dn11:13.1": "While any form of lying is forbidden, if a monastic falsely claims states of enlightenment or deep meditation they are expelled. ",
  "dn11:14.1": "",
  "dn11:14.2": "",
  "dn11:14.3": "",
  "dn11:14.4": "",
  "dn11:14.5": "To avoid sleeping too much. ",
  "dn11:14.6": "",
  "dn11:14.7": "",
  "dn11:14.11": "",
  "dn11:14.14": "",
  "dn11:14.15": "",
  "dn11:14.16": "",
  "dn11:15.1": "",
  "dn11:17.2": "",
  "dn11:22.2": "",
  "dn11:23.2": "",
  "dn11:24.1": "",
  "dn11:25.1": "",
  "dn11:25.2": "",
  "dn11:31.2": "",
  "dn11:32.4": "This is the first step in the Buddha’s answer to Ajātasattu. This is the sense of happiness and well-being that you have when you know you have done nothing wrong for which anyone might blame you. It is the psychological foundation for meditation. ",
  "dn11:33.1": "Here begins the series of practices that build on moral fundamentals to lay the groundwork for meditation. ",
  "dn11:33.3": "It is not that one cannot see things, but that, mindful of its effect, one avoids unnecessary stimulation. | “Covetousness and bitterness” (<i lang='pi' translate='no'>abhijjhā domanassā</i>) are the strong forms of desire and aversion caused by lack of restraint. ",
  "dn11:33.10": "Their happiness deepens, as they see that not only their actions but also their mind is becoming free of anything unwholesome. ",
  "dn11:34.1": "Situational awareness is a psychological term popularized in the 1990s. It has to do with the perception of environmental phenomena and the comprehension of their meaning, which is very close to the sense of the Pali term <i lang='pi' translate='no'>sampajañña</i>. ",
  "dn11:34.2": "These acts describe the daily life of  a mendicant: going into the village for alms, at which time there are many distracting sights. Then they return, eat their meal, and spend their day in meditation. ",
  "dn11:35.2": "A Buddhist monk has three robes: a lower robe (sabong or sarong), an upper robe, and an outer cloak. ",
  "dn11:36.1": "These are the prerequisite conditions for embarking on deep meditation. ",
  "dn11:36.3": "For <i lang='pi' translate='no'>parimukha</i> (“in their presence”) we find <i lang='pi' translate='no'>pratimukha</i> in Sanskrit, which can mean “presence” or the reflection of the face. Late canonical Pali explains <i lang='pi' translate='no'>parimukha</i> as “the tip of the nose or the reflection of the face (<i lang='pi' translate='no'>mukhanimitta</i>)”. <i lang='pi' translate='no'>Parimukha</i> in Sanskrit is rare, but it appears in Pāṇini 4.4.29, which the commentary illustrates with the example of a servant “in the presence” of their master (cp. <a href='https://suttacentral.net/sn47.8/en/sujato'>SN 47.8</a>). So it seems the sense is “before the face” or more generally “in the presence”. | To “establish mindfulness” (<i lang='pi' translate='no'>satiṁ upaṭṭhapetvā</i>) is literally to “do satipaṭṭhāna”. ",
  "dn11:37.1": "Covetousness (<i lang='pi' translate='no'>abhijjha</i>) has been curbed by sense restraint, and now is fully abandoned. ",
  "dn11:37.2": "Likewise ill will (<i lang='pi' translate='no'>byāpādapadosa</i>), which was called <i lang='pi' translate='no'>domanassa</i> in the formula for sense restraint. ",
  "dn11:37.3": "“Mindfulness and situational awareness” has a prominent role in abandoning dullness. ",
  "dn11:37.4": "Restlessness hankers for the future and is countered by contentment. Remorse digs up the past and is countered by ethical purity. ",
  "dn11:37.5": "The meditator set out on their path after gaining faith in the Buddha. ",
  "dn11:38.1": "The happiness of meditation is hard to understand without practicing, so the Buddha gives a series of five similes to illustrate in terms Ajātasattu would understand. ",
  "dn11:43.1": "The five hindrances remain a pillar of meditation teaching. The root sense means to “obstruct” but also to “obscure, darken, veil”. ",
  "dn11:43.2": "Each simile illustrates not the happiness of acquisition, but of letting go. ",
  "dn11:43.4": "The Buddha did not emphasize technical details of technique, but the emotional wholeness and joy that leads to deep meditation. ",
  "dn11:44.1": "<i lang='pi' translate='no'>Jhāna</i> is a state of “elevated consciousness” (<i lang='pi' translate='no'>adhicitta</i>), so all the terms have an elevated sense. | The plural form indicates that “sensual pleasures” includes sense experience, which the meditator can turn away from since they no longer have any desire for it. | The “unskillful qualities” are the five hindrances. | The “rapture and bliss born of seclusion” is the happiness of abandoning the hindrances and freedom from sense impingement. | “Placing the mind and keeping it connected” (<i lang='pi' translate='no'>vitakka</i>, <i lang='pi' translate='no'>vicāra</i>) uses terms that mean “thought” in coarse consciousness, but which in “elevated consciousness” refer to the subtle function of applying the mind to the meditation. ",
  "dn11:44.2": "As a meditator proceeds, their subjective experience of the “body” evolves from tactile sense impressions (<i lang='pi' translate='no'>phoṭṭhabba</i>), to the interior mental experience of bliss and light (<i lang='pi' translate='no'>manomayakāya</i>), to the direct personal realization of highest truth (<a href='https://suttacentral.net/mn70/en/sujato#23.2'>MN 70:23.2</a>: <i lang='pi' translate='no'>kāyena ceva paramasaccaṁ sacchikaroti</i>). ",
  "dn11:45.1": "The kneading is the “placing the mind and keeping it connected”, the water is bliss, while the lack of leaking speaks to the contained interiority of the experience. | Here as elsewhere, water is used as a metaphor for the mind in absorption. Compare Bṛhadāraṇyaka Upaniṣad 4.3.32: “He becomes like water, one, the seer without duality; this is the world of Brahmā.” ",
  "dn11:46.1": "Each <i lang='pi' translate='no'>jhāna</i> begins as the least refined aspect of the previous <i lang='pi' translate='no'>jhāna</i> ends. This is not consciously directed, but describes the natural process of settling. The meditator is now fully confident and no longer needs to apply their mind: it is simply still and fully unified. ",
  "dn11:47.1": "The simile emphasizes the water as bliss, while the lack of inflow expresses containment and unification. ",
  "dn11:47.2": "The water welling up is the rapture, which is the uplifting emotional response to the experience of bliss. ",
  "dn11:48.1": "The emotional response to bliss matures from the subtle thrill of rapture to the poise of equanimity. Mindfulness is present in all states of deep meditation, but with equanimity it becomes prominent. ",
  "dn11:49.1": "The meditator is utterly immersed in stillness and bliss. ",
  "dn11:50.1": "The emotional poise of equanimity leads to the feeling of pleasure settling into the more subtle neutral feeling. Pain and sadness have been abandoned long before, but are emphasized here as they are subtle counterpart of pleasure. ",
  "dn11:50.2": "The equanimity of the fourth <i lang='pi' translate='no'>jhāna</i> is not dullness and indifference, but a brilliant and radiant awareness. ",
  "dn11:51.1": "The white cloth is the purity and brightness of equanimity. The commentary explains this as a person who has just got out of a bath and sits perfectly dry and content. ",
  "dn11:52.1": "Of the eight kinds of knowledge and vision, only the last is considered indispensable. The fourth <i lang='pi' translate='no'>jhāna</i> is the ideal basis for developing higher knowledges, although elsewhere the canon shows that even the first <i lang='pi' translate='no'>jhāna</i> can be a basis for liberating insight. Without <i lang='pi' translate='no'>jhāna</i>, however, the eightfold path is incomplete and liberating insight is impossible. | The verb <i lang='pi' translate='no'>abhininnāmeti</i> (“extend”) indicates that the meditator comes out of full immersion like a tortoise sticking out its limbs (<a href='https://suttacentral.net/sn35.240/en/sujato#1.7'>SN 35.240:1.7</a>). ",
  "dn11:52.3": "This is the “coarse” (<i lang='pi' translate='no'>olārika</i>) body. Note that its generation by mother and father contradicts the doctrine of Ajita Kesakambala. The obvious impermanence of the body invites the tempting but fallacious notion that the mind or soul is permanent, which is dispelled by deeper insight. ",
  "dn11:52.4": "This distinction should not be mistaken for mind-body dualism. These are not fundamental substances but experiences of a meditator. ",
  "dn11:53.2": "Strung gems were loved in India from the time in the Harappan civilization, millennia before the Buddha. ",
  "dn11:53.6": "This form of “knowledge and vision” is rarely mentioned, being found only here, at <a href='https://suttacentral.net/dn10/en/sujato#2.21.3'>DN 10:2.21.3</a>, and at <a href='https://suttacentral.net/mn77/en/sujato#29.2'>MN 77:29.2</a>. The next realization, the “mind-made body” is also only found in these three suttas. | The Mahāsaṅgīti edition adds the spurious title <i lang='pi' translate='no'>vipassanāñāṇa</i> (“insight knowledge”) to this section. This term does not appear anywhere in the Pali canon. ",
  "dn11:54.1": "The “mind-made body” is the interior mental representation of the physical body. In ordinary consciousness it is proprioception, which here is enhanced by the power of meditation. The higher powers in Buddhism are regarded as extensions and evolutions of aspects of ordinary experience, not as metaphysical realities separate from the world of mundane experience. ",
  "dn11:54.2": "This is similar to the experience of the “astral body” described by modern spiritualists. Note that it is still “physical” (<i lang='pi' translate='no'>rūpī</i>) even though it is mind-made. This is the subtle (<i lang='pi' translate='no'>sukhuma</i>) body, which is an energetic experience of physical properties by the mind. ",
  "dn11:56.1": "Here begin the “six direct knowledges” (<i lang='pi' translate='no'>chaḷabhiññā</i>), which are found commonly throughout the early texts. | “Psychic powers” (<i lang='pi' translate='no'>iddhi</i>) were much cultivated in the Buddha’s day, but the means to acquire them varied: devotion to a god, brutal penances, or magic rituals. The Buddha taught that the mind developed in <i lang='pi' translate='no'>samādhi</i> was capable of things that are normally incomprehensible. ",
  "dn11:56.2": "Only a few of these are attested as events in the early texts. The most common is the ability to disappear and reappear, exhibited by the Buddha (<a href='https://suttacentral.net/an8.30/en/sujato#2.1'>AN 8.30:2.1</a>), some disciples (<a href='https://suttacentral.net/mn37/en/sujato#6.1'>MN 37:6.1</a>), and deities (<a href='https://suttacentral.net/mn67/en/sujato#8.1'>MN 67:8.1</a>). ",
  "dn11:57.1": "These similes hark back to the descriptions of the purified mind as pliable and workable. ",
  "dn11:57.3": "This simile is extended in detail at <a href='https://suttacentral.net/an3.101/en/sujato'>AN 3.101</a>. ",
  "dn11:58.1": "“Clairaudience” is a literal rendition of <i lang='pi' translate='no'>dibbasota</i>. The root sense of <i lang='pi' translate='no'>dibba</i> is to “shine” like the bright sky or a divine being. The senses of clarity and divinity are both present. ",
  "dn11:58.2": "The Buddha occasionally used this ability for teaching, as at <a href='https://suttacentral.net/mn75/en/sujato#6.1'>MN 75:6.1</a>. ",
  "dn11:59.1": "The simile emphasizes the clarity and distinctness of the sounds. Compare <a href='https://suttacentral.net/an4.114/en/sujato'>AN 4.114</a>: <i lang='pi' translate='no'>bheripaṇavasaṅkhatiṇavaninnādasaddānaṁ</i>. ",
  "dn11:60.1": "Note that the Indic idiom is not the “reading” of minds, which suggests hearing the words spoken in inner dialogue. While this is exhibited by the Buddha (eg. <a href='https://suttacentral.net/an8.30/en/sujato#2.1'>AN 8.30:2.1</a>), the main emphasis is on the comprehension of the overall state of mind. ",
  "dn11:61.1": "Again the simile emphasizes how clear and direct the experience is. Without deep meditation, we have some intuitive sense for the minds of others, but it is far from clear. ",
  "dn11:62.1": "Here begins the “three knowledges” (<i lang='pi' translate='no'>tevijjā</i>), a subset of the six direct knowledges. The first two of these play an important role in deepening understanding of the nature of suffering in <i lang='pi' translate='no'>saṁsāra</i>. While they are not necessary for those whose wisdom is keen, they are helpful. ",
  "dn11:62.2": "Empowered by the fourth <i lang='pi' translate='no'>jhāna</i>, memory breaks through the veil of birth and death, revealing the vast expanse of time and dispelling the illusion that there is any place of eternal rest or sanctuary in the cycle of transmigration. The knowledge of these events is not hazy or murky, but clear and precise, illuminated by the brilliance of purified consciousness. ",
  "dn11:63.1": "The word for “past life” is <i lang='pi' translate='no'>pubbanivāsa</i>, literally “former home”, and the imagery of houses is found in the second of the three knowledges as well. Recollection of past lives is as fresh and clear as the memory of a recent journey. ",
  "dn11:64.2": "Here knowledge extends to the rebirths of others as well as oneself. Even more significant, it brings in the understanding of cause and effect; <em>why</em> rebirth happens the way it does. Such knowledge, however, is not infallible, as the Buddha warns in <a href='https://suttacentral.net/dn1/en/sujato#2.5.3'>DN 1:2.5.3</a> and <a href='https://suttacentral.net/mn136/en/sujato'>MN 136</a>. The experience is one thing; the inferences drawn from it are another. One should draw conclusions only tentatively, after long experience. | “Clairvoyance” renders <i lang='pi' translate='no'>dibbacakkhu</i> (“celestial eye”), for which see Chāndogya Upaniṣad 8.12.5, “the mind is (the self’s) celestial eye” (<i lang='pi' translate='no'>mano’sya daivaṁ cakṣuḥ</i>). ",
  "dn11:65.1": "This simile is also found at <a href='https://suttacentral.net/dn10/en/sujato#2.33.1'>DN 10:2.33.1</a>. The Majjhima employs a slightly different simile (<a href='https://suttacentral.net/mn39/en/sujato#20.3'>MN 39:20.3</a>, <a href='https://suttacentral.net/mn77/en/sujato#35.2'>MN 77:35.2</a>, <a href='https://suttacentral.net/mn130/en/sujato#2.1'>MN 130:2.1</a>). | <i lang='pi' translate='no'>Pāsāda</i> is often translated as “palace” or “mansion”, but in early Pali it meant a “stilt longhouse”. As here, it is an elevated place from which one can observe the street below. ",
  "dn11:66.1": "This is the experience of awakening that is the true goal of the Buddhist path. The defilements—properties of the mind that create suffering—have been curbed by the practice of ethics and suppressed by the power of <i lang='pi' translate='no'>jhāna</i>. Here they are eliminated forever. ",
  "dn11:66.2": "These are the four noble truths, which form the main content of the Buddha’s first sermon. They are the overarching principle into which all other teachings fall. The initial realization of the four noble truths indicates the first stage of awakening, stream-entry. ",
  "dn11:66.3": "The application of the four noble truths to defilements indicates that this is the final stage of awakening, perfection (or “arahantship”, <i lang='pi' translate='no'>arahatta</i>). | Many translators use “defilement” to render <i lang='pi' translate='no'>kilesa</i>, but since <i lang='pi' translate='no'>kilesa</i> appears only rarely in the early texts, I use “defilement” for <i lang='pi' translate='no'>āsava</i>. Both terms refer to a stain, corruption, or pollution in the mind. ",
  "dn11:66.4": "<i lang='pi' translate='no'>Bhavāsava</i> is the defilement that craves to continue life in a new birth. ",
  "dn11:66.5": "This is a reflective awareness of the fact of awakening. The meditator reviews their mind and sees that it is free from all forces that lead to suffering. ",
  "dn11:66.6": "This is a standard declaration of full awakening in the suttas, said both of the Buddha and of any arahant (“perfected one”). Each of the four phrases illustrates a cardinal principle of awakening. (1) Further transmigration through rebirths has come to an end due to the exhaustion (<i lang='pi' translate='no'>khīṇa</i>) of that which propels rebirth, namely deeds motivated by craving. (2) The eightfold path has been developed fully in all respects. (3) All functions relating to the four noble truths have been completed, namely: understanding suffering, letting go craving, witnessing extinguishment, and developing the path. (4) Extinguishment is final, with no falling back to this or any other state of existence. | For “state of existence” (literally “thusness”, <i lang='pi' translate='no'>itthatta</i>), see <a href='https://suttacentral.net/dn15/en/sujato#21.4'>DN 15:21.4</a>. ",
  "dn11:66.7": "Once again the pool of water represents the mind, but now the meditator is not immersed in the experience, but looks back and reviews it objectively. ",
  "dn11:67.3": "This story is presented as an actual event, but is phrased like a fable. ",
  "dn11:67.4": "The question is about meditation, not the annihilation of the material world. The first four <i lang='pi' translate='no'>jhānas</i> are based on the “subtle form” (<i lang='pi' translate='no'>sukhumarūpa</i>) that manifests as light in deep meditation. He is asking how to go beyond this to the formless attainments. ",
  "dn11:68.1": "The mendicant has already well developed the <i lang='pi' translate='no'>jhānas</i>. | “Controlling the body as far as the Brahmā realm” is one of the “demonstrations of psychic power” listed above. ",
  "dn11:68.2": "The “gods of the Four Great Kings” are deities born in a realm subject to the overlords known as the Four Great Kings. These deities inhabit the lowest of the celestial realms. ",
  "dn11:68.7": "These are powerful spirits who guard the four quarters. In <a href='https://suttacentral.net/an8.36/en/sujato'>AN 8.36</a> it is explained that they, like the other leading gods mentioned below, achieved their station due to their greater generosity and morality. ",
  "dn11:69.6": "The “thirty-three” enjoy refined sensual delights. The number is a reduplication of the trinity. In Buddhist texts they are not enumerated, but Yājñavalkya reckons them as eight Vasus, eleven Rudras, twelve Ādityas, plus Indra and Prajāpati (Bṛhadāraṇyaka Upaniṣad 3.9.2). The final pair are elsewhere said to be Dyaus (“Heaven” = Zeus) and Pṛthivī (“Earth”), or the twin Aśvins. ",
  "dn11:70.6": "Conventionally known as “lord of gods”, but in fact the ruler only of the relatively lowly realm of the thirty-three. He is Vedic Indra, heroic slayer of the dragon Vṛtra, and is the most personally known god in the Pali Canon. ",
  "dn11:72.1": "Gods in this realm (spelled <i lang='pi' translate='no'>yāma</i>, “of Yama”) are subjects of the god of the dead, Yama. ",
  "dn11:80.5": "The previous deities achieved their station by mere morality and generosity, not by <i lang='pi' translate='no'>jhāna</i>. The gods of Brahmā’s Host practiced the first <i lang='pi' translate='no'>jhāna</i>, but they do not know what lies beyond. ",
  "dn11:80.7": "The same passage appears in <a href='https://suttacentral.net/dn1/en/sujato#2.5.2'>DN 1:2.5.2</a>, where it also had a satirical tone, poking fun at the pomposity of religious titles. ",
  "dn11:80.8": "Even Brahmā’s community are not confident. ",
  "dn11:80.12": "This passage may be one of the sources for the later use of <i lang='pi' translate='no'>nimitta</i> to mean the appearance of light that signifies the approach of <i lang='pi' translate='no'>jhāna</i>. ",
  "dn11:81.5": "He puffs his own chest, but like the ascetic teachers of <a href='https://suttacentral.net/dn2/en/sujato'>DN 2</a>, he does not answer the question. ",
  "dn11:82.2": "He addresses Brahmā with <i lang='pi' translate='no'>āvuso</i>. This is often translated as “friend”, but the root is <i lang='pi' translate='no'>āyu</i> (“age”) and it is respectful not familiar. ",
  "dn11:83.1": "Rather than trying to engage with Brahmā’s agenda, he keeps restating his question. This is a skillful way of curbing narcissism. ",
  "dn11:83.6": "Brahmā is embarrassed to reveal his ignorance. Perhaps a satire of Bṛhadāraṇyaka Upaniṣad 3.2.13, where Yājñavalkya takes Jāratkārava Ārtabhāga by the hand and leads him aside for a secret discussion. ",
  "dn11:83.9": "At least he is honest about his lack of knowledge, even if not publicly. ",
  "dn11:85.10": "",
  "dn11:85.11": "The first pair of couplets rephrase the question about where the (absorptions based on) material form cease. The verb is changed to <i lang='pi' translate='no'>gādhati</i>, “find a footing”. | This couplet is also found at <a href='https://suttacentral.net/sn1.27/en/sujato#2.1'>SN 1.27:2.1</a>, <a href='https://suttacentral.net/ud1.10/en/sujato#14.1'>Ud 1.10:14.1</a>. ",
  "dn11:85.12": "The verse is syntactically ambiguous, as there are three couplets, each with the question-word <i lang='pi' translate='no'>kattha</i>, but only two verbs. I take the first pair of couplets as a distinct verse, with the verb <i lang='pi' translate='no'>gādhati</i> acting as a “lamp” illuminating both the first and second couplets. These are also unified in that they deal only with material qualities. ",
  "dn11:85.13": "A similar list of descriptors elsewhere describes things that are not stolen (<a href='https://suttacentral.net/snp3.9/en/sujato#45.1'>Snp 3.9:45.1</a>) or the kinds of sentient beings (<a href='https://suttacentral.net/snp1.8/en/sujato#4.3'>Snp 1.8:4.3</a>). These are aspects of how “form” manifests in desirable or undesirable ways. ",
  "dn11:85.14": "Four terms in this verse are identical with the first four terms in Yājñavalkya’s description of the immutable Brahman as “neither coarse nor fine, neither short nor long” at Bṛhadāraṇyaka Upaniṣad 3.8.8. ",
  "dn11:85.15": "This final couplet is distinguished in having a different verb (“cease”) and in including mental qualities (<i lang='pi' translate='no'>nāma</i>). It therefore appears there are two questions with two answers. ",
  "dn11:85.18": "This couplet is spoken by Baka the Divinity at <a href='https://suttacentral.net/mn49/en/sujato#25.1'>MN 49:25.1</a>, so it was probably a free-floating couplet illustrating the Upaniṣadic theory of the Self as infinite consciousness. I think the Buddha is quoting Brahmā here in order to contrast with his own teaching of the cessation of consciousness, to emphasize that <em>even this</em> most sublime form of consciousness will cease. | “Where no form appears” (<i lang='pi' translate='no'>anidassanaṁ</i>) here is a synonym for “formless” (see eg. <a href='https://suttacentral.net/mn21/en/sujato#14.8'>MN 21:14.8</a>, “space is formless and invisible”, <i lang='pi' translate='no'>ākāso arūpī anidassano</i>). Normally the colors and images seen in the “form” absorptions are described as “appearing” (eg. <a href='https://suttacentral.net/dn16/en/sujato#3.29.1'>DN 16:3.29.1</a>), so this indicates a formless attainment. ",
  "dn11:85.19": "“Infinite” (<i lang='pi' translate='no'>ananta</i>) is the direct qualifier of “consciousness”, but in the Pali it is shifted to the next line to fit the meter. It indicates the second of the formless attainments. Yājñavalkya describes consciousness as infinite in the famous passage at Bṛhadāraṇyaka Upaniṣad 2.4.12. | <i lang='pi' translate='no'>Pabhaṁ</i> means “luminous”, as with the deities that are “self-luminous” (<i lang='pi' translate='no'>sayaṁpabhā</i>, <a href='https://suttacentral.net/dn27/en/sujato#10.3'>DN 27:10.3</a>). This echoes descriptions of the Divinity of consciousness as “radiant” (Bṛhadāraṇyaka Upaniṣad 5.6.1, Chāndogya Upaniṣad 3.14.2) | <i lang='pi' translate='no'>Sabbato pabhaṁ</i> (“luminous all-round”) is synonymous with <i lang='pi' translate='no'>pariyodāta</i> (“bright”, literally “white all over”), a stock descriptor of the mind of fourth <i lang='pi' translate='no'>jhāna</i>, on which the formless states are based. ",
  "dn11:85.20": "The division of these ten lines is not obvious. Since the previous couplet appears to be an independent saying, I take the remaining eight lines as two four-line verses. This couplet, too, appears as the first two lines of a six-line verse, with the initial <i lang='pi' translate='no'>yattha</i> rather than <i lang='pi' translate='no'>ettha</i> (<a href='https://suttacentral.net/sn1.27/en/sujato#2.1'>SN 1.27:2.1</a>). ",
  "dn11:85.21": "The verb “do not remain” applies to both the former and subsequent couplet. ",
  "dn11:85.24": "These lines also at <a href='https://suttacentral.net/snp5.2/en/sujato#6.6'>Snp 5.2:6.6</a>, with initial <i lang='pi' translate='no'>yattha</i> instead of <i lang='pi' translate='no'>ettha</i>. ",
  "dn11:85.26": "According to dependent origination, when consciousness ceases, name and form cease, and with it the manifestation of all things desirable and undesirable in the world. ",
  "dn11:85.27": "Throughout, take the locative <i lang='pi' translate='no'>ettha</i> as locative of reference, as in similar constructions at eg. <a href='https://suttacentral.net/sn1.30/en/sujato'>SN 1.30</a>. The point is that when the Buddha is speaking of the cessation of consciousness, he is speaking specifically of the “infinite consciousness” of the Upaniṣads: <em>that</em> is what ceases. "
}