{
  "dn12:0.1": "Dīgha Nikāya 12 ",
  "dn12:0.2": "Lohiccasutta ",
  "dn12:1.1": "Evaṁ me sutaṁ—",
  "dn12:1.2": "ekaṁ samayaṁ bhagavā kosalesu cārikaṁ caramāno mahatā bhikkhusaṅghena saddhiṁ pañcamattehi bhikkhusatehi yena sālavatikā tadavasari. ",
  "dn12:1.3": "Tena kho pana samayena lohicco brāhmaṇo sālavatikaṁ ajjhāvasati sattussadaṁ satiṇakaṭṭhodakaṁ sadhaññaṁ rājabhoggaṁ raññā pasenadinā kosalena dinnaṁ rājadāyaṁ brahmadeyyaṁ. ",
  "dn12:2.1": "Tena kho pana samayena lohiccassa brāhmaṇassa evarūpaṁ pāpakaṁ diṭṭhigataṁ uppannaṁ hoti: ",
  "dn12:2.2": "“idha samaṇo vā brāhmaṇo vā kusalaṁ dhammaṁ adhigaccheyya, kusalaṁ dhammaṁ adhigantvā na parassa āroceyya, kiñhi paro parassa karissati. ",
  "dn12:2.3": "Seyyathāpi nāma purāṇaṁ bandhanaṁ chinditvā aññaṁ navaṁ bandhanaṁ kareyya; ",
  "dn12:2.4": "evaṁ sampadamidaṁ pāpakaṁ lobhadhammaṁ vadāmi, kiñhi paro parassa karissatī”ti. ",
  "dn12:3.1": "Assosi kho lohicco brāhmaṇo: ",
  "dn12:3.2": "“samaṇo khalu, bho, gotamo sakyaputto sakyakulā pabbajito kosalesu cārikaṁ caramāno mahatā bhikkhusaṅghena saddhiṁ pañcamattehi bhikkhusatehi sālavatikaṁ anuppatto. ",
  "dn12:3.3": "Taṁ kho pana bhavantaṁ gotamaṁ evaṁ kalyāṇo kittisaddo abbhuggato: ",
  "dn12:3.4": "‘itipi so bhagavā arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā’. ",
  "dn12:3.5": "So imaṁ lokaṁ sadevakaṁ samārakaṁ sabrahmakaṁ sassamaṇabrāhmaṇiṁ pajaṁ sadevamanussaṁ sayaṁ abhiññā sacchikatvā pavedeti. ",
  "dn12:3.6": "So dhammaṁ deseti ādikalyāṇaṁ majjhekalyāṇaṁ pariyosānakalyāṇaṁ sātthaṁ sabyañjanaṁ kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ pakāseti. ",
  "dn12:3.7": "Sādhu kho pana tathārūpānaṁ arahataṁ dassanaṁ hotī”ti. ",
  "dn12:4.1": "Atha kho lohicco brāhmaṇo rosikaṁ nhāpitaṁ āmantesi: ",
  "dn12:4.2": "“ehi tvaṁ, samma rosike, yena samaṇo gotamo tenupasaṅkama; upasaṅkamitvā mama vacanena samaṇaṁ gotamaṁ appābādhaṁ appātaṅkaṁ lahuṭṭhānaṁ balaṁ phāsuvihāraṁ puccha: ",
  "dn12:4.3": "‘lohicco, bho gotama, brāhmaṇo bhavantaṁ gotamaṁ appābādhaṁ appātaṅkaṁ lahuṭṭhānaṁ balaṁ phāsuvihāraṁ pucchatī’ti; ",
  "dn12:4.4": "evañca vadehi—",
  "dn12:4.5": "adhivāsetu kira bhavaṁ gotamo lohiccassa brāhmaṇassa svātanāya bhattaṁ saddhiṁ bhikkhusaṅghenā”ti. ",
  "dn12:5.1": "“Evaṁ, bho”ti kho rosikā nhāpito lohiccassa brāhmaṇassa paṭissutvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho rosikā nhāpito bhagavantaṁ etadavoca: ",
  "dn12:5.2": "“lohicco, bhante, brāhmaṇo bhagavantaṁ appābādhaṁ appātaṅkaṁ lahuṭṭhānaṁ balaṁ phāsuvihāraṁ pucchati; ",
  "dn12:5.3": "evañca vadeti—",
  "dn12:5.4": "adhivāsetu kira, bhante, bhagavā lohiccassa brāhmaṇassa svātanāya bhattaṁ saddhiṁ bhikkhusaṅghenā”ti. ",
  "dn12:5.5": "Adhivāsesi bhagavā tuṇhībhāvena. ",
  "dn12:6.1": "Atha kho rosikā nhāpito bhagavato adhivāsanaṁ viditvā uṭṭhāyāsanā bhagavantaṁ abhivādetvā padakkhiṇaṁ katvā yena lohicco brāhmaṇo tenupasaṅkami; upasaṅkamitvā lohiccaṁ brāhmaṇaṁ etadavoca: ",
  "dn12:6.2": "“avocumhā kho mayaṁ bhoto vacanena taṁ bhagavantaṁ: ",
  "dn12:6.3": "‘lohicco, bhante, brāhmaṇo bhagavantaṁ appābādhaṁ appātaṅkaṁ lahuṭṭhānaṁ balaṁ phāsuvihāraṁ pucchati; ",
  "dn12:6.4": "evañca vadeti—",
  "dn12:6.5": "adhivāsetu kira, bhante, bhagavā lohiccassa brāhmaṇassa svātanāya bhattaṁ saddhiṁ bhikkhusaṅghenā’ti. ",
  "dn12:6.6": "Adhivutthañca pana tena bhagavatā”ti. ",
  "dn12:7.1": "Atha kho lohicco brāhmaṇo tassā rattiyā accayena sake nivesane paṇītaṁ khādanīyaṁ bhojanīyaṁ paṭiyādāpetvā rosikaṁ nhāpitaṁ āmantesi: ",
  "dn12:7.2": "“ehi tvaṁ, samma rosike, yena samaṇo gotamo tenupasaṅkama; upasaṅkamitvā samaṇassa gotamassa kālaṁ ārocehi—",
  "dn12:7.3": "kālo, bho gotama, niṭṭhitaṁ bhattan”ti. ",
  "dn12:7.4": "“Evaṁ, bho”ti kho rosikā nhāpito lohiccassa brāhmaṇassa paṭissutvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ aṭṭhāsi. ",
  "dn12:7.5": "Ekamantaṁ ṭhito kho rosikā nhāpito bhagavato kālaṁ ārocesi: ",
  "dn12:7.6": "“kālo, bhante, niṭṭhitaṁ bhattan”ti. ",
  "dn12:7.7": "Atha kho bhagavā pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya saddhiṁ bhikkhusaṅghena yena sālavatikā tenupasaṅkami. ",
  "dn12:8.1": "Tena kho pana samayena rosikā nhāpito bhagavantaṁ piṭṭhito piṭṭhito anubandho hoti. ",
  "dn12:8.2": "Atha kho rosikā nhāpito bhagavantaṁ etadavoca: ",
  "dn12:8.3": "“lohiccassa, bhante, brāhmaṇassa evarūpaṁ pāpakaṁ diṭṭhigataṁ uppannaṁ: ",
  "dn12:8.4": "‘idha samaṇo vā brāhmaṇo vā kusalaṁ dhammaṁ adhigaccheyya, kusalaṁ dhammaṁ adhigantvā na parassa āroceyya—",
  "dn12:8.5": "kiñhi paro parassa karissati. ",
  "dn12:8.6": "Seyyathāpi nāma purāṇaṁ bandhanaṁ chinditvā aññaṁ navaṁ bandhanaṁ kareyya; ",
  "dn12:8.7": "evaṁ sampadamidaṁ pāpakaṁ lobhadhammaṁ vadāmi—",
  "dn12:8.8": "kiñhi paro parassa karissatī’ti. ",
  "dn12:8.9": "Sādhu, bhante, bhagavā lohiccaṁ brāhmaṇaṁ etasmā pāpakā diṭṭhigatā vivecetū”ti. ",
  "dn12:8.10": "“Appeva nāma siyā, rosike, appeva nāma siyā, rosike”ti. ",
  "dn12:9.1": "Atha kho bhagavā yena lohiccassa brāhmaṇassa nivesanaṁ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. ",
  "dn12:9.2": "Atha kho lohicco brāhmaṇo buddhappamukhaṁ bhikkhusaṅghaṁ paṇītena khādanīyena bhojanīyena sahatthā santappesi sampavāresi. ",
  "dn12:9.3.0": "1. Lohiccabrāhmaṇānuyoga ",
  "dn12:9.4": "Atha kho lohicco brāhmaṇo bhagavantaṁ bhuttāviṁ onītapattapāṇiṁ aññataraṁ nīcaṁ āsanaṁ gahetvā ekamantaṁ nisīdi. ",
  "dn12:9.5": "Ekamantaṁ nisinnaṁ kho lohiccaṁ brāhmaṇaṁ bhagavā etadavoca: ",
  "dn12:9.6": "“saccaṁ kira te, lohicca, evarūpaṁ pāpakaṁ diṭṭhigataṁ uppannaṁ: ",
  "dn12:9.7": "‘idha samaṇo vā brāhmaṇo vā kusalaṁ dhammaṁ adhigaccheyya, kusalaṁ dhammaṁ adhigantvā na parassa āroceyya, kiñhi paro parassa karissati. ",
  "dn12:9.8": "Seyyathāpi nāma purāṇaṁ bandhanaṁ chinditvā aññaṁ navaṁ bandhanaṁ kareyya; ",
  "dn12:9.9": "evaṁ sampadamidaṁ pāpakaṁ lobhadhammaṁ vadāmi, kiñhi paro parassa karissatī’”ti? ",
  "dn12:9.10": "“Evaṁ, bho gotama”. ",
  "dn12:10.1": "“Taṁ kiṁ maññasi, lohicca, ",
  "dn12:10.2": "nanu tvaṁ sālavatikaṁ ajjhāvasasī”ti? ",
  "dn12:10.3": "“Evaṁ, bho gotama”. ",
  "dn12:10.4": "“Yo nu kho, lohicca, evaṁ vadeyya: ",
  "dn12:10.5": "‘lohicco brāhmaṇo sālavatikaṁ ajjhāvasati. ",
  "dn12:10.6": "Yā sālavatikāya samudayasañjāti lohiccova taṁ brāhmaṇo ekako paribhuñjeyya, na aññesaṁ dadeyyā’ti. ",
  "dn12:10.7": "Evaṁ vādī so ye taṁ upajīvanti, tesaṁ antarāyakaro vā hoti, no vā”ti? ",
  "dn12:10.8": "“Antarāyakaro, bho gotama”. ",
  "dn12:10.9": "“Antarāyakaro samāno hitānukampī vā tesaṁ hoti ahitānukampī vā”ti? ",
  "dn12:10.10": "“Ahitānukampī, bho gotama”. ",
  "dn12:10.11": "“Ahitānukampissa mettaṁ vā tesu cittaṁ paccupaṭṭhitaṁ hoti sapattakaṁ vā”ti? ",
  "dn12:10.12": "“Sapattakaṁ, bho gotama”. ",
  "dn12:10.13": "“Sapattake citte paccupaṭṭhite micchādiṭṭhi vā hoti sammādiṭṭhi vā”ti? ",
  "dn12:10.14": "“Micchādiṭṭhi, bho gotama”. ",
  "dn12:10.15": "“Micchādiṭṭhissa kho ahaṁ, lohicca, dvinnaṁ gatīnaṁ aññataraṁ gatiṁ vadāmi—",
  "dn12:10.16": "nirayaṁ vā tiracchānayoniṁ vā. ",
  "dn12:11.1": "Taṁ kiṁ maññasi, lohicca, ",
  "dn12:11.2": "nanu rājā pasenadi kosalo kāsikosalaṁ ajjhāvasatī”ti? ",
  "dn12:11.3": "“Evaṁ, bho gotama”. ",
  "dn12:11.4": "“Yo nu kho, lohicca, evaṁ vadeyya: ",
  "dn12:11.5": "‘rājā pasenadi kosalo kāsikosalaṁ ajjhāvasati; ",
  "dn12:11.6": "yā kāsikosale samudayasañjāti, rājāva taṁ pasenadi kosalo ekako paribhuñjeyya, na aññesaṁ dadeyyā’ti. ",
  "dn12:11.7": "Evaṁ vādī so ye rājānaṁ pasenadiṁ kosalaṁ upajīvanti tumhe ceva aññe ca, tesaṁ antarāyakaro vā hoti, no vā”ti? ",
  "dn12:11.8": "“Antarāyakaro, bho gotama”. ",
  "dn12:11.9": "“Antarāyakaro samāno hitānukampī vā tesaṁ hoti ahitānukampī vā”ti? ",
  "dn12:11.10": "“Ahitānukampī, bho gotama”. ",
  "dn12:11.11": "“Ahitānukampissa mettaṁ vā tesu cittaṁ paccupaṭṭhitaṁ hoti sapattakaṁ vā”ti? ",
  "dn12:11.12": "“Sapattakaṁ, bho gotama”. ",
  "dn12:11.13": "“Sapattake citte paccupaṭṭhite micchādiṭṭhi vā hoti sammādiṭṭhi vā”ti? ",
  "dn12:11.14": "“Micchādiṭṭhi, bho gotama”. ",
  "dn12:11.15": "“Micchādiṭṭhissa kho ahaṁ, lohicca, dvinnaṁ gatīnaṁ aññataraṁ gatiṁ vadāmi—",
  "dn12:11.16": "nirayaṁ vā tiracchānayoniṁ vā. ",
  "dn12:12.1": "Iti kira, lohicca, yo evaṁ vadeyya: ",
  "dn12:12.2": "‘lohicco brāhmaṇo sālavatikaṁ ajjhāvasati; ",
  "dn12:12.3": "yā sālavatikāya samudayasañjāti, lohiccova taṁ brāhmaṇo ekako paribhuñjeyya, na aññesaṁ dadeyyā’ti. ",
  "dn12:13.1": "Evaṁvādī so ye taṁ upajīvanti, tesaṁ antarāyakaro hoti. ",
  "dn12:13.2": "Antarāyakaro samāno ahitānukampī hoti, ahitānukampissa sapattakaṁ cittaṁ paccupaṭṭhitaṁ hoti, sapattake citte paccupaṭṭhite micchādiṭṭhi hoti. ",
  "dn12:13.3": "Evameva kho, lohicca, yo evaṁ vadeyya: ",
  "dn12:13.4": "‘idha samaṇo vā brāhmaṇo vā kusalaṁ dhammaṁ adhigaccheyya, kusalaṁ dhammaṁ adhigantvā na parassa āroceyya, kiñhi paro parassa karissati. ",
  "dn12:13.5": "Seyyathāpi nāma purāṇaṁ bandhanaṁ chinditvā aññaṁ navaṁ bandhanaṁ kareyya …pe… ",
  "dn12:13.6": "karissatī’ti. ",
  "dn12:13.7": "Evaṁvādī so ye te kulaputtā tathāgatappaveditaṁ dhammavinayaṁ āgamma evarūpaṁ uḷāraṁ visesaṁ adhigacchanti, sotāpattiphalampi sacchikaronti, sakadāgāmiphalampi sacchikaronti, anāgāmiphalampi sacchikaronti, arahattampi sacchikaronti, ye cime dibbā gabbhā paripācenti dibbānaṁ bhavānaṁ abhinibbattiyā, tesaṁ antarāyakaro hoti, antarāyakaro samāno ahitānukampī hoti, ahitānukampissa sapattakaṁ cittaṁ paccupaṭṭhitaṁ hoti, sapattake citte paccupaṭṭhite micchādiṭṭhi hoti. ",
  "dn12:13.8": "Micchādiṭṭhissa kho ahaṁ, lohicca, dvinnaṁ gatīnaṁ aññataraṁ gatiṁ vadāmi—",
  "dn12:13.9": "nirayaṁ vā tiracchānayoniṁ vā. ",
  "dn12:14.1": "Iti kira, lohicca, yo evaṁ vadeyya: ",
  "dn12:14.2": "‘rājā pasenadi kosalo kāsikosalaṁ ajjhāvasati; ",
  "dn12:14.3": "yā kāsikosale samudayasañjāti, rājāva taṁ pasenadi kosalo ekako paribhuñjeyya, na aññesaṁ dadeyyā’ti. ",
  "dn12:15.1": "Evaṁvādī so ye rājānaṁ pasenadiṁ kosalaṁ upajīvanti tumhe ceva aññe ca, tesaṁ antarāyakaro hoti. ",
  "dn12:15.2": "Antarāyakaro samāno ahitānukampī hoti, ahitānukampissa sapattakaṁ cittaṁ paccupaṭṭhitaṁ hoti, sapattake citte paccupaṭṭhite micchādiṭṭhi hoti. ",
  "dn12:15.3": "Evameva kho, lohicca, yo evaṁ vadeyya: ",
  "dn12:15.4": "‘idha samaṇo vā brāhmaṇo vā kusalaṁ dhammaṁ adhigaccheyya, kusalaṁ dhammaṁ adhigantvā na parassa āroceyya, kiñhi paro parassa karissati. ",
  "dn12:15.5": "Seyyathāpi nāma …pe… ",
  "dn12:15.6": "kiñhi paro parassa karissatī’ti. ",
  "dn12:15.7": "Evaṁvādī so ye te kulaputtā tathāgatappaveditaṁ dhammavinayaṁ āgamma evarūpaṁ uḷāraṁ visesaṁ adhigacchanti, sotāpattiphalampi sacchikaronti, sakadāgāmiphalampi sacchikaronti, anāgāmiphalampi sacchikaronti, arahattampi sacchikaronti. ",
  "dn12:15.8": "Ye cime dibbā gabbhā paripācenti dibbānaṁ bhavānaṁ abhinibbattiyā, tesaṁ antarāyakaro hoti, ",
  "dn12:15.9": "antarāyakaro samāno ahitānukampī hoti, ahitānukampissa sapattakaṁ cittaṁ paccupaṭṭhitaṁ hoti, sapattake citte paccupaṭṭhite micchādiṭṭhi hoti. ",
  "dn12:15.10": "Micchādiṭṭhissa kho ahaṁ, lohicca, dvinnaṁ gatīnaṁ aññataraṁ gatiṁ vadāmi—",
  "dn12:15.11": "nirayaṁ vā tiracchānayoniṁ vā. ",
  "dn12:16.0": "2. Tayocodanārahā ",
  "dn12:16.1": "Tayo khome, lohicca, satthāro, ye loke codanārahā; ",
  "dn12:16.2": "yo ca panevarūpe satthāro codeti, sā codanā bhūtā tacchā dhammikā anavajjā. ",
  "dn12:16.3": "Katame tayo? ",
  "dn12:16.4": "Idha, lohicca, ekacco satthā yassatthāya agārasmā anagāriyaṁ pabbajito hoti, svāssa sāmaññattho ananuppatto hoti. ",
  "dn12:16.5": "So taṁ sāmaññatthaṁ ananupāpuṇitvā sāvakānaṁ dhammaṁ deseti: ",
  "dn12:16.6": "‘idaṁ vo hitāya idaṁ vo sukhāyā’ti. ",
  "dn12:16.7": "Tassa sāvakā na sussūsanti, na sotaṁ odahanti, na aññā cittaṁ upaṭṭhapenti, vokkamma ca satthusāsanā vattanti. ",
  "dn12:16.8": "So evamassa codetabbo: ",
  "dn12:16.9": "‘āyasmā kho yassatthāya agārasmā anagāriyaṁ pabbajito, so te sāmaññattho ananuppatto, taṁ tvaṁ sāmaññatthaṁ ananupāpuṇitvā sāvakānaṁ dhammaṁ desesi: ",
  "dn12:16.10": "“idaṁ vo hitāya idaṁ vo sukhāyā”ti. ",
  "dn12:16.11": "Tassa te sāvakā na sussūsanti, na sotaṁ odahanti, na aññā cittaṁ upaṭṭhapenti, vokkamma ca satthusāsanā vattanti. ",
  "dn12:16.12": "Seyyathāpi nāma osakkantiyā vā ussakkeyya, parammukhiṁ vā āliṅgeyya; ",
  "dn12:16.13": "evaṁ sampadamidaṁ pāpakaṁ lobhadhammaṁ vadāmi—",
  "dn12:16.14": "kiñhi paro parassa karissatī’ti. ",
  "dn12:16.15": "Ayaṁ kho, lohicca, paṭhamo satthā, yo loke codanāraho; ",
  "dn12:16.16": "yo ca panevarūpaṁ satthāraṁ codeti, sā codanā bhūtā tacchā dhammikā anavajjā. ",
  "dn12:17.1": "Puna caparaṁ, lohicca, idhekacco satthā yassatthāya agārasmā anagāriyaṁ pabbajito hoti, svāssa sāmaññattho ananuppatto hoti. ",
  "dn12:17.2": "So taṁ sāmaññatthaṁ ananupāpuṇitvā sāvakānaṁ dhammaṁ deseti: ",
  "dn12:17.3": "‘idaṁ vo hitāya, idaṁ vo sukhāyā’ti. ",
  "dn12:17.4": "Tassa sāvakā sussūsanti, sotaṁ odahanti, aññā cittaṁ upaṭṭhapenti, na ca vokkamma satthusāsanā vattanti. ",
  "dn12:17.5": "So evamassa codetabbo: ",
  "dn12:17.6": "‘āyasmā kho yassatthāya agārasmā anagāriyaṁ pabbajito, so te sāmaññattho ananuppatto. Taṁ tvaṁ sāmaññatthaṁ ananupāpuṇitvā sāvakānaṁ dhammaṁ desesi: ",
  "dn12:17.7": "“idaṁ vo hitāya, idaṁ vo sukhāyā”ti. ",
  "dn12:17.8": "Tassa te sāvakā sussūsanti, sotaṁ odahanti, aññā cittaṁ upaṭṭhapenti, na ca vokkamma satthusāsanā vattanti. ",
  "dn12:17.9": "Seyyathāpi nāma sakaṁ khettaṁ ohāya paraṁ khettaṁ niddāyitabbaṁ maññeyya, evaṁ sampadamidaṁ pāpakaṁ lobhadhammaṁ vadāmi—kiñhi paro parassa karissatī’ti. ",
  "dn12:17.10": "Ayaṁ kho, lohicca, dutiyo satthā, yo, loke codanāraho; ",
  "dn12:17.11": "yo ca panevarūpaṁ satthāraṁ codeti, sā codanā bhūtā tacchā dhammikā anavajjā. ",
  "dn12:18.1": "Puna caparaṁ, lohicca, idhekacco satthā yassatthāya agārasmā anagāriyaṁ pabbajito hoti, svāssa sāmaññattho anuppatto hoti. ",
  "dn12:18.2": "So taṁ sāmaññatthaṁ anupāpuṇitvā sāvakānaṁ dhammaṁ deseti: ",
  "dn12:18.3": "‘idaṁ vo hitāya, idaṁ vo sukhāyā’ti. ",
  "dn12:18.4": "Tassa sāvakā na sussūsanti, na sotaṁ odahanti, na aññā cittaṁ upaṭṭhapenti, vokkamma ca satthusāsanā vattanti. ",
  "dn12:18.5": "So evamassa codetabbo: ",
  "dn12:18.6": "‘āyasmā kho yassatthāya agārasmā anagāriyaṁ pabbajito, so te sāmaññattho anuppatto. ",
  "dn12:18.7": "Taṁ tvaṁ sāmaññatthaṁ anupāpuṇitvā sāvakānaṁ dhammaṁ desesi: ",
  "dn12:18.8": "“idaṁ vo hitāya, idaṁ vo sukhāyā”ti. ",
  "dn12:18.9": "Tassa te sāvakā na sussūsanti, na sotaṁ odahanti, na aññā cittaṁ upaṭṭhapenti, vokkamma ca satthusāsanā vattanti. ",
  "dn12:18.10": "Seyyathāpi nāma purāṇaṁ bandhanaṁ chinditvā aññaṁ navaṁ bandhanaṁ kareyya; ",
  "dn12:18.11": "evaṁ sampadamidaṁ pāpakaṁ lobhadhammaṁ vadāmi, kiñhi paro parassa karissatī’ti. ",
  "dn12:18.12": "Ayaṁ kho, lohicca, tatiyo satthā, yo loke codanāraho; ",
  "dn12:18.13": "yo ca panevarūpaṁ satthāraṁ codeti, sā codanā bhūtā tacchā dhammikā anavajjā. ",
  "dn12:18.14": "Ime kho, lohicca, tayo satthāro, ye loke codanārahā, ",
  "dn12:18.15": "yo ca panevarūpe satthāro codeti, sā codanā bhūtā tacchā dhammikā anavajjā”ti. ",
  "dn12:19.0": "3. Nacodanārahasatthu ",
  "dn12:19.1": "Evaṁ vutte, lohicco brāhmaṇo bhagavantaṁ etadavoca: ",
  "dn12:19.2": "“atthi pana, bho gotama, koci satthā, yo loke nacodanāraho”ti? ",
  "dn12:19.3": "“Atthi kho, lohicca, satthā, yo loke nacodanāraho”ti. ",
  "dn12:19.4": "“Katamo pana so, bho gotama, satthā, yo loke nacodanāraho”ti? ",
  "dn12:20.1": "“idha, mahārāja, tathāgato loke uppajjati arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā. ",
  "dn12:20.2": "So imaṁ lokaṁ sadevakaṁ samārakaṁ sabrahmakaṁ sassamaṇabrāhmaṇiṁ pajaṁ sadevamanussaṁ sayaṁ abhiññā sacchikatvā pavedeti. ",
  "dn12:20.3": "So dhammaṁ deseti ādikalyāṇaṁ majjhekalyāṇaṁ pariyosānakalyāṇaṁ sātthaṁ sabyañjanaṁ, kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ pakāseti. ",
  "dn12:21.1": "Taṁ dhammaṁ suṇāti gahapati vā gahapatiputto vā aññatarasmiṁ vā kule paccājāto. ",
  "dn12:21.2": "So taṁ dhammaṁ sutvā tathāgate saddhaṁ paṭilabhati. ",
  "dn12:21.3": "So tena saddhāpaṭilābhena samannāgato iti paṭisañcikkhati: ",
  "dn12:21.4": "‘sambādho gharāvāso rajopatho, abbhokāso pabbajjā. ",
  "dn12:21.5": "Nayidaṁ sukaraṁ agāraṁ ajjhāvasatā ekantaparipuṇṇaṁ ekantaparisuddhaṁ saṅkhalikhitaṁ brahmacariyaṁ carituṁ. ",
  "dn12:21.6": "Yannūnāhaṁ kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajeyyan’ti. ",
  "dn12:21.7": "So aparena samayena appaṁ vā bhogakkhandhaṁ pahāya mahantaṁ vā bhogakkhandhaṁ pahāya appaṁ vā ñātiparivaṭṭaṁ pahāya mahantaṁ vā ñātiparivaṭṭaṁ pahāya kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajati. ",
  "dn12:22.1": "So evaṁ pabbajito samāno pātimokkhasaṁvarasaṁvuto viharati ācāragocarasampanno, aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu, kāyakammavacīkammena samannāgato kusalena, parisuddhājīvo sīlasampanno, indriyesu guttadvāro, satisampajaññena samannāgato, santuṭṭho. ",
  "dn12:23.0.1": "3.1. Sīla ",
  "dn12:23.0.2": "3.1.1. Cūḷasīla ",
  "dn12:23.1": "Kathañca, mahārāja, bhikkhu sīlasampanno hoti? ",
  "dn12:23.2": "Idha, mahārāja, bhikkhu pāṇātipātaṁ pahāya pāṇātipātā paṭivirato hoti. Nihitadaṇḍo nihitasattho lajjī dayāpanno sabbapāṇabhūtahitānukampī viharati. ",
  "dn12:23.3": "Idampissa hoti sīlasmiṁ. ",
  "dn12:23.4": "Adinnādānaṁ pahāya adinnādānā paṭivirato hoti dinnādāyī dinnapāṭikaṅkhī, athenena sucibhūtena attanā viharati. ",
  "dn12:23.5": "Idampissa hoti sīlasmiṁ. ",
  "dn12:23.6": "Abrahmacariyaṁ pahāya brahmacārī hoti ārācārī virato methunā gāmadhammā. ",
  "dn12:23.7": "Idampissa hoti sīlasmiṁ. ",
  "dn12:24.1": "Musāvādaṁ pahāya musāvādā paṭivirato hoti saccavādī saccasandho theto paccayiko avisaṁvādako lokassa. ",
  "dn12:24.2": "Idampissa hoti sīlasmiṁ. ",
  "dn12:24.3": "Pisuṇaṁ vācaṁ pahāya pisuṇāya vācāya paṭivirato hoti; ito sutvā na amutra akkhātā imesaṁ bhedāya; amutra vā sutvā na imesaṁ akkhātā, amūsaṁ bhedāya. Iti bhinnānaṁ vā sandhātā, sahitānaṁ vā anuppadātā, samaggārāmo samaggarato samagganandī samaggakaraṇiṁ vācaṁ bhāsitā hoti. ",
  "dn12:24.4": "Idampissa hoti sīlasmiṁ. ",
  "dn12:24.5": "Pharusaṁ vācaṁ pahāya pharusāya vācāya paṭivirato hoti; yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā tathārūpiṁ vācaṁ bhāsitā hoti. ",
  "dn12:24.6": "Idampissa hoti sīlasmiṁ. ",
  "dn12:24.7": "Samphappalāpaṁ pahāya samphappalāpā paṭivirato hoti kālavādī bhūtavādī atthavādī dhammavādī vinayavādī, nidhānavatiṁ vācaṁ bhāsitā hoti kālena sāpadesaṁ pariyantavatiṁ atthasaṁhitaṁ. ",
  "dn12:24.8": "Idampissa hoti sīlasmiṁ. ",
  "dn12:25.1": "Bījagāmabhūtagāmasamārambhā paṭivirato hoti …pe… ",
  "dn12:25.2": "ekabhattiko hoti rattūparato virato vikālabhojanā. ",
  "dn12:25.3": "Naccagītavāditavisūkadassanā paṭivirato hoti. ",
  "dn12:25.4": "Mālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānā paṭivirato hoti. ",
  "dn12:25.5": "Uccāsayanamahāsayanā paṭivirato hoti. ",
  "dn12:25.6": "Jātarūparajatapaṭiggahaṇā paṭivirato hoti. ",
  "dn12:25.7": "Āmakadhaññapaṭiggahaṇā paṭivirato hoti. ",
  "dn12:25.8": "Āmakamaṁsapaṭiggahaṇā paṭivirato hoti. ",
  "dn12:25.9": "Itthikumārikapaṭiggahaṇā paṭivirato hoti. ",
  "dn12:25.10": "Dāsidāsapaṭiggahaṇā paṭivirato hoti. ",
  "dn12:25.11": "Ajeḷakapaṭiggahaṇā paṭivirato hoti. ",
  "dn12:25.12": "Kukkuṭasūkarapaṭiggahaṇā paṭivirato hoti. ",
  "dn12:25.13": "Hatthigavassavaḷavapaṭiggahaṇā paṭivirato hoti. ",
  "dn12:25.14": "Khettavatthupaṭiggahaṇā paṭivirato hoti. ",
  "dn12:25.15": "Dūteyyapahiṇagamanānuyogā paṭivirato hoti. ",
  "dn12:25.16": "Kayavikkayā paṭivirato hoti. ",
  "dn12:25.17": "Tulākūṭakaṁsakūṭamānakūṭā paṭivirato hoti. ",
  "dn12:25.18": "Ukkoṭanavañcananikatisāciyogā paṭivirato hoti. ",
  "dn12:25.19": "Chedanavadhabandhanaviparāmosaālopasahasākārā paṭivirato hoti. ",
  "dn12:25.20": "Idampissa hoti sīlasmiṁ. ",
  "dn12:25.21": "Cūḷasīlaṁ niṭṭhitaṁ. ",
  "dn12:26.0": "3.1.2. Majjhimasīla ",
  "dn12:26.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ bījagāmabhūtagāmasamārambhaṁ anuyuttā viharanti. ",
  "dn12:26.2": "Seyyathidaṁ—mūlabījaṁ khandhabījaṁ phaḷubījaṁ aggabījaṁ bījabījameva pañcamaṁ, iti evarūpā bījagāmabhūtagāmasamārambhā paṭivirato hoti. ",
  "dn12:26.3": "Idampissa hoti sīlasmiṁ. ",
  "dn12:27.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ sannidhikāraparibhogaṁ anuyuttā viharanti. ",
  "dn12:27.2": "Seyyathidaṁ—annasannidhiṁ pānasannidhiṁ vatthasannidhiṁ yānasannidhiṁ sayanasannidhiṁ gandhasannidhiṁ āmisasannidhiṁ, ",
  "dn12:27.3": "iti vā iti evarūpā sannidhikāraparibhogā paṭivirato hoti. ",
  "dn12:27.4": "Idampissa hoti sīlasmiṁ. ",
  "dn12:28.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ visūkadassanaṁ anuyuttā viharanti. ",
  "dn12:28.2": "Seyyathidaṁ—naccaṁ gītaṁ vāditaṁ pekkhaṁ akkhānaṁ pāṇissaraṁ vetāḷaṁ kumbhathūṇaṁ sobhanakaṁ caṇḍālaṁ vaṁsaṁ dhovanaṁ hatthiyuddhaṁ assayuddhaṁ mahiṁsayuddhaṁ usabhayuddhaṁ ajayuddhaṁ meṇḍayuddhaṁ kukkuṭayuddhaṁ vaṭṭakayuddhaṁ daṇḍayuddhaṁ muṭṭhiyuddhaṁ nibbuddhaṁ uyyodhikaṁ balaggaṁ senābyūhaṁ anīkadassanaṁ ",
  "dn12:28.3": "iti vā iti evarūpā visūkadassanā paṭivirato hoti. ",
  "dn12:28.4": "Idampissa hoti sīlasmiṁ. ",
  "dn12:29.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ jūtappamādaṭṭhānānuyogaṁ anuyuttā viharanti. ",
  "dn12:29.2": "Seyyathidaṁ—aṭṭhapadaṁ dasapadaṁ ākāsaṁ parihārapathaṁ santikaṁ khalikaṁ ghaṭikaṁ salākahatthaṁ akkhaṁ paṅgacīraṁ vaṅkakaṁ mokkhacikaṁ ciṅgulikaṁ pattāḷhakaṁ rathakaṁ dhanukaṁ akkharikaṁ manesikaṁ yathāvajjaṁ ",
  "dn12:29.3": "iti vā iti evarūpā jūtappamādaṭṭhānānuyogā paṭivirato hoti. ",
  "dn12:29.4": "Idampissa hoti sīlasmiṁ. ",
  "dn12:30.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ uccāsayanamahāsayanaṁ anuyuttā viharanti. ",
  "dn12:30.2": "Seyyathidaṁ—āsandiṁ pallaṅkaṁ gonakaṁ cittakaṁ paṭikaṁ paṭalikaṁ tūlikaṁ vikatikaṁ uddalomiṁ ekantalomiṁ kaṭṭissaṁ koseyyaṁ kuttakaṁ hatthattharaṁ assattharaṁ rathattharaṁ ajinappaveṇiṁ kadalimigapavarapaccattharaṇaṁ sauttaracchadaṁ ubhatolohitakūpadhānaṁ ",
  "dn12:30.3": "iti vā iti evarūpā uccāsayanamahāsayanā paṭivirato hoti. ",
  "dn12:30.4": "Idampissa hoti sīlasmiṁ. ",
  "dn12:31.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ maṇḍanavibhūsanaṭṭhānānuyogaṁ anuyuttā viharanti. ",
  "dn12:31.2": "Seyyathidaṁ—ucchādanaṁ parimaddanaṁ nhāpanaṁ sambāhanaṁ ādāsaṁ añjanaṁ mālāgandhavilepanaṁ mukhacuṇṇaṁ mukhalepanaṁ hatthabandhaṁ sikhābandhaṁ daṇḍaṁ nāḷikaṁ asiṁ chattaṁ citrupāhanaṁ uṇhīsaṁ maṇiṁ vālabījaniṁ odātāni vatthāni dīghadasāni ",
  "dn12:31.3": "iti vā iti evarūpā maṇḍanavibhūsanaṭṭhānānuyogā paṭivirato hoti. ",
  "dn12:31.4": "Idampissa hoti sīlasmiṁ. ",
  "dn12:32.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ tiracchānakathaṁ anuyuttā viharanti. ",
  "dn12:32.2": "Seyyathidaṁ—rājakathaṁ corakathaṁ mahāmattakathaṁ senākathaṁ bhayakathaṁ yuddhakathaṁ annakathaṁ pānakathaṁ vatthakathaṁ sayanakathaṁ mālākathaṁ gandhakathaṁ ñātikathaṁ yānakathaṁ gāmakathaṁ nigamakathaṁ nagarakathaṁ janapadakathaṁ itthikathaṁ sūrakathaṁ visikhākathaṁ kumbhaṭṭhānakathaṁ pubbapetakathaṁ nānattakathaṁ lokakkhāyikaṁ samuddakkhāyikaṁ itibhavābhavakathaṁ ",
  "dn12:32.3": "iti vā iti evarūpāya tiracchānakathāya paṭivirato hoti. ",
  "dn12:32.4": "Idampissa hoti sīlasmiṁ. ",
  "dn12:33.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ viggāhikakathaṁ anuyuttā viharanti. ",
  "dn12:33.2": "Seyyathidaṁ—na tvaṁ imaṁ dhammavinayaṁ ājānāsi, ahaṁ imaṁ dhammavinayaṁ ājānāmi, kiṁ tvaṁ imaṁ dhammavinayaṁ ājānissasi, micchā paṭipanno tvamasi, ahamasmi sammā paṭipanno, sahitaṁ me, asahitaṁ te, pure vacanīyaṁ pacchā avaca, pacchā vacanīyaṁ pure avaca, adhiciṇṇaṁ te viparāvattaṁ, āropito te vādo, niggahito tvamasi, cara vādappamokkhāya, nibbeṭhehi vā sace pahosīti ",
  "dn12:33.3": "iti vā iti evarūpāya viggāhikakathāya paṭivirato hoti. ",
  "dn12:33.4": "Idampissa hoti sīlasmiṁ. ",
  "dn12:34.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ dūteyyapahiṇagamanānuyogaṁ anuyuttā viharanti. ",
  "dn12:34.2": "Seyyathidaṁ—raññaṁ, rājamahāmattānaṁ, khattiyānaṁ, brāhmaṇānaṁ, gahapatikānaṁ, kumārānaṁ—idha gaccha, amutrāgaccha, idaṁ hara, amutra idaṁ āharā’ti ",
  "dn12:34.3": "iti vā iti evarūpā dūteyyapahiṇagamanānuyogā paṭivirato hoti. ",
  "dn12:34.4": "Idampissa hoti sīlasmiṁ. ",
  "dn12:35.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te kuhakā ca honti lapakā ca nemittikā ca nippesikā ca lābhena lābhaṁ nijigīsitāro ca. Iti evarūpā kuhanalapanā paṭivirato hoti. ",
  "dn12:35.2": "Idampissa hoti sīlasmiṁ. ",
  "dn12:35.3": "Majjhimasīlaṁ niṭṭhitaṁ. ",
  "dn12:36.0": "3.1.3. Mahāsīla ",
  "dn12:36.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn12:36.2": "Seyyathidaṁ—aṅgaṁ nimittaṁ uppātaṁ supinaṁ lakkhaṇaṁ mūsikacchinnaṁ aggihomaṁ dabbihomaṁ thusahomaṁ kaṇahomaṁ taṇḍulahomaṁ sappihomaṁ telahomaṁ mukhahomaṁ lohitahomaṁ aṅgavijjā vatthuvijjā khattavijjā sivavijjā bhūtavijjā bhūrivijjā ahivijjā visavijjā vicchikavijjā mūsikavijjā sakuṇavijjā vāyasavijjā pakkajjhānaṁ saraparittāṇaṁ migacakkaṁ ",
  "dn12:36.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn12:36.4": "Idampissa hoti sīlasmiṁ. ",
  "dn12:37.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn12:37.2": "Seyyathidaṁ—maṇilakkhaṇaṁ vatthalakkhaṇaṁ daṇḍalakkhaṇaṁ satthalakkhaṇaṁ asilakkhaṇaṁ usulakkhaṇaṁ dhanulakkhaṇaṁ āvudhalakkhaṇaṁ itthilakkhaṇaṁ purisalakkhaṇaṁ kumāralakkhaṇaṁ kumārilakkhaṇaṁ dāsalakkhaṇaṁ dāsilakkhaṇaṁ hatthilakkhaṇaṁ assalakkhaṇaṁ mahiṁsalakkhaṇaṁ usabhalakkhaṇaṁ golakkhaṇaṁ ajalakkhaṇaṁ meṇḍalakkhaṇaṁ kukkuṭalakkhaṇaṁ vaṭṭakalakkhaṇaṁ godhālakkhaṇaṁ kaṇṇikalakkhaṇaṁ kacchapalakkhaṇaṁ migalakkhaṇaṁ ",
  "dn12:37.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn12:37.4": "Idampissa hoti sīlasmiṁ. ",
  "dn12:38.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn12:38.2": "Seyyathidaṁ—raññaṁ niyyānaṁ bhavissati, raññaṁ aniyyānaṁ bhavissati, abbhantarānaṁ raññaṁ upayānaṁ bhavissati, bāhirānaṁ raññaṁ apayānaṁ bhavissati, bāhirānaṁ raññaṁ upayānaṁ bhavissati, abbhantarānaṁ raññaṁ apayānaṁ bhavissati, abbhantarānaṁ raññaṁ jayo bhavissati, bāhirānaṁ raññaṁ parājayo bhavissati, bāhirānaṁ raññaṁ jayo bhavissati, abbhantarānaṁ raññaṁ parājayo bhavissati, iti imassa jayo bhavissati, imassa parājayo bhavissati ",
  "dn12:38.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn12:38.4": "Idampissa hoti sīlasmiṁ. ",
  "dn12:39.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn12:39.2": "Seyyathidaṁ—candaggāho bhavissati, sūriyaggāho bhavissati, nakkhattaggāho bhavissati, candimasūriyānaṁ pathagamanaṁ bhavissati, candimasūriyānaṁ uppathagamanaṁ bhavissati, nakkhattānaṁ pathagamanaṁ bhavissati, nakkhattānaṁ uppathagamanaṁ bhavissati, ukkāpāto bhavissati, disāḍāho bhavissati, bhūmicālo bhavissati, devadudrabhi bhavissati, candimasūriyanakkhattānaṁ uggamanaṁ ogamanaṁ saṅkilesaṁ vodānaṁ bhavissati, evaṁvipāko candaggāho bhavissati, evaṁvipāko sūriyaggāho bhavissati, evaṁvipāko nakkhattaggāho bhavissati, evaṁvipākaṁ candimasūriyānaṁ pathagamanaṁ bhavissati, evaṁvipākaṁ candimasūriyānaṁ uppathagamanaṁ bhavissati, evaṁvipākaṁ nakkhattānaṁ pathagamanaṁ bhavissati, evaṁvipākaṁ nakkhattānaṁ uppathagamanaṁ bhavissati, evaṁvipāko ukkāpāto bhavissati, evaṁvipāko disāḍāho bhavissati, evaṁvipāko bhūmicālo bhavissati, evaṁvipāko devadudrabhi bhavissati, evaṁvipākaṁ candimasūriyanakkhattānaṁ uggamanaṁ ogamanaṁ saṅkilesaṁ vodānaṁ bhavissati ",
  "dn12:39.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn12:39.4": "Idampissa hoti sīlasmiṁ. ",
  "dn12:40.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn12:40.2": "Seyyathidaṁ—suvuṭṭhikā bhavissati, dubbuṭṭhikā bhavissati, subhikkhaṁ bhavissati, dubbhikkhaṁ bhavissati, khemaṁ bhavissati, bhayaṁ bhavissati, rogo bhavissati, ārogyaṁ bhavissati, muddā, gaṇanā, saṅkhānaṁ, kāveyyaṁ, lokāyataṁ ",
  "dn12:40.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn12:40.4": "Idampissa hoti sīlasmiṁ. ",
  "dn12:41.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn12:41.2": "Seyyathidaṁ—āvāhanaṁ vivāhanaṁ saṁvaraṇaṁ vivaraṇaṁ saṅkiraṇaṁ vikiraṇaṁ subhagakaraṇaṁ dubbhagakaraṇaṁ viruddhagabbhakaraṇaṁ jivhānibandhanaṁ hanusaṁhananaṁ hatthābhijappanaṁ hanujappanaṁ kaṇṇajappanaṁ ādāsapañhaṁ kumārikapañhaṁ devapañhaṁ ādiccupaṭṭhānaṁ mahatupaṭṭhānaṁ abbhujjalanaṁ sirivhāyanaṁ ",
  "dn12:41.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn12:41.4": "Idampissa hoti sīlasmiṁ. ",
  "dn12:42.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn12:42.2": "Seyyathidaṁ—santikammaṁ paṇidhikammaṁ bhūtakammaṁ bhūrikammaṁ vassakammaṁ vossakammaṁ vatthukammaṁ vatthuparikammaṁ ācamanaṁ nhāpanaṁ juhanaṁ vamanaṁ virecanaṁ uddhaṁvirecanaṁ adhovirecanaṁ sīsavirecanaṁ kaṇṇatelaṁ nettatappanaṁ natthukammaṁ añjanaṁ paccañjanaṁ sālākiyaṁ sallakattiyaṁ dārakatikicchā, mūlabhesajjānaṁ anuppadānaṁ, osadhīnaṁ paṭimokkho ",
  "dn12:42.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn12:42.4": "Idampissa hoti sīlasmiṁ. ",
  "dn12:43.1": "Sa kho so, mahārāja, bhikkhu evaṁ sīlasampanno na kutoci bhayaṁ samanupassati, yadidaṁ sīlasaṁvarato. ",
  "dn12:43.2": "Seyyathāpi, mahārāja, rājā khattiyo muddhābhisitto nihatapaccāmitto na kutoci bhayaṁ samanupassati, yadidaṁ paccatthikato; ",
  "dn12:43.3": "evameva kho, mahārāja, bhikkhu evaṁ sīlasampanno na kutoci bhayaṁ samanupassati, yadidaṁ sīlasaṁvarato. ",
  "dn12:43.4": "So iminā ariyena sīlakkhandhena samannāgato ajjhattaṁ anavajjasukhaṁ paṭisaṁvedeti. ",
  "dn12:43.5": "Evaṁ kho, mahārāja, bhikkhu sīlasampanno hoti. ",
  "dn12:43.6": "Mahāsīlaṁ niṭṭhitaṁ. ",
  "dn12:44.0.1": "3.2. Samādhi ",
  "dn12:44.0.2": "3.2.1. Indriyasaṁvara ",
  "dn12:44.1": "Kathañca, mahārāja, bhikkhu indriyesu guttadvāro hoti? ",
  "dn12:44.2": "Idha, mahārāja, bhikkhu cakkhunā rūpaṁ disvā na nimittaggāhī hoti nānubyañjanaggāhī. ",
  "dn12:44.3": "Yatvādhikaraṇamenaṁ cakkhundriyaṁ asaṁvutaṁ viharantaṁ abhijjhā domanassā pāpakā akusalā dhammā anvāssaveyyuṁ, tassa saṁvarāya paṭipajjati, rakkhati cakkhundriyaṁ, cakkhundriye saṁvaraṁ āpajjati. ",
  "dn12:44.4": "Sotena saddaṁ sutvā …pe… ",
  "dn12:44.5": "ghānena gandhaṁ ghāyitvā …pe… ",
  "dn12:44.6": "jivhāya rasaṁ sāyitvā …pe… ",
  "dn12:44.7": "kāyena phoṭṭhabbaṁ phusitvā …pe… ",
  "dn12:44.8": "manasā dhammaṁ viññāya na nimittaggāhī hoti nānubyañjanaggāhī. ",
  "dn12:44.9": "Yatvādhikaraṇamenaṁ manindriyaṁ asaṁvutaṁ viharantaṁ abhijjhā domanassā pāpakā akusalā dhammā anvāssaveyyuṁ, tassa saṁvarāya paṭipajjati, rakkhati manindriyaṁ, manindriye saṁvaraṁ āpajjati. ",
  "dn12:44.10": "So iminā ariyena indriyasaṁvarena samannāgato ajjhattaṁ abyāsekasukhaṁ paṭisaṁvedeti. ",
  "dn12:44.11": "Evaṁ kho, mahārāja, bhikkhu indriyesu guttadvāro hoti. ",
  "dn12:45.0": "3.2.2. Satisampajañña ",
  "dn12:45.1": "Kathañca, mahārāja, bhikkhu satisampajaññena samannāgato hoti? ",
  "dn12:45.2": "Idha, mahārāja, bhikkhu abhikkante paṭikkante sampajānakārī hoti, ālokite vilokite sampajānakārī hoti, samiñjite pasārite sampajānakārī hoti, saṅghāṭipattacīvaradhāraṇe sampajānakārī hoti, asite pīte khāyite sāyite sampajānakārī hoti, uccārapassāvakamme sampajānakārī hoti, gate ṭhite nisinne sutte jāgarite bhāsite tuṇhībhāve sampajānakārī hoti. ",
  "dn12:45.3": "Evaṁ kho, mahārāja, bhikkhu satisampajaññena samannāgato hoti. ",
  "dn12:46.0": "3.2.3. Santosa ",
  "dn12:46.1": "Kathañca, mahārāja, bhikkhu santuṭṭho hoti? ",
  "dn12:46.2": "Idha, mahārāja, bhikkhu santuṭṭho hoti kāyaparihārikena cīvarena, kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati, samādāyeva pakkamati. ",
  "dn12:46.3": "Seyyathāpi, mahārāja, pakkhī sakuṇo yena yeneva ḍeti, sapattabhārova ḍeti; ",
  "dn12:46.4": "evameva kho, mahārāja, bhikkhu santuṭṭho hoti kāyaparihārikena cīvarena kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati, samādāyeva pakkamati. ",
  "dn12:46.5": "Evaṁ kho, mahārāja, bhikkhu santuṭṭho hoti. ",
  "dn12:47.0": "3.2.4. Nīvaraṇappahāna ",
  "dn12:47.1": "So iminā ca ariyena sīlakkhandhena samannāgato, iminā ca ariyena indriyasaṁvarena samannāgato, iminā ca ariyena satisampajaññena samannāgato, imāya ca ariyāya santuṭṭhiyā samannāgato, ",
  "dn12:47.2": "vivittaṁ senāsanaṁ bhajati araññaṁ rukkhamūlaṁ pabbataṁ kandaraṁ giriguhaṁ susānaṁ vanapatthaṁ abbhokāsaṁ palālapuñjaṁ. ",
  "dn12:47.3": "So pacchābhattaṁ piṇḍapātapaṭikkanto nisīdati pallaṅkaṁ ābhujitvā ujuṁ kāyaṁ paṇidhāya parimukhaṁ satiṁ upaṭṭhapetvā. ",
  "dn12:48.1": "So abhijjhaṁ loke pahāya vigatābhijjhena cetasā viharati, abhijjhāya cittaṁ parisodheti. ",
  "dn12:48.2": "Byāpādapadosaṁ pahāya abyāpannacitto viharati sabbapāṇabhūtahitānukampī, byāpādapadosā cittaṁ parisodheti. ",
  "dn12:48.3": "Thinamiddhaṁ pahāya vigatathinamiddho viharati ālokasaññī, sato sampajāno, thinamiddhā cittaṁ parisodheti. ",
  "dn12:48.4": "Uddhaccakukkuccaṁ pahāya anuddhato viharati, ajjhattaṁ vūpasantacitto, uddhaccakukkuccā cittaṁ parisodheti. ",
  "dn12:48.5": "Vicikicchaṁ pahāya tiṇṇavicikiccho viharati, akathaṅkathī kusalesu dhammesu, vicikicchāya cittaṁ parisodheti. ",
  "dn12:49.1": "Seyyathāpi, mahārāja, puriso iṇaṁ ādāya kammante payojeyya. ",
  "dn12:49.2": "Tassa te kammantā samijjheyyuṁ. ",
  "dn12:49.3": "So yāni ca porāṇāni iṇamūlāni, tāni ca byantiṁ kareyya, siyā cassa uttariṁ avasiṭṭhaṁ dārabharaṇāya. ",
  "dn12:49.4": "Tassa evamassa: ",
  "dn12:49.5": "‘ahaṁ kho pubbe iṇaṁ ādāya kammante payojesiṁ. ",
  "dn12:49.6": "Tassa me te kammantā samijjhiṁsu. ",
  "dn12:49.7": "Sohaṁ yāni ca porāṇāni iṇamūlāni, tāni ca byantiṁ akāsiṁ, atthi ca me uttariṁ avasiṭṭhaṁ dārabharaṇāyā’ti. ",
  "dn12:49.8": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn12:50.1": "Seyyathāpi, mahārāja, puriso ābādhiko assa dukkhito bāḷhagilāno; bhattañcassa nacchādeyya, na cassa kāye balamattā. ",
  "dn12:50.2": "So aparena samayena tamhā ābādhā mucceyya; bhattaṁ cassa chādeyya, siyā cassa kāye balamattā. ",
  "dn12:50.3": "Tassa evamassa: ",
  "dn12:50.4": "‘ahaṁ kho pubbe ābādhiko ahosiṁ dukkhito bāḷhagilāno; ",
  "dn12:50.5": "bhattañca me nacchādesi, na ca me āsi kāye balamattā. ",
  "dn12:50.6": "Somhi etarahi tamhā ābādhā mutto; ",
  "dn12:50.7": "bhattañca me chādeti, atthi ca me kāye balamattā’ti. ",
  "dn12:50.8": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn12:51.1": "Seyyathāpi, mahārāja, puriso bandhanāgāre baddho assa. ",
  "dn12:51.2": "So aparena samayena tamhā bandhanāgārā mucceyya sotthinā abbhayena, na cassa kiñci bhogānaṁ vayo. ",
  "dn12:51.3": "Tassa evamassa: ",
  "dn12:51.4": "‘ahaṁ kho pubbe bandhanāgāre baddho ahosiṁ, somhi etarahi tamhā bandhanāgārā mutto sotthinā abbhayena. ",
  "dn12:51.5": "Natthi ca me kiñci bhogānaṁ vayo’ti. ",
  "dn12:51.6": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn12:52.1": "Seyyathāpi, mahārāja, puriso dāso assa anattādhīno parādhīno na yenakāmaṅgamo. ",
  "dn12:52.2": "So aparena samayena tamhā dāsabyā mucceyya attādhīno aparādhīno bhujisso yenakāmaṅgamo. ",
  "dn12:52.3": "Tassa evamassa: ",
  "dn12:52.4": "‘ahaṁ kho pubbe dāso ahosiṁ anattādhīno parādhīno na yenakāmaṅgamo. ",
  "dn12:52.5": "Somhi etarahi tamhā dāsabyā mutto attādhīno aparādhīno bhujisso yenakāmaṅgamo’ti. ",
  "dn12:52.6": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn12:53.1": "Seyyathāpi, mahārāja, puriso sadhano sabhogo kantāraddhānamaggaṁ paṭipajjeyya dubbhikkhaṁ sappaṭibhayaṁ. ",
  "dn12:53.2": "So aparena samayena taṁ kantāraṁ nitthareyya sotthinā, gāmantaṁ anupāpuṇeyya khemaṁ appaṭibhayaṁ. ",
  "dn12:53.3": "Tassa evamassa: ",
  "dn12:53.4": "‘ahaṁ kho pubbe sadhano sabhogo kantāraddhānamaggaṁ paṭipajjiṁ dubbhikkhaṁ sappaṭibhayaṁ. ",
  "dn12:53.5": "Somhi etarahi taṁ kantāraṁ nitthiṇṇo sotthinā, gāmantaṁ anuppatto khemaṁ appaṭibhayan’ti. ",
  "dn12:53.6": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn12:54.1": "Evameva kho, mahārāja, bhikkhu yathā iṇaṁ yathā rogaṁ yathā bandhanāgāraṁ yathā dāsabyaṁ yathā kantāraddhānamaggaṁ, evaṁ ime pañca nīvaraṇe appahīne attani samanupassati. ",
  "dn12:54.2": "Seyyathāpi, mahārāja, yathā āṇaṇyaṁ yathā ārogyaṁ yathā bandhanāmokkhaṁ yathā bhujissaṁ yathā khemantabhūmiṁ; ",
  "dn12:54.3": "evameva kho, mahārāja, bhikkhu ime pañca nīvaraṇe pahīne attani samanupassati. ",
  "dn12:54.4": "Tassime pañca nīvaraṇe pahīne attani samanupassato pāmojjaṁ jāyati, pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṁ vedeti, sukhino cittaṁ samādhiyati. ",
  "dn12:55.0": "3.2.5. Paṭhamajhāna ",
  "dn12:55.1": "So vivicceva kāmehi, vivicca akusalehi dhammehi savitakkaṁ savicāraṁ vivekajaṁ pītisukhaṁ paṭhamaṁ jhānaṁ upasampajja viharati. ",
  "dn12:55.2": "So imameva kāyaṁ vivekajena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa vivekajena pītisukhena apphuṭaṁ hoti. ",
  "dn12:56.1": "Seyyathāpi, mahārāja, dakkho nhāpako vā nhāpakantevāsī vā kaṁsathāle nhānīyacuṇṇāni ākiritvā udakena paripphosakaṁ paripphosakaṁ sanneyya, sāyaṁ nhānīyapiṇḍi snehānugatā snehaparetā santarabāhirā phuṭā snehena, na ca paggharaṇī; ",
  "dn12:56.2": "evameva kho, mahārāja, bhikkhu imameva kāyaṁ vivekajena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa vivekajena pītisukhena apphuṭaṁ hoti. ",
  "dn12:56.3": "yasmiṁ kho, lohicca, satthari sāvako evarūpaṁ uḷāraṁ visesaṁ adhigacchati, ayampi kho, lohicca, satthā, yo loke nacodanāraho. ",
  "dn12:56.4": "Yo ca panevarūpaṁ satthāraṁ codeti, sā codanā abhūtā atacchā adhammikā sāvajjā. ",
  "dn12:56.5": "…pe… ",
  "dn12:57.0": "3.2.6. Dutiyajhāna ",
  "dn12:57.1": "Puna caparaṁ, mahārāja, bhikkhu vitakkavicārānaṁ vūpasamā ajjhattaṁ sampasādanaṁ cetaso ekodibhāvaṁ avitakkaṁ avicāraṁ samādhijaṁ pītisukhaṁ dutiyaṁ jhānaṁ upasampajja viharati. ",
  "dn12:57.2": "So imameva kāyaṁ samādhijena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa samādhijena pītisukhena apphuṭaṁ hoti. ",
  "dn12:58.1": "Seyyathāpi, mahārāja, udakarahado gambhīro ubbhidodako tassa nevassa puratthimāya disāya udakassa āyamukhaṁ, na dakkhiṇāya disāya udakassa āyamukhaṁ, na pacchimāya disāya udakassa āyamukhaṁ, na uttarāya disāya udakassa āyamukhaṁ, devo ca na kālena kālaṁ sammādhāraṁ anuppaveccheyya. ",
  "dn12:58.2": "Atha kho tamhāva udakarahadā sītā vāridhārā ubbhijjitvā tameva udakarahadaṁ sītena vārinā abhisandeyya parisandeyya paripūreyya paripphareyya, nāssa kiñci sabbāvato udakarahadassa sītena vārinā apphuṭaṁ assa. ",
  "dn12:58.3": "Evameva kho, mahārāja, bhikkhu imameva kāyaṁ samādhijena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa samādhijena pītisukhena apphuṭaṁ hoti. ",
  "dn12:58.4": "yasmiṁ kho, lohicca, satthari sāvako evarūpaṁ uḷāraṁ visesaṁ adhigacchati, ayampi kho, lohicca, satthā, yo loke nacodanāraho. ",
  "dn12:58.5": "Yo ca panevarūpaṁ satthāraṁ codeti, sā codanā abhūtā atacchā adhammikā sāvajjā. ",
  "dn12:59.0": "3.2.7. Tatiyajhāna ",
  "dn12:59.1": "Puna caparaṁ, mahārāja, bhikkhu pītiyā ca virāgā upekkhako ca viharati sato sampajāno, sukhañca kāyena paṭisaṁvedeti, yaṁ taṁ ariyā ācikkhanti: ‘upekkhako satimā sukhavihārī’ti, tatiyaṁ jhānaṁ upasampajja viharati. ",
  "dn12:59.2": "So imameva kāyaṁ nippītikena sukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa nippītikena sukhena apphuṭaṁ hoti. ",
  "dn12:60.1": "Seyyathāpi, mahārāja, uppaliniyaṁ vā paduminiyaṁ vā puṇḍarīkiniyaṁ vā appekaccāni uppalāni vā padumāni vā puṇḍarīkāni vā udake jātāni udake saṁvaḍḍhāni udakānuggatāni antonimuggaposīni, tāni yāva caggā yāva ca mūlā sītena vārinā abhisannāni parisannāni paripūrāni paripphuṭāni, nāssa kiñci sabbāvataṁ uppalānaṁ vā padumānaṁ vā puṇḍarīkānaṁ vā sītena vārinā apphuṭaṁ assa; ",
  "dn12:60.2": "evameva kho, mahārāja, bhikkhu imameva kāyaṁ nippītikena sukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa nippītikena sukhena apphuṭaṁ hoti. ",
  "dn12:60.3": "yasmiṁ kho, lohicca, satthari sāvako evarūpaṁ uḷāraṁ visesaṁ adhigacchati, ayampi kho, lohicca, satthā, yo loke nacodanāraho. ",
  "dn12:60.4": "Yo ca panevarūpaṁ satthāraṁ codeti, sā codanā abhūtā atacchā adhammikā sāvajjā. ",
  "dn12:61.0": "3.2.8. Catutthajhāna ",
  "dn12:61.1": "Puna caparaṁ, mahārāja, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā, pubbeva somanassadomanassānaṁ atthaṅgamā adukkhamasukhaṁ upekkhāsatipārisuddhiṁ catutthaṁ jhānaṁ upasampajja viharati. ",
  "dn12:61.2": "So imameva kāyaṁ parisuddhena cetasā pariyodātena pharitvā nisinno hoti, nāssa kiñci sabbāvato kāyassa parisuddhena cetasā pariyodātena apphuṭaṁ hoti. ",
  "dn12:62.1": "Seyyathāpi, mahārāja, puriso odātena vatthena sasīsaṁ pārupitvā nisinno assa, nāssa kiñci sabbāvato kāyassa odātena vatthena apphuṭaṁ assa; ",
  "dn12:62.2": "evameva kho, mahārāja, bhikkhu imameva kāyaṁ parisuddhena cetasā pariyodātena pharitvā nisinno hoti, nāssa kiñci sabbāvato kāyassa parisuddhena cetasā pariyodātena apphuṭaṁ hoti. ",
  "dn12:62.3": "yasmiṁ kho, lohicca, satthari sāvako evarūpaṁ uḷāraṁ visesaṁ adhigacchati, ayampi kho, lohicca, satthā, yo loke nacodanāraho. ",
  "dn12:62.4": "Yo ca panevarūpaṁ satthāraṁ codeti, sā codanā abhūtā atacchā adhammikā sāvajjā. ",
  "dn12:62.5": "…pe… ",
  "dn12:63.0.1": "3.3. Aṭṭhañāṇa ",
  "dn12:63.0.2": "3.3.1. Vipassanāñāṇa ",
  "dn12:63.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte ñāṇadassanāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn12:63.2": "So evaṁ pajānāti: ",
  "dn12:63.3": "‘ayaṁ kho me kāyo rūpī cātumahābhūtiko mātāpettikasambhavo odanakummāsūpacayo aniccucchādanaparimaddanabhedanaviddhaṁsanadhammo; ",
  "dn12:63.4": "idañca pana me viññāṇaṁ ettha sitaṁ ettha paṭibaddhan’ti. ",
  "dn12:64.1": "Seyyathāpi, mahārāja, maṇi veḷuriyo subho jātimā aṭṭhaṁso suparikammakato accho vippasanno anāvilo sabbākārasampanno. ",
  "dn12:64.2": "Tatrāssa suttaṁ āvutaṁ nīlaṁ vā pītaṁ vā lohitaṁ vā odātaṁ vā paṇḍusuttaṁ vā. ",
  "dn12:64.3": "Tamenaṁ cakkhumā puriso hatthe karitvā paccavekkheyya: ",
  "dn12:64.4": "‘ayaṁ kho maṇi veḷuriyo subho jātimā aṭṭhaṁso suparikammakato accho vippasanno anāvilo sabbākārasampanno; ",
  "dn12:64.5": "tatridaṁ suttaṁ āvutaṁ nīlaṁ vā pītaṁ vā lohitaṁ vā odātaṁ vā paṇḍusuttaṁ vā’ti. ",
  "dn12:64.6": "Evameva kho, mahārāja, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte ñāṇadassanāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn12:64.7": "So evaṁ pajānāti: ",
  "dn12:64.8": "‘ayaṁ kho me kāyo rūpī cātumahābhūtiko mātāpettikasambhavo odanakummāsūpacayo aniccucchādanaparimaddanabhedanaviddhaṁsanadhammo; ",
  "dn12:64.9": "idañca pana me viññāṇaṁ ettha sitaṁ ettha paṭibaddhan’ti. ",
  "dn12:64.10": "yasmiṁ kho, lohicca, satthari sāvako evarūpaṁ uḷāraṁ visesaṁ adhigacchati, ayampi kho, lohicca, satthā, yo loke nacodanāraho. ",
  "dn12:64.11": "Yo ca panevarūpaṁ satthāraṁ codeti, sā codanā abhūtā atacchā adhammikā sāvajjā. ",
  "dn12:65.0": "3.3.2. Manomayiddhiñāṇa ",
  "dn12:65.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte manomayaṁ kāyaṁ abhinimmānāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn12:65.2": "So imamhā kāyā aññaṁ kāyaṁ abhinimmināti rūpiṁ manomayaṁ sabbaṅgapaccaṅgiṁ ahīnindriyaṁ. ",
  "dn12:66.1": "Seyyathāpi, mahārāja, puriso muñjamhā īsikaṁ pavāheyya. ",
  "dn12:66.2": "Tassa evamassa: ",
  "dn12:66.3": "‘ayaṁ muñjo, ayaṁ īsikā, añño muñjo, aññā īsikā, muñjamhā tveva īsikā pavāḷhā’ti. ",
  "dn12:66.4": "Seyyathā vā pana, mahārāja, puriso asiṁ kosiyā pavāheyya. ",
  "dn12:66.5": "Tassa evamassa: ",
  "dn12:66.6": "‘ayaṁ asi, ayaṁ kosi, añño asi, aññā kosi, kosiyā tveva asi pavāḷho’ti. ",
  "dn12:66.7": "Seyyathā vā pana, mahārāja, puriso ahiṁ karaṇḍā uddhareyya. ",
  "dn12:66.8": "Tassa evamassa: ",
  "dn12:66.9": "‘ayaṁ ahi, ayaṁ karaṇḍo. Añño ahi, añño karaṇḍo, karaṇḍā tveva ahi ubbhato’ti. ",
  "dn12:66.10": "Evameva kho, mahārāja, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte manomayaṁ kāyaṁ abhinimmānāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn12:66.11": "So imamhā kāyā aññaṁ kāyaṁ abhinimmināti rūpiṁ manomayaṁ sabbaṅgapaccaṅgiṁ ahīnindriyaṁ. ",
  "dn12:66.12": "yasmiṁ kho, lohicca, satthari sāvako evarūpaṁ uḷāraṁ visesaṁ adhigacchati, ayampi kho, lohicca, satthā, yo loke nacodanāraho. ",
  "dn12:66.13": "Yo ca panevarūpaṁ satthāraṁ codeti, sā codanā abhūtā atacchā adhammikā sāvajjā. ",
  "dn12:67.0": "3.3.3. Iddhividhañāṇa ",
  "dn12:67.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte iddhividhāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn12:67.2": "So anekavihitaṁ iddhividhaṁ paccanubhoti—ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti; āvibhāvaṁ tirobhāvaṁ tirokuṭṭaṁ tiropākāraṁ tiropabbataṁ asajjamāno gacchati seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṁ karoti seyyathāpi udake; udakepi abhijjamāne gacchati seyyathāpi pathaviyā; ākāsepi pallaṅkena kamati seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṁmahiddhike evaṁmahānubhāve pāṇinā parāmasati parimajjati; yāva brahmalokāpi kāyena vasaṁ vatteti. ",
  "dn12:68.1": "Seyyathāpi, mahārāja, dakkho kumbhakāro vā kumbhakārantevāsī vā suparikammakatāya mattikāya yaṁ yadeva bhājanavikatiṁ ākaṅkheyya, taṁ tadeva kareyya abhinipphādeyya. ",
  "dn12:68.2": "Seyyathā vā pana, mahārāja, dakkho dantakāro vā dantakārantevāsī vā suparikammakatasmiṁ dantasmiṁ yaṁ yadeva dantavikatiṁ ākaṅkheyya, taṁ tadeva kareyya abhinipphādeyya. ",
  "dn12:68.3": "Seyyathā vā pana, mahārāja, dakkho suvaṇṇakāro vā suvaṇṇakārantevāsī vā suparikammakatasmiṁ suvaṇṇasmiṁ yaṁ yadeva suvaṇṇavikatiṁ ākaṅkheyya, taṁ tadeva kareyya abhinipphādeyya. ",
  "dn12:68.4": "Evameva kho, mahārāja, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte iddhividhāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn12:68.5": "So anekavihitaṁ iddhividhaṁ paccanubhoti—ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti; āvibhāvaṁ tirobhāvaṁ tirokuṭṭaṁ tiropākāraṁ tiropabbataṁ asajjamāno gacchati seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṁ karoti seyyathāpi udake; udakepi abhijjamāne gacchati seyyathāpi pathaviyā; ākāsepi pallaṅkena kamati seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṁmahiddhike evaṁmahānubhāve pāṇinā parāmasati parimajjati; yāva brahmalokāpi kāyena vasaṁ vatteti. ",
  "dn12:68.6": "yasmiṁ kho, lohicca, satthari sāvako evarūpaṁ uḷāraṁ visesaṁ adhigacchati, ayampi kho, lohicca, satthā, yo loke nacodanāraho. ",
  "dn12:68.7": "Yo ca panevarūpaṁ satthāraṁ codeti, sā codanā abhūtā atacchā adhammikā sāvajjā. ",
  "dn12:69.0": "3.3.4. Dibbasotañāṇa ",
  "dn12:69.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte dibbāya sotadhātuyā cittaṁ abhinīharati abhininnāmeti. ",
  "dn12:69.2": "So dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇāti dibbe ca mānuse ca ye dūre santike ca. ",
  "dn12:70.1": "Seyyathāpi, mahārāja, puriso addhānamaggappaṭipanno. So suṇeyya bherisaddampi mudiṅgasaddampi saṅkhapaṇavadindimasaddampi. Tassa evamassa: ‘bherisaddo’ itipi, ‘mudiṅgasaddo’ itipi, ‘saṅkhapaṇavadindimasaddo’ itipi. ",
  "dn12:70.2": "Evameva kho, mahārāja, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte dibbāya sotadhātuyā cittaṁ abhinīharati abhininnāmeti. ",
  "dn12:70.3": "So dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇāti dibbe ca mānuse ca ye dūre santike ca. ",
  "dn12:70.4": "yasmiṁ kho, lohicca, satthari sāvako evarūpaṁ uḷāraṁ visesaṁ adhigacchati, ayampi kho, lohicca, satthā, yo loke nacodanāraho. ",
  "dn12:70.5": "Yo ca panevarūpaṁ satthāraṁ codeti, sā codanā abhūtā atacchā adhammikā sāvajjā. ",
  "dn12:71.0": "3.3.5. Cetopariyañāṇa ",
  "dn12:71.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte cetopariyañāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn12:71.2": "So parasattānaṁ parapuggalānaṁ cetasā ceto paricca pajānāti—",
  "dn12:71.3": "sarāgaṁ vā cittaṁ ‘sarāgaṁ cittan’ti pajānāti, ",
  "dn12:71.4": "vītarāgaṁ vā cittaṁ ‘vītarāgaṁ cittan’ti pajānāti, ",
  "dn12:71.5": "sadosaṁ vā cittaṁ ‘sadosaṁ cittan’ti pajānāti, ",
  "dn12:71.6": "vītadosaṁ vā cittaṁ ‘vītadosaṁ cittan’ti pajānāti, ",
  "dn12:71.7": "samohaṁ vā cittaṁ ‘samohaṁ cittan’ti pajānāti, ",
  "dn12:71.8": "vītamohaṁ vā cittaṁ ‘vītamohaṁ cittan’ti pajānāti, ",
  "dn12:71.9": "saṅkhittaṁ vā cittaṁ ‘saṅkhittaṁ cittan’ti pajānāti, ",
  "dn12:71.10": "vikkhittaṁ vā cittaṁ ‘vikkhittaṁ cittan’ti pajānāti, ",
  "dn12:71.11": "mahaggataṁ vā cittaṁ ‘mahaggataṁ cittan’ti pajānāti, ",
  "dn12:71.12": "amahaggataṁ vā cittaṁ ‘amahaggataṁ cittan’ti pajānāti, ",
  "dn12:71.13": "sauttaraṁ vā cittaṁ ‘sauttaraṁ cittan’ti pajānāti, ",
  "dn12:71.14": "anuttaraṁ vā cittaṁ ‘anuttaraṁ cittan’ti pajānāti, ",
  "dn12:71.15": "samāhitaṁ vā cittaṁ ‘samāhitaṁ cittan’ti pajānāti, ",
  "dn12:71.16": "asamāhitaṁ vā cittaṁ ‘asamāhitaṁ cittan’ti pajānāti, ",
  "dn12:71.17": "vimuttaṁ vā cittaṁ ‘vimuttaṁ cittan’ti pajānāti, ",
  "dn12:71.18": "avimuttaṁ vā cittaṁ ‘avimuttaṁ cittan’ti pajānāti. ",
  "dn12:72.1": "Seyyathāpi, mahārāja, itthī vā puriso vā daharo yuvā maṇḍanajātiko ādāse vā parisuddhe pariyodāte acche vā udakapatte sakaṁ mukhanimittaṁ paccavekkhamāno sakaṇikaṁ vā ‘sakaṇikan’ti jāneyya, akaṇikaṁ vā ‘akaṇikan’ti jāneyya; ",
  "dn12:72.2": "evameva kho, mahārāja, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte cetopariyañāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn12:72.3": "So parasattānaṁ parapuggalānaṁ cetasā ceto paricca pajānāti—",
  "dn12:72.20": "yasmiṁ kho, lohicca, satthari sāvako evarūpaṁ uḷāraṁ visesaṁ adhigacchati, ayampi kho, lohicca, satthā, yo loke nacodanāraho. ",
  "dn12:72.21": "Yo ca panevarūpaṁ satthāraṁ codeti, sā codanā abhūtā atacchā adhammikā sāvajjā. ",
  "dn12:73.0": "3.3.6. Pubbenivāsānussatiñāṇa ",
  "dn12:73.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn12:73.2": "So anekavihitaṁ pubbenivāsaṁ anussarati, seyyathidaṁ—ekampi jātiṁ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṁsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṁvaṭṭakappe anekepi vivaṭṭakappe anekepi saṁvaṭṭavivaṭṭakappe, ‘amutrāsiṁ evaṁnāmo evaṅgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhappaṭisaṁvedī evamāyupariyanto, so tato cuto amutra udapādiṁ; tatrāpāsiṁ evaṁnāmo evaṅgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhappaṭisaṁvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṁ sauddesaṁ anekavihitaṁ pubbenivāsaṁ anussarati. ",
  "dn12:74.1": "Seyyathāpi, mahārāja, puriso sakamhā gāmā aññaṁ gāmaṁ gaccheyya, tamhāpi gāmā aññaṁ gāmaṁ gaccheyya. So tamhā gāmā sakaṁyeva gāmaṁ paccāgaccheyya. Tassa evamassa: ‘ahaṁ kho sakamhā gāmā amuṁ gāmaṁ agacchiṁ, tatra evaṁ aṭṭhāsiṁ, evaṁ nisīdiṁ, evaṁ abhāsiṁ, evaṁ tuṇhī ahosiṁ, tamhāpi gāmā amuṁ gāmaṁ agacchiṁ, tatrāpi evaṁ aṭṭhāsiṁ, evaṁ nisīdiṁ, evaṁ abhāsiṁ, evaṁ tuṇhī ahosiṁ, somhi tamhā gāmā sakaṁyeva gāmaṁ paccāgato’ti. ",
  "dn12:74.2": "Evameva kho, mahārāja, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn12:74.3": "So anekavihitaṁ pubbenivāsaṁ anussarati, seyyathidaṁ—ekampi jātiṁ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṁsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṁvaṭṭakappe anekepi vivaṭṭakappe anekepi saṁvaṭṭavivaṭṭakappe, ‘amutrāsiṁ evaṁnāmo evaṅgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhappaṭisaṁvedī evamāyupariyanto, so tato cuto amutra udapādiṁ; tatrāpāsiṁ evaṁnāmo evaṅgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhappaṭisaṁvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṁ sauddesaṁ anekavihitaṁ pubbenivāsaṁ anussarati. ",
  "dn12:74.4": "yasmiṁ kho, lohicca, satthari sāvako evarūpaṁ uḷāraṁ visesaṁ adhigacchati, ayampi kho, lohicca, satthā, yo loke nacodanāraho. ",
  "dn12:74.5": "Yo ca panevarūpaṁ satthāraṁ codeti, sā codanā abhūtā atacchā adhammikā sāvajjā. ",
  "dn12:75.0": "3.3.7. Dibbacakkhuñāṇa ",
  "dn12:75.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte sattānaṁ cutūpapātañāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn12:75.2": "So dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate, yathākammūpage satte pajānāti: ‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṁ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā. Te kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapannā. Ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṁ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate, yathākammūpage satte pajānāti. ",
  "dn12:76.1": "Seyyathāpi, mahārāja, majjhe siṅghāṭake pāsādo. Tattha cakkhumā puriso ṭhito passeyya manusse gehaṁ pavisantepi nikkhamantepi rathikāyapi vīthiṁ sañcarante majjhe siṅghāṭake nisinnepi. Tassa evamassa: ‘ete manussā gehaṁ pavisanti, ete nikkhamanti, ete rathikāya vīthiṁ sañcaranti, ete majjhe siṅghāṭake nisinnā’ti. ",
  "dn12:76.2": "Evameva kho, mahārāja, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte sattānaṁ cutūpapātañāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn12:76.3": "So dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate, yathākammūpage satte pajānāti: ‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṁ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā, te kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapannā. Ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṁ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā. Te kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate; yathākammūpage satte pajānāti. ",
  "dn12:76.4": "yasmiṁ kho, lohicca, satthari sāvako evarūpaṁ uḷāraṁ visesaṁ adhigacchati, ayampi kho, lohicca, satthā, yo loke nacodanāraho. ",
  "dn12:76.5": "Yo ca panevarūpaṁ satthāraṁ codeti, sā codanā abhūtā atacchā adhammikā sāvajjā. ",
  "dn12:76.6": "…pe… ",
  "dn12:77.0": "3.3.8. Āsavakkhayañāṇa ",
  "dn12:77.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṁ khayañāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn12:77.2": "So idaṁ dukkhanti yathābhūtaṁ pajānāti, ayaṁ dukkhasamudayoti yathābhūtaṁ pajānāti, ayaṁ dukkhanirodhoti yathābhūtaṁ pajānāti, ayaṁ dukkhanirodhagāminī paṭipadāti yathābhūtaṁ pajānāti. ",
  "dn12:77.3": "Ime āsavāti yathābhūtaṁ pajānāti, ayaṁ āsavasamudayoti yathābhūtaṁ pajānāti, ayaṁ āsavanirodhoti yathābhūtaṁ pajānāti, ayaṁ āsavanirodhagāminī paṭipadāti yathābhūtaṁ pajānāti. ",
  "dn12:77.4": "Tassa evaṁ jānato evaṁ passato kāmāsavāpi cittaṁ vimuccati, bhavāsavāpi cittaṁ vimuccati, avijjāsavāpi cittaṁ vimuccati, ",
  "dn12:77.5": "vimuttasmiṁ ‘vimuttam’iti ñāṇaṁ hoti, ",
  "dn12:77.6": "‘khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānāti. ",
  "dn12:77.7": "Seyyathāpi, mahārāja, pabbatasaṅkhepe udakarahado accho vippasanno anāvilo. Tattha cakkhumā puriso tīre ṭhito passeyya sippisambukampi sakkharakathalampi macchagumbampi carantampi tiṭṭhantampi. Tassa evamassa: ‘ayaṁ kho udakarahado accho vippasanno anāvilo. Tatrime sippisambukāpi sakkharakathalāpi macchagumbāpi carantipi tiṭṭhantipī’ti. ",
  "dn12:77.8": "Evameva kho, mahārāja, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṁ khayañāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn12:77.9": "Yasmiṁ kho, lohicca, satthari sāvako evarūpaṁ uḷāraṁ visesaṁ adhigacchati, ayampi kho, lohicca, satthā, yo loke nacodanāraho, yo ca panevarūpaṁ satthāraṁ codeti, sā codanā abhūtā atacchā adhammikā sāvajjā”ti. ",
  "dn12:78.1": "Evaṁ vutte, lohicco brāhmaṇo bhagavantaṁ etadavoca: ",
  "dn12:78.2": "“seyyathāpi, bho gotama, puriso purisaṁ narakapapātaṁ patantaṁ kesesu gahetvā uddharitvā thale patiṭṭhapeyya; ",
  "dn12:78.3": "evamevāhaṁ bhotā gotamena narakapapātaṁ papatanto uddharitvā thale patiṭṭhāpito. ",
  "dn12:78.4": "Abhikkantaṁ, bho gotama, abhikkantaṁ, bho gotama. ",
  "dn12:78.5": "Seyyathāpi, bho gotama, nikkujjitaṁ vā ukkujjeyya, paṭicchannaṁ vā vivareyya, mūḷhassa vā maggaṁ ācikkheyya, andhakāre vā telapajjotaṁ dhāreyya: ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṁ bhotā gotamena anekapariyāyena dhammo pakāsito. ",
  "dn12:78.6": "Esāhaṁ bhavantaṁ gotamaṁ saraṇaṁ gacchāmi dhammañca bhikkhusaṅghañca. ",
  "dn12:78.7": "Upāsakaṁ maṁ bhavaṁ gotamo dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gatan”ti. ",
  "dn12:78.8": "Lohiccasuttaṁ niṭṭhitaṁ dvādasamaṁ. "
}