{
  "dn13:0.1": "Dīgha Nikāya 13 ",
  "dn13:0.2": "Tevijjasutta ",
  "dn13:1.1": "Evaṁ me sutaṁ—",
  "dn13:1.2": "ekaṁ samayaṁ bhagavā kosalesu cārikaṁ caramāno mahatā bhikkhusaṅghena saddhiṁ pañcamattehi bhikkhusatehi yena manasākaṭaṁ nāma kosalānaṁ brāhmaṇagāmo tadavasari. ",
  "dn13:1.3": "Tatra sudaṁ bhagavā manasākaṭe viharati uttarena manasākaṭassa aciravatiyā nadiyā tīre ambavane. ",
  "dn13:2.1": "Tena kho pana samayena sambahulā abhiññātā abhiññātā brāhmaṇamahāsālā manasākaṭe paṭivasanti, seyyathidaṁ—",
  "dn13:2.2": "caṅkī brāhmaṇo tārukkho brāhmaṇo pokkharasāti brāhmaṇo jāṇusoṇi brāhmaṇo todeyyo brāhmaṇo aññe ca abhiññātā abhiññātā brāhmaṇamahāsālā. ",
  "dn13:3.1": "Atha kho vāseṭṭhabhāradvājānaṁ māṇavānaṁ jaṅghavihāraṁ anucaṅkamantānaṁ anuvicarantānaṁ maggāmagge kathā udapādi. ",
  "dn13:4.1": "Atha kho vāseṭṭho māṇavo evamāha: ",
  "dn13:4.2": "“ayameva ujumaggo, ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāya, yvāyaṁ akkhāto brāhmaṇena pokkharasātinā”ti. ",
  "dn13:5.1": "Bhāradvājopi māṇavo evamāha: ",
  "dn13:5.2": "“ayameva ujumaggo, ayamañjasāyano niyyāniko, niyyāti takkarassa brahmasahabyatāya, yvāyaṁ akkhāto brāhmaṇena tārukkhenā”ti. ",
  "dn13:6.1": "Neva kho asakkhi vāseṭṭho māṇavo bhāradvājaṁ māṇavaṁ saññāpetuṁ, na pana asakkhi bhāradvājo māṇavo vāseṭṭhaṁ māṇavaṁ saññāpetuṁ. ",
  "dn13:7.1": "Atha kho vāseṭṭho māṇavo bhāradvājaṁ māṇavaṁ āmantesi: ",
  "dn13:7.2": "“ayaṁ kho, bhāradvāja, samaṇo gotamo sakyaputto sakyakulā pabbajito manasākaṭe viharati uttarena manasākaṭassa aciravatiyā nadiyā tīre ambavane. ",
  "dn13:7.3": "Taṁ kho pana bhavantaṁ gotamaṁ evaṁ kalyāṇo kittisaddo abbhuggato: ",
  "dn13:7.4": "‘itipi so bhagavā arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā’ti. ",
  "dn13:7.5": "Āyāma, bho bhāradvāja, yena samaṇo gotamo tenupasaṅkamissāma; upasaṅkamitvā etamatthaṁ samaṇaṁ gotamaṁ pucchissāma. ",
  "dn13:7.6": "Yathā no samaṇo gotamo byākarissati, tathā naṁ dhāressāmā”ti. ",
  "dn13:7.7": "“Evaṁ, bho”ti kho bhāradvājo māṇavo vāseṭṭhassa māṇavassa paccassosi. ",
  "dn13:8.0": "1. Maggāmaggakathā ",
  "dn13:8.1": "Atha kho vāseṭṭhabhāradvājā māṇavā yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavatā saddhiṁ sammodiṁsu. ",
  "dn13:8.2": "Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdiṁsu. Ekamantaṁ nisinno kho vāseṭṭho māṇavo bhagavantaṁ etadavoca: ",
  "dn13:8.3": "“idha, bho gotama, amhākaṁ jaṅghavihāraṁ anucaṅkamantānaṁ anuvicarantānaṁ maggāmagge kathā udapādi. ",
  "dn13:8.4": "Ahaṁ evaṁ vadāmi: ",
  "dn13:8.5": "‘ayameva ujumaggo, ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāya, yvāyaṁ akkhāto brāhmaṇena pokkharasātinā’ti. ",
  "dn13:8.6": "Bhāradvājo māṇavo evamāha: ",
  "dn13:8.7": "‘ayameva ujumaggo ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāya, yvāyaṁ akkhāto brāhmaṇena tārukkhenā’ti. ",
  "dn13:8.8": "Ettha, bho gotama, attheva viggaho, atthi vivādo, atthi nānāvādo”ti. ",
  "dn13:9.1": "“Iti kira, vāseṭṭha, tvaṁ evaṁ vadesi: ",
  "dn13:9.2": "‘ayameva ujumaggo, ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāya, yvāyaṁ akkhāto brāhmaṇena pokkharasātinā’ti. ",
  "dn13:9.3": "Bhāradvājo māṇavo evamāha: ",
  "dn13:9.4": "‘ayameva ujumaggo ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāya, yvāyaṁ akkhāto brāhmaṇena tārukkhenā’ti. ",
  "dn13:9.5": "Atha kismiṁ pana vo, vāseṭṭha, viggaho, kismiṁ vivādo, kismiṁ nānāvādo”ti? ",
  "dn13:10.1": "“Maggāmagge, bho gotama. ",
  "dn13:10.2": "Kiñcāpi, bho gotama, brāhmaṇā nānāmagge paññāpenti, addhariyā brāhmaṇā tittiriyā brāhmaṇā chandokā brāhmaṇā bavhārijjhā brāhmaṇā, atha kho sabbāni tāni niyyānikā niyyanti takkarassa brahmasahabyatāya. ",
  "dn13:10.3": "Seyyathāpi, bho gotama, gāmassa vā nigamassa vā avidūre bahūni cepi nānāmaggāni bhavanti, atha kho sabbāni tāni gāmasamosaraṇāni bhavanti; ",
  "dn13:10.4": "evameva kho, bho gotama, kiñcāpi brāhmaṇā nānāmagge paññāpenti, addhariyā brāhmaṇā tittiriyā brāhmaṇā chandokā brāhmaṇā bavhārijjhā brāhmaṇā, atha kho sabbāni tāni niyyānikā niyyanti takkarassa brahmasahabyatāyā”ti. ",
  "dn13:11.0": "2. Vāseṭṭhamāṇavānuyoga ",
  "dn13:11.1": "“Niyyantīti, vāseṭṭha vadesi”? ",
  "dn13:11.2": "“Niyyantīti, bho gotama, vadāmi”. ",
  "dn13:11.3": "“Niyyantīti, vāseṭṭha, vadesi”? ",
  "dn13:11.4": "“Niyyantīti, bho gotama, vadāmi”. ",
  "dn13:11.5": "“Niyyantīti, vāseṭṭha, vadesi”? ",
  "dn13:11.6": "“Niyyantīti, bho gotama, vadāmi”. ",
  "dn13:12.1": "“Kiṁ pana, vāseṭṭha, atthi koci tevijjānaṁ brāhmaṇānaṁ ekabrāhmaṇopi, yena brahmā sakkhidiṭṭho”ti? ",
  "dn13:12.2": "“No hidaṁ, bho gotama”. ",
  "dn13:12.3": "“Kiṁ pana, vāseṭṭha, atthi koci tevijjānaṁ brāhmaṇānaṁ ekācariyopi, yena brahmā sakkhidiṭṭho”ti? ",
  "dn13:12.4": "“No hidaṁ, bho gotama”. ",
  "dn13:12.5": "“Kiṁ pana, vāseṭṭha, atthi koci tevijjānaṁ brāhmaṇānaṁ ekācariyapācariyopi, yena brahmā sakkhidiṭṭho”ti? ",
  "dn13:12.6": "“No hidaṁ, bho gotama”. ",
  "dn13:12.7": "“Kiṁ pana, vāseṭṭha, atthi koci tevijjānaṁ brāhmaṇānaṁ yāva sattamā ācariyāmahayugā yena brahmā sakkhidiṭṭho”ti? ",
  "dn13:12.8": "“No hidaṁ, bho gotama”. ",
  "dn13:13.1": "“Kiṁ pana, vāseṭṭha, yepi tevijjānaṁ brāhmaṇānaṁ pubbakā isayo mantānaṁ kattāro mantānaṁ pavattāro, yesamidaṁ etarahi tevijjā brāhmaṇā porāṇaṁ mantapadaṁ gītaṁ pavuttaṁ samihitaṁ, tadanugāyanti, tadanubhāsanti, bhāsitamanubhāsanti, vācitamanuvācenti, seyyathidaṁ—aṭṭhako vāmako vāmadevo vessāmitto yamataggi aṅgīraso bhāradvājo vāseṭṭho kassapo bhagu. ",
  "dn13:13.2": "Tepi evamāhaṁsu: ",
  "dn13:13.3": "‘mayametaṁ jānāma, mayametaṁ passāma, yattha vā brahmā, yena vā brahmā, yahiṁ vā brahmā’”ti? ",
  "dn13:13.4": "“No hidaṁ, bho gotama”. ",
  "dn13:14.1": "“Iti kira, vāseṭṭha, natthi koci tevijjānaṁ brāhmaṇānaṁ ekabrāhmaṇopi, yena brahmā sakkhidiṭṭho. ",
  "dn13:14.2": "Natthi koci tevijjānaṁ brāhmaṇānaṁ ekācariyopi, yena brahmā sakkhidiṭṭho. ",
  "dn13:14.3": "Natthi koci tevijjānaṁ brāhmaṇānaṁ ekācariyapācariyopi, yena brahmā sakkhidiṭṭho. ",
  "dn13:14.4": "Natthi koci tevijjānaṁ brāhmaṇānaṁ yāva sattamā ācariyāmahayugā yena brahmā sakkhidiṭṭho. ",
  "dn13:14.5": "Yepi kira tevijjānaṁ brāhmaṇānaṁ pubbakā isayo mantānaṁ kattāro mantānaṁ pavattāro, yesamidaṁ etarahi tevijjā brāhmaṇā porāṇaṁ mantapadaṁ gītaṁ pavuttaṁ samihitaṁ, tadanugāyanti, tadanubhāsanti, bhāsitamanubhāsanti, vācitamanuvācenti, seyyathidaṁ—aṭṭhako vāmako vāmadevo vessāmitto yamataggi aṅgīraso bhāradvājo vāseṭṭho kassapo bhagu, tepi na evamāhaṁsu: ",
  "dn13:14.6": "‘mayametaṁ jānāma, mayametaṁ passāma, yattha vā brahmā, yena vā brahmā, yahiṁ vā brahmā’ti. ",
  "dn13:14.7": "Teva tevijjā brāhmaṇā evamāhaṁsu: ",
  "dn13:14.8": "‘yaṁ na jānāma, yaṁ na passāma, tassa sahabyatāya maggaṁ desema. ",
  "dn13:14.9": "Ayameva ujumaggo ayamañjasāyano niyyāniko, niyyāti takkarassa brahmasahabyatāyā’ti. ",
  "dn13:14.10": "Taṁ kiṁ maññasi, vāseṭṭha, ",
  "dn13:14.11": "nanu evaṁ sante tevijjānaṁ brāhmaṇānaṁ appāṭihīrakataṁ bhāsitaṁ sampajjatī”ti? ",
  "dn13:14.12": "“Addhā kho, bho gotama, evaṁ sante tevijjānaṁ brāhmaṇānaṁ appāṭihīrakataṁ bhāsitaṁ sampajjatī”ti. ",
  "dn13:15.1": "“Sādhu, vāseṭṭha, te vata, vāseṭṭha, tevijjā brāhmaṇā yaṁ na jānanti, yaṁ na passanti, tassa sahabyatāya maggaṁ desessanti. ‘Ayameva ujumaggo, ayamañjasāyano niyyāniko, niyyāti takkarassa brahmasahabyatāyā’ti, netaṁ ṭhānaṁ vijjati. ",
  "dn13:15.2": "Seyyathāpi, vāseṭṭha, andhaveṇi paramparasaṁsattā purimopi na passati, majjhimopi na passati, pacchimopi na passati; ",
  "dn13:15.3": "evameva kho, vāseṭṭha, andhaveṇūpamaṁ maññe tevijjānaṁ brāhmaṇānaṁ bhāsitaṁ, purimopi na passati, majjhimopi na passati, pacchimopi na passati. ",
  "dn13:15.4": "Tesamidaṁ tevijjānaṁ brāhmaṇānaṁ bhāsitaṁ hassakaññeva sampajjati, nāmakaññeva sampajjati, rittakaññeva sampajjati, tucchakaññeva sampajjati. ",
  "dn13:16.1": "Taṁ kiṁ maññasi, vāseṭṭha, ",
  "dn13:16.2": "passanti tevijjā brāhmaṇā candimasūriye, aññe cāpi bahujanā, yato ca candimasūriyā uggacchanti, yattha ca ogacchanti, āyācanti thomayanti pañjalikā namassamānā anuparivattantī”ti? ",
  "dn13:16.3": "“Evaṁ, bho gotama, passanti tevijjā brāhmaṇā candimasūriye, aññe cāpi bahujanā, yato ca candimasūriyā uggacchanti, yattha ca ogacchanti, āyācanti thomayanti pañjalikā namassamānā anuparivattantī”ti. ",
  "dn13:17.1": "“Taṁ kiṁ maññasi, vāseṭṭha, ",
  "dn13:17.2": "yaṁ passanti tevijjā brāhmaṇā candimasūriye, aññe cāpi bahujanā, yato ca candimasūriyā uggacchanti, yattha ca ogacchanti, āyācanti thomayanti pañjalikā namassamānā anuparivattanti, pahonti tevijjā brāhmaṇā candimasūriyānaṁ sahabyatāya maggaṁ desetuṁ: ",
  "dn13:17.3": "‘ayameva ujumaggo, ayamañjasāyano niyyāniko, niyyāti takkarassa candimasūriyānaṁ sahabyatāyā’”ti? ",
  "dn13:17.4": "“No hidaṁ, bho gotama”. ",
  "dn13:18.1": "“Iti kira, vāseṭṭha, yaṁ passanti tevijjā brāhmaṇā candimasūriye, aññe cāpi bahujanā, yato ca candimasūriyā uggacchanti, yattha ca ogacchanti, āyācanti thomayanti pañjalikā namassamānā anuparivattanti, tesampi nappahonti candimasūriyānaṁ sahabyatāya maggaṁ desetuṁ: ",
  "dn13:18.2": "‘ayameva ujumaggo, ayamañjasāyano niyyāniko, niyyāti takkarassa candimasūriyānaṁ sahabyatāyā’ti. ",
  "dn13:18.3": "Iti pana na kira tevijjehi brāhmaṇehi brahmā sakkhidiṭṭho. ",
  "dn13:18.4": "Napi kira tevijjānaṁ brāhmaṇānaṁ ācariyehi brahmā sakkhidiṭṭho. ",
  "dn13:18.5": "Napi kira tevijjānaṁ brāhmaṇānaṁ ācariyapācariyehi brahmā sakkhidiṭṭho. ",
  "dn13:18.6": "Napi kira tevijjānaṁ brāhmaṇānaṁ yāva sattamā ācariyāmahayugehi brahmā sakkhidiṭṭho. ",
  "dn13:18.7": "Yepi kira tevijjānaṁ brāhmaṇānaṁ pubbakā isayo mantānaṁ kattāro mantānaṁ pavattāro, yesamidaṁ etarahi tevijjā brāhmaṇā porāṇaṁ mantapadaṁ gītaṁ pavuttaṁ samihitaṁ, tadanugāyanti, tadanubhāsanti, bhāsitamanubhāsanti, vācitamanuvācenti, seyyathidaṁ—aṭṭhako vāmako vāmadevo vessāmitto yamataggi aṅgīraso bhāradvājo vāseṭṭho kassapo bhagu, tepi na evamāhaṁsu: ",
  "dn13:18.8": "‘mayametaṁ jānāma, mayametaṁ passāma, yattha vā brahmā, yena vā brahmā, yahiṁ vā brahmā’ti. ",
  "dn13:18.9": "Teva tevijjā brāhmaṇā evamāhaṁsu: ",
  "dn13:18.10": "‘yaṁ na jānāma, yaṁ na passāma, tassa sahabyatāya maggaṁ desema—ayameva ujumaggo ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāyā’ti. ",
  "dn13:18.11": "Taṁ kiṁ maññasi, vāseṭṭha, ",
  "dn13:18.12": "nanu evaṁ sante tevijjānaṁ brāhmaṇānaṁ appāṭihīrakataṁ bhāsitaṁ sampajjatī”ti? ",
  "dn13:18.13": "“Addhā kho, bho gotama, evaṁ sante tevijjānaṁ brāhmaṇānaṁ appāṭihīrakataṁ bhāsitaṁ sampajjatī”ti. ",
  "dn13:18.14": "“Sādhu, vāseṭṭha, te vata, vāseṭṭha, tevijjā brāhmaṇā yaṁ na jānanti, yaṁ na passanti, tassa sahabyatāya maggaṁ desessanti: ‘ayameva ujumaggo, ayamañjasāyano niyyāniko, niyyāti takkarassa brahmasahabyatāyā’ti, netaṁ ṭhānaṁ vijjati. ",
  "dn13:19.0": "2.1. Janapadakalyāṇīupamā ",
  "dn13:19.1": "Seyyathāpi, vāseṭṭha, puriso evaṁ vadeyya: ",
  "dn13:19.2": "‘ahaṁ yā imasmiṁ janapade janapadakalyāṇī, taṁ icchāmi, taṁ kāmemī’ti. ",
  "dn13:19.3": "Tamenaṁ evaṁ vadeyyuṁ: ",
  "dn13:19.4": "‘ambho purisa, yaṁ tvaṁ janapadakalyāṇiṁ icchasi kāmesi, jānāsi taṁ janapadakalyāṇiṁ—",
  "dn13:19.5": "khattiyī vā brāhmaṇī vā vessī vā suddī vā’ti? ",
  "dn13:19.6": "Iti puṭṭho ‘no’ti vadeyya. ",
  "dn13:19.7": "Tamenaṁ evaṁ vadeyyuṁ: ",
  "dn13:19.8": "‘ambho purisa, yaṁ tvaṁ janapadakalyāṇiṁ icchasi kāmesi, jānāsi taṁ janapadakalyāṇiṁ—evaṁnāmā evaṅgottāti vā, dīghā vā rassā vā majjhimā vā kāḷī vā sāmā vā maṅguracchavī vāti, amukasmiṁ gāme vā nigame vā nagare vā’ti? ",
  "dn13:19.9": "Iti puṭṭho ‘no’ti vadeyya. ",
  "dn13:19.10": "Tamenaṁ evaṁ vadeyyuṁ: ",
  "dn13:19.11": "‘ambho purisa, yaṁ tvaṁ na jānāsi na passasi, taṁ tvaṁ icchasi kāmesī’ti? ",
  "dn13:19.12": "Iti puṭṭho ‘āmā’ti vadeyya. ",
  "dn13:19.13": "Taṁ kiṁ maññasi, vāseṭṭha, ",
  "dn13:19.14": "nanu evaṁ sante tassa purisassa appāṭihīrakataṁ bhāsitaṁ sampajjatī”ti? ",
  "dn13:19.15": "“Addhā kho, bho gotama, evaṁ sante tassa purisassa appāṭihīrakataṁ bhāsitaṁ sampajjatī”ti. ",
  "dn13:20.1": "“Evameva kho, vāseṭṭha, na kira tevijjehi brāhmaṇehi brahmā sakkhidiṭṭho, napi kira tevijjānaṁ brāhmaṇānaṁ ācariyehi brahmā sakkhidiṭṭho, napi kira tevijjānaṁ brāhmaṇānaṁ ācariyapācariyehi brahmā sakkhidiṭṭho. ",
  "dn13:20.2": "Napi kira tevijjānaṁ brāhmaṇānaṁ yāva sattamā ācariyāmahayugehi brahmā sakkhidiṭṭho. ",
  "dn13:20.3": "Yepi kira tevijjānaṁ brāhmaṇānaṁ pubbakā isayo mantānaṁ kattāro mantānaṁ pavattāro, yesamidaṁ etarahi tevijjā brāhmaṇā porāṇaṁ mantapadaṁ gītaṁ pavuttaṁ samihitaṁ, tadanugāyanti, tadanubhāsanti, bhāsitamanubhāsanti, vācitamanuvācenti, seyyathidaṁ—aṭṭhako vāmako vāmadevo vessāmitto yamataggi aṅgīraso bhāradvājo vāseṭṭho kassapo bhagu, tepi na evamāhaṁsu: ",
  "dn13:20.4": "‘mayametaṁ jānāma, mayametaṁ passāma, yattha vā brahmā, yena vā brahmā, yahiṁ vā brahmā’ti. ",
  "dn13:20.5": "Teva tevijjā brāhmaṇā evamāhaṁsu: ",
  "dn13:20.6": "‘yaṁ na jānāma, yaṁ na passāma, tassa sahabyatāya maggaṁ desema—ayameva ujumaggo ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāyā’ti. ",
  "dn13:20.7": "Taṁ kiṁ maññasi, vāseṭṭha, nanu evaṁ sante tevijjānaṁ brāhmaṇānaṁ appāṭihīrakataṁ bhāsitaṁ sampajjatī”ti? ",
  "dn13:20.8": "“Addhā kho, bho gotama, evaṁ sante tevijjānaṁ brāhmaṇānaṁ appāṭihīrakataṁ bhāsitaṁ sampajjatī”ti. ",
  "dn13:20.9": "“Sādhu, vāseṭṭha, te vata, vāseṭṭha, tevijjā brāhmaṇā yaṁ na jānanti, yaṁ na passanti, tassa sahabyatāya maggaṁ desessanti—ayameva ujumaggo ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāyāti netaṁ ṭhānaṁ vijjati. ",
  "dn13:21.0": "2.2. Nisseṇīupamā ",
  "dn13:21.1": "Seyyathāpi, vāseṭṭha, puriso cātumahāpathe nisseṇiṁ kareyya pāsādassa ārohaṇāya. ",
  "dn13:21.2": "Tamenaṁ evaṁ vadeyyuṁ: ",
  "dn13:21.3": "‘ambho purisa, yassa tvaṁ pāsādassa ārohaṇāya nisseṇiṁ karosi, jānāsi taṁ pāsādaṁ—puratthimāya vā disāya dakkhiṇāya vā disāya pacchimāya vā disāya uttarāya vā disāya ucco vā nīco vā majjhimo vā’ti? ",
  "dn13:21.4": "Iti puṭṭho ‘no’ti vadeyya. ",
  "dn13:22.1": "Tamenaṁ evaṁ vadeyyuṁ: ",
  "dn13:22.2": "‘ambho purisa, yaṁ tvaṁ na jānāsi, na passasi, tassa tvaṁ pāsādassa ārohaṇāya nisseṇiṁ karosī’ti? ",
  "dn13:22.3": "Iti puṭṭho ‘āmā’ti vadeyya. ",
  "dn13:22.4": "Taṁ kiṁ maññasi, vāseṭṭha, ",
  "dn13:22.5": "nanu evaṁ sante tassa purisassa appāṭihīrakataṁ bhāsitaṁ sampajjatī”ti? ",
  "dn13:22.6": "“Addhā kho, bho gotama, evaṁ sante tassa purisassa appāṭihīrakataṁ bhāsitaṁ sampajjatī”ti. ",
  "dn13:22.7": "“Evameva kho, vāseṭṭha, na kira tevijjehi brāhmaṇehi brahmā sakkhidiṭṭho, napi kira tevijjānaṁ brāhmaṇānaṁ ācariyehi brahmā sakkhidiṭṭho, napi kira tevijjānaṁ brāhmaṇānaṁ ācariyapācariyehi brahmā sakkhidiṭṭho, napi kira tevijjānaṁ brāhmaṇānaṁ yāva sattamā ācariyāmahayugehi brahmā sakkhidiṭṭho. ",
  "dn13:22.8": "Yepi kira tevijjānaṁ brāhmaṇānaṁ pubbakā isayo mantānaṁ kattāro mantānaṁ pavattāro, yesamidaṁ etarahi tevijjā brāhmaṇā porāṇaṁ mantapadaṁ gītaṁ pavuttaṁ samihitaṁ, tadanugāyanti, tadanubhāsanti, bhāsitamanubhāsanti, vācitamanuvācenti, seyyathidaṁ—aṭṭhako vāmako vāmadevo vessāmitto yamataggi aṅgīraso bhāradvājo vāseṭṭho kassapo bhagu, tepi na evamāhaṁsu—",
  "dn13:22.9": "mayametaṁ jānāma, mayametaṁ passāma, yattha vā brahmā, yena vā brahmā, yahiṁ vā brahmāti. ",
  "dn13:22.10": "Teva tevijjā brāhmaṇā evamāhaṁsu: ",
  "dn13:22.11": "‘yaṁ na jānāma, yaṁ na passāma, tassa sahabyatāya maggaṁ desema, ayameva ujumaggo ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāyā’ti. ",
  "dn13:22.12": "Taṁ kiṁ maññasi, vāseṭṭha, nanu evaṁ sante tevijjānaṁ brāhmaṇānaṁ appāṭihīrakataṁ bhāsitaṁ sampajjatī”ti? ",
  "dn13:22.13": "“Addhā kho, bho gotama, evaṁ sante tevijjānaṁ brāhmaṇānaṁ appāṭihīrakataṁ bhāsitaṁ sampajjatī”ti. ",
  "dn13:23.1": "“Sādhu, vāseṭṭha, te vata, vāseṭṭha, tevijjā brāhmaṇā yaṁ na jānanti, yaṁ na passanti, tassa sahabyatāya maggaṁ desessanti. Ayameva ujumaggo ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāyāti, netaṁ ṭhānaṁ vijjati. ",
  "dn13:24.0": "2.3. Aciravatīnadīupamā ",
  "dn13:24.1": "Seyyathāpi, vāseṭṭha, ayaṁ aciravatī nadī pūrā udakassa samatittikā kākapeyyā. ",
  "dn13:24.2": "Atha puriso āgaccheyya pāratthiko pāragavesī pāragāmī pāraṁ taritukāmo. ",
  "dn13:24.3": "So orime tīre ṭhito pārimaṁ tīraṁ avheyya: ",
  "dn13:24.4": "‘ehi pārāpāraṁ, ehi pārāpāran’ti. ",
  "dn13:24.5": "Taṁ kiṁ maññasi, vāseṭṭha, ",
  "dn13:24.6": "api nu tassa purisassa avhāyanahetu vā āyācanahetu vā patthanahetu vā abhinandanahetu vā aciravatiyā nadiyā pārimaṁ tīraṁ orimaṁ tīraṁ āgaccheyyā”ti? ",
  "dn13:24.7": "“No hidaṁ, bho gotama”. ",
  "dn13:25.1": "“Evameva kho, vāseṭṭha, tevijjā brāhmaṇā ye dhammā brāhmaṇakārakā te dhamme pahāya vattamānā, ye dhammā abrāhmaṇakārakā te dhamme samādāya vattamānā evamāhaṁsu: ",
  "dn13:25.2": "‘indamavhayāma, somamavhayāma, varuṇamavhayāma, īsānamavhayāma, pajāpatimavhayāma, brahmamavhayāma, mahiddhimavhayāma, yamamavhayāmā’ti. ",
  "dn13:25.3": "Te vata, vāseṭṭha, tevijjā brāhmaṇā ye dhammā brāhmaṇakārakā te dhamme pahāya vattamānā, ye dhammā abrāhmaṇakārakā te dhamme samādāya vattamānā avhāyanahetu vā āyācanahetu vā patthanahetu vā abhinandanahetu vā kāyassa bhedā paraṁ maraṇā brahmānaṁ sahabyūpagā bhavissantīti, netaṁ ṭhānaṁ vijjati. ",
  "dn13:26.1": "Seyyathāpi, vāseṭṭha, ayaṁ aciravatī nadī pūrā udakassa samatittikā kākapeyyā. ",
  "dn13:26.2": "Atha puriso āgaccheyya pāratthiko pāragavesī pāragāmī pāraṁ taritukāmo. ",
  "dn13:26.3": "So orime tīre daḷhāya anduyā pacchābāhaṁ gāḷhabandhanaṁ baddho. ",
  "dn13:26.4": "Taṁ kiṁ maññasi, vāseṭṭha, ",
  "dn13:26.5": "api nu so puriso aciravatiyā nadiyā orimā tīrā pārimaṁ tīraṁ gaccheyyā”ti? ",
  "dn13:26.6": "“No hidaṁ, bho gotama”. ",
  "dn13:27.1": "“Evameva kho, vāseṭṭha, pañcime kāmaguṇā ariyassa vinaye andūtipi vuccanti, bandhanantipi vuccanti. ",
  "dn13:27.2": "Katame pañca? ",
  "dn13:27.3": "Cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṁhitā rajanīyā. ",
  "dn13:27.4": "Sotaviññeyyā saddā …pe… ",
  "dn13:27.5": "ghānaviññeyyā gandhā … ",
  "dn13:27.6": "jivhāviññeyyā rasā … ",
  "dn13:27.7": "kāyaviññeyyā phoṭṭhabbā iṭṭhā kantā manāpā piyarūpā kāmūpasaṁhitā rajanīyā. ",
  "dn13:27.8": "Ime kho, vāseṭṭha, pañca kāmaguṇā ariyassa vinaye andūtipi vuccanti, bandhanantipi vuccanti. ",
  "dn13:27.9": "Ime kho, vāseṭṭha, pañca kāmaguṇe tevijjā brāhmaṇā gadhitā mucchitā ajjhopannā anādīnavadassāvino anissaraṇapaññā paribhuñjanti. ",
  "dn13:28.1": "Te vata, vāseṭṭha, tevijjā brāhmaṇā ye dhammā brāhmaṇakārakā, te dhamme pahāya vattamānā, ye dhammā abrāhmaṇakārakā, te dhamme samādāya vattamānā pañca kāmaguṇe gadhitā mucchitā ajjhopannā anādīnavadassāvino anissaraṇapaññā paribhuñjantā kāmandubandhanabaddhā kāyassa bhedā paraṁ maraṇā brahmānaṁ sahabyūpagā bhavissantīti, netaṁ ṭhānaṁ vijjati. ",
  "dn13:29.1": "Seyyathāpi, vāseṭṭha, ayaṁ aciravatī nadī pūrā udakassa samatittikā kākapeyyā. ",
  "dn13:29.2": "Atha puriso āgaccheyya pāratthiko pāragavesī pāragāmī pāraṁ taritukāmo. ",
  "dn13:29.3": "So orime tīre sasīsaṁ pārupitvā nipajjeyya. ",
  "dn13:29.4": "Taṁ kiṁ maññasi, vāseṭṭha, ",
  "dn13:29.5": "api nu so puriso aciravatiyā nadiyā orimā tīrā pārimaṁ tīraṁ gaccheyyā”ti? ",
  "dn13:29.6": "“No hidaṁ, bho gotama”. ",
  "dn13:30.1": "“Evameva kho, vāseṭṭha, pañcime nīvaraṇā ariyassa vinaye āvaraṇātipi vuccanti, nīvaraṇātipi vuccanti, onāhanātipi vuccanti, pariyonāhanātipi vuccanti. ",
  "dn13:30.2": "Katame pañca? ",
  "dn13:30.3": "Kāmacchandanīvaraṇaṁ, byāpādanīvaraṇaṁ, thinamiddhanīvaraṇaṁ, uddhaccakukkuccanīvaraṇaṁ, vicikicchānīvaraṇaṁ. ",
  "dn13:30.4": "Ime kho, vāseṭṭha, pañca nīvaraṇā ariyassa vinaye āvaraṇātipi vuccanti, nīvaraṇātipi vuccanti, onāhanātipi vuccanti, pariyonāhanātipi vuccanti. ",
  "dn13:30.5": "Imehi kho, vāseṭṭha, pañcahi nīvaraṇehi tevijjā brāhmaṇā āvuṭā nivutā onaddhā pariyonaddhā. ",
  "dn13:30.6": "Te vata, vāseṭṭha, tevijjā brāhmaṇā ye dhammā brāhmaṇakārakā te dhamme pahāya vattamānā, ye dhammā abrāhmaṇakārakā te dhamme samādāya vattamānā pañcahi nīvaraṇehi āvuṭā nivutā onaddhā pariyonaddhā kāyassa bhedā paraṁ maraṇā brahmānaṁ sahabyūpagā bhavissantīti, netaṁ ṭhānaṁ vijjati. ",
  "dn13:31.0": "3. Saṁsandanakathā ",
  "dn13:31.1": "Taṁ kiṁ maññasi, vāseṭṭha, ",
  "dn13:31.2": "kinti te sutaṁ brāhmaṇānaṁ vuddhānaṁ mahallakānaṁ ācariyapācariyānaṁ bhāsamānānaṁ, sapariggaho vā brahmā apariggaho vā”ti? ",
  "dn13:31.3": "“Apariggaho, bho gotama”. ",
  "dn13:31.4": "“Saveracitto vā averacitto vā”ti? ",
  "dn13:31.5": "“Averacitto, bho gotama”. ",
  "dn13:31.6": "“Sabyāpajjacitto vā abyāpajjacitto vā”ti? ",
  "dn13:31.7": "“Abyāpajjacitto, bho gotama”. ",
  "dn13:31.8": "“Saṅkiliṭṭhacitto vā asaṅkiliṭṭhacitto vā”ti? ",
  "dn13:31.9": "“Asaṅkiliṭṭhacitto, bho gotama”. ",
  "dn13:31.10": "“Vasavattī vā avasavattī vā”ti? ",
  "dn13:31.11": "“Vasavattī, bho gotama”. ",
  "dn13:32.1": "“Taṁ kiṁ maññasi, vāseṭṭha, ",
  "dn13:32.2": "sapariggahā vā tevijjā brāhmaṇā apariggahā vā”ti? ",
  "dn13:32.3": "“Sapariggahā, bho gotama”. ",
  "dn13:32.4": "“Saveracittā vā averacittā vā”ti? ",
  "dn13:32.5": "“Saveracittā, bho gotama”. ",
  "dn13:32.6": "“Sabyāpajjacittā vā abyāpajjacittā vā”ti? ",
  "dn13:32.7": "“Sabyāpajjacittā, bho gotama”. ",
  "dn13:32.8": "“Saṅkiliṭṭhacittā vā asaṅkiliṭṭhacittā vā”ti? ",
  "dn13:32.9": "“Saṅkiliṭṭhacittā, bho gotama”. ",
  "dn13:32.10": "“Vasavattī vā avasavattī vā”ti? ",
  "dn13:32.11": "“Avasavattī, bho gotama”. ",
  "dn13:33.1": "“Iti kira, vāseṭṭha, sapariggahā tevijjā brāhmaṇā apariggaho brahmā. ",
  "dn13:33.2": "Api nu kho sapariggahānaṁ tevijjānaṁ brāhmaṇānaṁ apariggahena brahmunā saddhiṁ saṁsandati sametī”ti? ",
  "dn13:33.3": "“No hidaṁ, bho gotama”. ",
  "dn13:34.1": "“Sādhu, vāseṭṭha, te vata, vāseṭṭha, sapariggahā tevijjā brāhmaṇā kāyassa bhedā paraṁ maraṇā apariggahassa brahmuno sahabyūpagā bhavissantīti, netaṁ ṭhānaṁ vijjati. ",
  "dn13:35.1": "Iti kira, vāseṭṭha, saveracittā tevijjā brāhmaṇā, averacitto brahmā …pe… ",
  "dn13:35.2": "sabyāpajjacittā tevijjā brāhmaṇā abyāpajjacitto brahmā … ",
  "dn13:35.3": "saṅkiliṭṭhacittā tevijjā brāhmaṇā asaṅkiliṭṭhacitto brahmā … ",
  "dn13:35.4": "avasavattī tevijjā brāhmaṇā vasavattī brahmā, api nu kho avasavattīnaṁ tevijjānaṁ brāhmaṇānaṁ vasavattinā brahmunā saddhiṁ saṁsandati sametī”ti? ",
  "dn13:35.5": "“No hidaṁ, bho gotama”. ",
  "dn13:36.1": "“Sādhu, vāseṭṭha, te vata, vāseṭṭha, avasavattī tevijjā brāhmaṇā kāyassa bhedā paraṁ maraṇā vasavattissa brahmuno sahabyūpagā bhavissantīti, netaṁ ṭhānaṁ vijjati. ",
  "dn13:36.2": "Idha kho pana te, vāseṭṭha, tevijjā brāhmaṇā āsīditvā saṁsīdanti, saṁsīditvā visāraṁ pāpuṇanti, sukkhataraṁ maññe taranti. ",
  "dn13:36.3": "Tasmā idaṁ tevijjānaṁ brāhmaṇānaṁ tevijjāiriṇantipi vuccati, tevijjāvivanantipi vuccati, tevijjābyasanantipi vuccatī”ti. ",
  "dn13:37.1": "Evaṁ vutte, vāseṭṭho māṇavo bhagavantaṁ etadavoca: ",
  "dn13:37.2": "“sutaṁ metaṁ, bho gotama, samaṇo gotamo brahmānaṁ sahabyatāya maggaṁ jānātī”ti. ",
  "dn13:37.3": "“Taṁ kiṁ maññasi, vāseṭṭha. ",
  "dn13:37.4": "Āsanne ito manasākaṭaṁ, na ito dūre manasākaṭan”ti? ",
  "dn13:37.5": "“Evaṁ, bho gotama, āsanne ito manasākaṭaṁ, na ito dūre manasākaṭan”ti. ",
  "dn13:37.6": "“Taṁ kiṁ maññasi, vāseṭṭha, ",
  "dn13:37.7": "idhassa puriso manasākaṭe jātasaṁvaddho. ",
  "dn13:37.8": "Tamenaṁ manasākaṭato tāvadeva avasaṭaṁ manasākaṭassa maggaṁ puccheyyuṁ. ",
  "dn13:37.9": "Siyā nu kho, vāseṭṭha, tassa purisassa manasākaṭe jātasaṁvaddhassa manasākaṭassa maggaṁ puṭṭhassa dandhāyitattaṁ vā vitthāyitattaṁ vā”ti? ",
  "dn13:37.10": "“No hidaṁ, bho gotama”. ",
  "dn13:37.11": "“Taṁ kissa hetu”? ",
  "dn13:37.12": "“Amu hi, bho gotama, puriso manasākaṭe jātasaṁvaddho, tassa sabbāneva manasākaṭassa maggāni suviditānī”ti. ",
  "dn13:38.1": "“Siyā kho, vāseṭṭha, tassa purisassa manasākaṭe jātasaṁvaddhassa manasākaṭassa maggaṁ puṭṭhassa dandhāyitattaṁ vā vitthāyitattaṁ vā, na tveva tathāgatassa brahmaloke vā brahmalokagāminiyā vā paṭipadāya puṭṭhassa dandhāyitattaṁ vā vitthāyitattaṁ vā. ",
  "dn13:38.2": "Brahmānañcāhaṁ, vāseṭṭha, pajānāmi brahmalokañca brahmalokagāminiñca paṭipadaṁ, yathā paṭipanno ca brahmalokaṁ upapanno, tañca pajānāmī”ti. ",
  "dn13:39.1": "Evaṁ vutte, vāseṭṭho māṇavo bhagavantaṁ etadavoca: ",
  "dn13:39.2": "“sutaṁ metaṁ, bho gotama, samaṇo gotamo brahmānaṁ sahabyatāya maggaṁ desetī”ti. ",
  "dn13:39.3": "“Sādhu no bhavaṁ gotamo brahmānaṁ sahabyatāya maggaṁ desetu ullumpatu bhavaṁ gotamo brāhmaṇiṁ pajan”ti. ",
  "dn13:39.4": "“Tena hi, vāseṭṭha, suṇāhi; sādhukaṁ manasi karohi; bhāsissāmī”ti. ",
  "dn13:39.5": "“Evaṁ, bho”ti kho vāseṭṭho māṇavo bhagavato paccassosi. ",
  "dn13:40.0": "4. Brahmalokamaggadesanā ",
  "dn13:40.1": "Bhagavā etadavoca: ",
  "dn13:41.1": "“idha, vāseṭṭha, tathāgato loke uppajjati arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā. ",
  "dn13:41.2": "So imaṁ lokaṁ sadevakaṁ samārakaṁ sabrahmakaṁ sassamaṇabrāhmaṇiṁ pajaṁ sadevamanussaṁ sayaṁ abhiññā sacchikatvā pavedeti. ",
  "dn13:41.3": "So dhammaṁ deseti ādikalyāṇaṁ majjhekalyāṇaṁ pariyosānakalyāṇaṁ sātthaṁ sabyañjanaṁ, kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ pakāseti. ",
  "dn13:42.1": "Taṁ dhammaṁ suṇāti gahapati vā gahapatiputto vā aññatarasmiṁ vā kule paccājāto. ",
  "dn13:42.2": "So taṁ dhammaṁ sutvā tathāgate saddhaṁ paṭilabhati. ",
  "dn13:42.3": "So tena saddhāpaṭilābhena samannāgato iti paṭisañcikkhati: ",
  "dn13:42.4": "‘sambādho gharāvāso rajopatho, abbhokāso pabbajjā. ",
  "dn13:42.5": "Nayidaṁ sukaraṁ agāraṁ ajjhāvasatā ekantaparipuṇṇaṁ ekantaparisuddhaṁ saṅkhalikhitaṁ brahmacariyaṁ carituṁ. ",
  "dn13:42.6": "Yannūnāhaṁ kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajeyyan’ti. ",
  "dn13:42.7": "So aparena samayena appaṁ vā bhogakkhandhaṁ pahāya mahantaṁ vā bhogakkhandhaṁ pahāya appaṁ vā ñātiparivaṭṭaṁ pahāya mahantaṁ vā ñātiparivaṭṭaṁ pahāya kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajati. ",
  "dn13:43.1": "So evaṁ pabbajito samāno pātimokkhasaṁvarasaṁvuto viharati ācāragocarasampanno, aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu, kāyakammavacīkammena samannāgato kusalena, parisuddhājīvo sīlasampanno, indriyesu guttadvāro, satisampajaññena samannāgato, santuṭṭho. ",
  "dn13:44.0.1": "4.1. Sīla ",
  "dn13:44.0.2": "4.1.1. Cūḷasīla ",
  "dn13:44.1": "Kathañca, vāseṭṭha, bhikkhu sīlasampanno hoti? ",
  "dn13:44.2": "Idha, vāseṭṭha, bhikkhu pāṇātipātaṁ pahāya pāṇātipātā paṭivirato hoti. Nihitadaṇḍo nihitasattho lajjī dayāpanno sabbapāṇabhūtahitānukampī viharati. ",
  "dn13:44.3": "Idampissa hoti sīlasmiṁ. ",
  "dn13:44.4": "Adinnādānaṁ pahāya adinnādānā paṭivirato hoti dinnādāyī dinnapāṭikaṅkhī, athenena sucibhūtena attanā viharati. ",
  "dn13:44.5": "Idampissa hoti sīlasmiṁ. ",
  "dn13:44.6": "Abrahmacariyaṁ pahāya brahmacārī hoti ārācārī virato methunā gāmadhammā. ",
  "dn13:44.7": "Idampissa hoti sīlasmiṁ. ",
  "dn13:45.1": "Musāvādaṁ pahāya musāvādā paṭivirato hoti saccavādī saccasandho theto paccayiko avisaṁvādako lokassa. ",
  "dn13:45.2": "Idampissa hoti sīlasmiṁ. ",
  "dn13:45.3": "Pisuṇaṁ vācaṁ pahāya pisuṇāya vācāya paṭivirato hoti; ito sutvā na amutra akkhātā imesaṁ bhedāya; amutra vā sutvā na imesaṁ akkhātā, amūsaṁ bhedāya. Iti bhinnānaṁ vā sandhātā, sahitānaṁ vā anuppadātā, samaggārāmo samaggarato samagganandī samaggakaraṇiṁ vācaṁ bhāsitā hoti. ",
  "dn13:45.4": "Idampissa hoti sīlasmiṁ. ",
  "dn13:45.5": "Pharusaṁ vācaṁ pahāya pharusāya vācāya paṭivirato hoti; yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā tathārūpiṁ vācaṁ bhāsitā hoti. ",
  "dn13:45.6": "Idampissa hoti sīlasmiṁ. ",
  "dn13:45.7": "Samphappalāpaṁ pahāya samphappalāpā paṭivirato hoti kālavādī bhūtavādī atthavādī dhammavādī vinayavādī, nidhānavatiṁ vācaṁ bhāsitā hoti kālena sāpadesaṁ pariyantavatiṁ atthasaṁhitaṁ. ",
  "dn13:45.8": "Idampissa hoti sīlasmiṁ. ",
  "dn13:46.1": "Bījagāmabhūtagāmasamārambhā paṭivirato hoti …pe… ",
  "dn13:46.2": "ekabhattiko hoti rattūparato virato vikālabhojanā. ",
  "dn13:46.3": "Naccagītavāditavisūkadassanā paṭivirato hoti. ",
  "dn13:46.4": "Mālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānā paṭivirato hoti. ",
  "dn13:46.5": "Uccāsayanamahāsayanā paṭivirato hoti. ",
  "dn13:46.6": "Jātarūparajatapaṭiggahaṇā paṭivirato hoti. ",
  "dn13:46.7": "Āmakadhaññapaṭiggahaṇā paṭivirato hoti. ",
  "dn13:46.8": "Āmakamaṁsapaṭiggahaṇā paṭivirato hoti. ",
  "dn13:46.9": "Itthikumārikapaṭiggahaṇā paṭivirato hoti. ",
  "dn13:46.10": "Dāsidāsapaṭiggahaṇā paṭivirato hoti. ",
  "dn13:46.11": "Ajeḷakapaṭiggahaṇā paṭivirato hoti. ",
  "dn13:46.12": "Kukkuṭasūkarapaṭiggahaṇā paṭivirato hoti. ",
  "dn13:46.13": "Hatthigavassavaḷavapaṭiggahaṇā paṭivirato hoti. ",
  "dn13:46.14": "Khettavatthupaṭiggahaṇā paṭivirato hoti. ",
  "dn13:46.15": "Dūteyyapahiṇagamanānuyogā paṭivirato hoti. ",
  "dn13:46.16": "Kayavikkayā paṭivirato hoti. ",
  "dn13:46.17": "Tulākūṭakaṁsakūṭamānakūṭā paṭivirato hoti. ",
  "dn13:46.18": "Ukkoṭanavañcananikatisāciyogā paṭivirato hoti. ",
  "dn13:46.19": "Chedanavadhabandhanaviparāmosaālopasahasākārā paṭivirato hoti. ",
  "dn13:46.20": "Idampissa hoti sīlasmiṁ. ",
  "dn13:46.21": "Cūḷasīlaṁ niṭṭhitaṁ. ",
  "dn13:47.0": "4.1.2. Majjhimasīla ",
  "dn13:47.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ bījagāmabhūtagāmasamārambhaṁ anuyuttā viharanti. ",
  "dn13:47.2": "Seyyathidaṁ—mūlabījaṁ khandhabījaṁ phaḷubījaṁ aggabījaṁ bījabījameva pañcamaṁ, iti evarūpā bījagāmabhūtagāmasamārambhā paṭivirato hoti. ",
  "dn13:47.3": "Idampissa hoti sīlasmiṁ. ",
  "dn13:48.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ sannidhikāraparibhogaṁ anuyuttā viharanti. ",
  "dn13:48.2": "Seyyathidaṁ—annasannidhiṁ pānasannidhiṁ vatthasannidhiṁ yānasannidhiṁ sayanasannidhiṁ gandhasannidhiṁ āmisasannidhiṁ, ",
  "dn13:48.3": "iti vā iti evarūpā sannidhikāraparibhogā paṭivirato hoti. ",
  "dn13:48.4": "Idampissa hoti sīlasmiṁ. ",
  "dn13:49.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ visūkadassanaṁ anuyuttā viharanti. ",
  "dn13:49.2": "Seyyathidaṁ—naccaṁ gītaṁ vāditaṁ pekkhaṁ akkhānaṁ pāṇissaraṁ vetāḷaṁ kumbhathūṇaṁ sobhanakaṁ caṇḍālaṁ vaṁsaṁ dhovanaṁ hatthiyuddhaṁ assayuddhaṁ mahiṁsayuddhaṁ usabhayuddhaṁ ajayuddhaṁ meṇḍayuddhaṁ kukkuṭayuddhaṁ vaṭṭakayuddhaṁ daṇḍayuddhaṁ muṭṭhiyuddhaṁ nibbuddhaṁ uyyodhikaṁ balaggaṁ senābyūhaṁ anīkadassanaṁ ",
  "dn13:49.3": "iti vā iti evarūpā visūkadassanā paṭivirato hoti. ",
  "dn13:49.4": "Idampissa hoti sīlasmiṁ. ",
  "dn13:50.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ jūtappamādaṭṭhānānuyogaṁ anuyuttā viharanti. ",
  "dn13:50.2": "Seyyathidaṁ—aṭṭhapadaṁ dasapadaṁ ākāsaṁ parihārapathaṁ santikaṁ khalikaṁ ghaṭikaṁ salākahatthaṁ akkhaṁ paṅgacīraṁ vaṅkakaṁ mokkhacikaṁ ciṅgulikaṁ pattāḷhakaṁ rathakaṁ dhanukaṁ akkharikaṁ manesikaṁ yathāvajjaṁ ",
  "dn13:50.3": "iti vā iti evarūpā jūtappamādaṭṭhānānuyogā paṭivirato hoti. ",
  "dn13:50.4": "Idampissa hoti sīlasmiṁ. ",
  "dn13:51.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ uccāsayanamahāsayanaṁ anuyuttā viharanti. ",
  "dn13:51.2": "Seyyathidaṁ—āsandiṁ pallaṅkaṁ gonakaṁ cittakaṁ paṭikaṁ paṭalikaṁ tūlikaṁ vikatikaṁ uddalomiṁ ekantalomiṁ kaṭṭissaṁ koseyyaṁ kuttakaṁ hatthattharaṁ assattharaṁ rathattharaṁ ajinappaveṇiṁ kadalimigapavarapaccattharaṇaṁ sauttaracchadaṁ ubhatolohitakūpadhānaṁ ",
  "dn13:51.3": "iti vā iti evarūpā uccāsayanamahāsayanā paṭivirato hoti. ",
  "dn13:51.4": "Idampissa hoti sīlasmiṁ. ",
  "dn13:52.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ maṇḍanavibhūsanaṭṭhānānuyogaṁ anuyuttā viharanti. ",
  "dn13:52.2": "Seyyathidaṁ—ucchādanaṁ parimaddanaṁ nhāpanaṁ sambāhanaṁ ādāsaṁ añjanaṁ mālāgandhavilepanaṁ mukhacuṇṇaṁ mukhalepanaṁ hatthabandhaṁ sikhābandhaṁ daṇḍaṁ nāḷikaṁ asiṁ chattaṁ citrupāhanaṁ uṇhīsaṁ maṇiṁ vālabījaniṁ odātāni vatthāni dīghadasāni ",
  "dn13:52.3": "iti vā iti evarūpā maṇḍanavibhūsanaṭṭhānānuyogā paṭivirato hoti. ",
  "dn13:52.4": "Idampissa hoti sīlasmiṁ. ",
  "dn13:53.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ tiracchānakathaṁ anuyuttā viharanti. ",
  "dn13:53.2": "Seyyathidaṁ—rājakathaṁ corakathaṁ mahāmattakathaṁ senākathaṁ bhayakathaṁ yuddhakathaṁ annakathaṁ pānakathaṁ vatthakathaṁ sayanakathaṁ mālākathaṁ gandhakathaṁ ñātikathaṁ yānakathaṁ gāmakathaṁ nigamakathaṁ nagarakathaṁ janapadakathaṁ itthikathaṁ sūrakathaṁ visikhākathaṁ kumbhaṭṭhānakathaṁ pubbapetakathaṁ nānattakathaṁ lokakkhāyikaṁ samuddakkhāyikaṁ itibhavābhavakathaṁ ",
  "dn13:53.3": "iti vā iti evarūpāya tiracchānakathāya paṭivirato hoti. ",
  "dn13:53.4": "Idampissa hoti sīlasmiṁ. ",
  "dn13:54.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ viggāhikakathaṁ anuyuttā viharanti. ",
  "dn13:54.2": "Seyyathidaṁ—na tvaṁ imaṁ dhammavinayaṁ ājānāsi, ahaṁ imaṁ dhammavinayaṁ ājānāmi, kiṁ tvaṁ imaṁ dhammavinayaṁ ājānissasi, micchā paṭipanno tvamasi, ahamasmi sammā paṭipanno, sahitaṁ me, asahitaṁ te, pure vacanīyaṁ pacchā avaca, pacchā vacanīyaṁ pure avaca, adhiciṇṇaṁ te viparāvattaṁ, āropito te vādo, niggahito tvamasi, cara vādappamokkhāya, nibbeṭhehi vā sace pahosīti ",
  "dn13:54.3": "iti vā iti evarūpāya viggāhikakathāya paṭivirato hoti. ",
  "dn13:54.4": "Idampissa hoti sīlasmiṁ. ",
  "dn13:55.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ dūteyyapahiṇagamanānuyogaṁ anuyuttā viharanti. ",
  "dn13:55.2": "Seyyathidaṁ—raññaṁ, rājamahāmattānaṁ, khattiyānaṁ, brāhmaṇānaṁ, gahapatikānaṁ, kumārānaṁ—idha gaccha, amutrāgaccha, idaṁ hara, amutra idaṁ āharā’ti ",
  "dn13:55.3": "iti vā iti evarūpā dūteyyapahiṇagamanānuyogā paṭivirato hoti. ",
  "dn13:55.4": "Idampissa hoti sīlasmiṁ. ",
  "dn13:56.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te kuhakā ca honti lapakā ca nemittikā ca nippesikā ca lābhena lābhaṁ nijigīsitāro ca. Iti evarūpā kuhanalapanā paṭivirato hoti. ",
  "dn13:56.2": "Idampissa hoti sīlasmiṁ. ",
  "dn13:56.3": "Majjhimasīlaṁ niṭṭhitaṁ. ",
  "dn13:57.0": "4.1.3. Mahāsīla ",
  "dn13:57.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn13:57.2": "Seyyathidaṁ—aṅgaṁ nimittaṁ uppātaṁ supinaṁ lakkhaṇaṁ mūsikacchinnaṁ aggihomaṁ dabbihomaṁ thusahomaṁ kaṇahomaṁ taṇḍulahomaṁ sappihomaṁ telahomaṁ mukhahomaṁ lohitahomaṁ aṅgavijjā vatthuvijjā khattavijjā sivavijjā bhūtavijjā bhūrivijjā ahivijjā visavijjā vicchikavijjā mūsikavijjā sakuṇavijjā vāyasavijjā pakkajjhānaṁ saraparittāṇaṁ migacakkaṁ ",
  "dn13:57.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn13:57.4": "Idampissa hoti sīlasmiṁ. ",
  "dn13:58.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn13:58.2": "Seyyathidaṁ—maṇilakkhaṇaṁ vatthalakkhaṇaṁ daṇḍalakkhaṇaṁ satthalakkhaṇaṁ asilakkhaṇaṁ usulakkhaṇaṁ dhanulakkhaṇaṁ āvudhalakkhaṇaṁ itthilakkhaṇaṁ purisalakkhaṇaṁ kumāralakkhaṇaṁ kumārilakkhaṇaṁ dāsalakkhaṇaṁ dāsilakkhaṇaṁ hatthilakkhaṇaṁ assalakkhaṇaṁ mahiṁsalakkhaṇaṁ usabhalakkhaṇaṁ golakkhaṇaṁ ajalakkhaṇaṁ meṇḍalakkhaṇaṁ kukkuṭalakkhaṇaṁ vaṭṭakalakkhaṇaṁ godhālakkhaṇaṁ kaṇṇikalakkhaṇaṁ kacchapalakkhaṇaṁ migalakkhaṇaṁ ",
  "dn13:58.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn13:58.4": "Idampissa hoti sīlasmiṁ. ",
  "dn13:59.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn13:59.2": "Seyyathidaṁ—raññaṁ niyyānaṁ bhavissati, raññaṁ aniyyānaṁ bhavissati, abbhantarānaṁ raññaṁ upayānaṁ bhavissati, bāhirānaṁ raññaṁ apayānaṁ bhavissati, bāhirānaṁ raññaṁ upayānaṁ bhavissati, abbhantarānaṁ raññaṁ apayānaṁ bhavissati, abbhantarānaṁ raññaṁ jayo bhavissati, bāhirānaṁ raññaṁ parājayo bhavissati, bāhirānaṁ raññaṁ jayo bhavissati, abbhantarānaṁ raññaṁ parājayo bhavissati, iti imassa jayo bhavissati, imassa parājayo bhavissati ",
  "dn13:59.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn13:59.4": "Idampissa hoti sīlasmiṁ. ",
  "dn13:60.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn13:60.2": "Seyyathidaṁ—candaggāho bhavissati, sūriyaggāho bhavissati, nakkhattaggāho bhavissati, candimasūriyānaṁ pathagamanaṁ bhavissati, candimasūriyānaṁ uppathagamanaṁ bhavissati, nakkhattānaṁ pathagamanaṁ bhavissati, nakkhattānaṁ uppathagamanaṁ bhavissati, ukkāpāto bhavissati, disāḍāho bhavissati, bhūmicālo bhavissati, devadudrabhi bhavissati, candimasūriyanakkhattānaṁ uggamanaṁ ogamanaṁ saṅkilesaṁ vodānaṁ bhavissati, evaṁvipāko candaggāho bhavissati, evaṁvipāko sūriyaggāho bhavissati, evaṁvipāko nakkhattaggāho bhavissati, evaṁvipākaṁ candimasūriyānaṁ pathagamanaṁ bhavissati, evaṁvipākaṁ candimasūriyānaṁ uppathagamanaṁ bhavissati, evaṁvipākaṁ nakkhattānaṁ pathagamanaṁ bhavissati, evaṁvipākaṁ nakkhattānaṁ uppathagamanaṁ bhavissati, evaṁvipāko ukkāpāto bhavissati, evaṁvipāko disāḍāho bhavissati, evaṁvipāko bhūmicālo bhavissati, evaṁvipāko devadudrabhi bhavissati, evaṁvipākaṁ candimasūriyanakkhattānaṁ uggamanaṁ ogamanaṁ saṅkilesaṁ vodānaṁ bhavissati ",
  "dn13:60.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn13:60.4": "Idampissa hoti sīlasmiṁ. ",
  "dn13:61.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn13:61.2": "Seyyathidaṁ—suvuṭṭhikā bhavissati, dubbuṭṭhikā bhavissati, subhikkhaṁ bhavissati, dubbhikkhaṁ bhavissati, khemaṁ bhavissati, bhayaṁ bhavissati, rogo bhavissati, ārogyaṁ bhavissati, muddā, gaṇanā, saṅkhānaṁ, kāveyyaṁ, lokāyataṁ ",
  "dn13:61.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn13:61.4": "Idampissa hoti sīlasmiṁ. ",
  "dn13:62.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn13:62.2": "Seyyathidaṁ—āvāhanaṁ vivāhanaṁ saṁvaraṇaṁ vivaraṇaṁ saṅkiraṇaṁ vikiraṇaṁ subhagakaraṇaṁ dubbhagakaraṇaṁ viruddhagabbhakaraṇaṁ jivhānibandhanaṁ hanusaṁhananaṁ hatthābhijappanaṁ hanujappanaṁ kaṇṇajappanaṁ ādāsapañhaṁ kumārikapañhaṁ devapañhaṁ ādiccupaṭṭhānaṁ mahatupaṭṭhānaṁ abbhujjalanaṁ sirivhāyanaṁ ",
  "dn13:62.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn13:62.4": "Idampissa hoti sīlasmiṁ. ",
  "dn13:63.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn13:63.2": "Seyyathidaṁ—santikammaṁ paṇidhikammaṁ bhūtakammaṁ bhūrikammaṁ vassakammaṁ vossakammaṁ vatthukammaṁ vatthuparikammaṁ ācamanaṁ nhāpanaṁ juhanaṁ vamanaṁ virecanaṁ uddhaṁvirecanaṁ adhovirecanaṁ sīsavirecanaṁ kaṇṇatelaṁ nettatappanaṁ natthukammaṁ añjanaṁ paccañjanaṁ sālākiyaṁ sallakattiyaṁ dārakatikicchā, mūlabhesajjānaṁ anuppadānaṁ, osadhīnaṁ paṭimokkho ",
  "dn13:63.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn13:63.4": "Idampissa hoti sīlasmiṁ. ",
  "dn13:64.1": "Sa kho so, vāseṭṭha, bhikkhu evaṁ sīlasampanno na kutoci bhayaṁ samanupassati, yadidaṁ sīlasaṁvarato. ",
  "dn13:64.2": "Seyyathāpi, vāseṭṭha, rājā khattiyo muddhābhisitto nihatapaccāmitto na kutoci bhayaṁ samanupassati, yadidaṁ paccatthikato; ",
  "dn13:64.3": "evameva kho, vāseṭṭha, bhikkhu evaṁ sīlasampanno na kutoci bhayaṁ samanupassati, yadidaṁ sīlasaṁvarato. ",
  "dn13:64.4": "So iminā ariyena sīlakkhandhena samannāgato ajjhattaṁ anavajjasukhaṁ paṭisaṁvedeti. ",
  "dn13:64.5": "Evaṁ kho, vāseṭṭha, bhikkhu sīlasampanno hoti. ",
  "dn13:64.6": "Mahāsīlaṁ niṭṭhitaṁ. ",
  "dn13:65.0.1": "4.2. Samādhi ",
  "dn13:65.0.2": "4.2.1. Indriyasaṁvara ",
  "dn13:65.1": "Kathañca, vāseṭṭha, bhikkhu indriyesu guttadvāro hoti? ",
  "dn13:65.2": "Idha, vāseṭṭha, bhikkhu cakkhunā rūpaṁ disvā na nimittaggāhī hoti nānubyañjanaggāhī. ",
  "dn13:65.3": "Yatvādhikaraṇamenaṁ cakkhundriyaṁ asaṁvutaṁ viharantaṁ abhijjhā domanassā pāpakā akusalā dhammā anvāssaveyyuṁ, tassa saṁvarāya paṭipajjati, rakkhati cakkhundriyaṁ, cakkhundriye saṁvaraṁ āpajjati. ",
  "dn13:65.4": "Sotena saddaṁ sutvā …pe… ",
  "dn13:65.5": "ghānena gandhaṁ ghāyitvā …pe… ",
  "dn13:65.6": "jivhāya rasaṁ sāyitvā …pe… ",
  "dn13:65.7": "kāyena phoṭṭhabbaṁ phusitvā …pe… ",
  "dn13:65.8": "manasā dhammaṁ viññāya na nimittaggāhī hoti nānubyañjanaggāhī. ",
  "dn13:65.9": "Yatvādhikaraṇamenaṁ manindriyaṁ asaṁvutaṁ viharantaṁ abhijjhā domanassā pāpakā akusalā dhammā anvāssaveyyuṁ, tassa saṁvarāya paṭipajjati, rakkhati manindriyaṁ, manindriye saṁvaraṁ āpajjati. ",
  "dn13:65.10": "So iminā ariyena indriyasaṁvarena samannāgato ajjhattaṁ abyāsekasukhaṁ paṭisaṁvedeti. ",
  "dn13:65.11": "Evaṁ kho, vāseṭṭha, bhikkhu indriyesu guttadvāro hoti. ",
  "dn13:66.0": "4.2.2. Satisampajañña ",
  "dn13:66.1": "Kathañca, vāseṭṭha, bhikkhu satisampajaññena samannāgato hoti? ",
  "dn13:66.2": "Idha, vāseṭṭha, bhikkhu abhikkante paṭikkante sampajānakārī hoti, ālokite vilokite sampajānakārī hoti, samiñjite pasārite sampajānakārī hoti, saṅghāṭipattacīvaradhāraṇe sampajānakārī hoti, asite pīte khāyite sāyite sampajānakārī hoti, uccārapassāvakamme sampajānakārī hoti, gate ṭhite nisinne sutte jāgarite bhāsite tuṇhībhāve sampajānakārī hoti. ",
  "dn13:66.3": "Evaṁ kho, vāseṭṭha, bhikkhu satisampajaññena samannāgato hoti. ",
  "dn13:67.0": "4.2.3. Santosa ",
  "dn13:67.1": "Kathañca, vāseṭṭha, bhikkhu santuṭṭho hoti? ",
  "dn13:67.2": "Idha, vāseṭṭha, bhikkhu santuṭṭho hoti kāyaparihārikena cīvarena, kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati, samādāyeva pakkamati. ",
  "dn13:67.3": "Seyyathāpi, vāseṭṭha, pakkhī sakuṇo yena yeneva ḍeti, sapattabhārova ḍeti; ",
  "dn13:67.4": "evameva kho, vāseṭṭha, bhikkhu santuṭṭho hoti kāyaparihārikena cīvarena kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati, samādāyeva pakkamati. ",
  "dn13:67.5": "Evaṁ kho, vāseṭṭha, bhikkhu santuṭṭho hoti. ",
  "dn13:68.0": "4.2.4. Nīvaraṇappahāna ",
  "dn13:68.1": "So iminā ca ariyena sīlakkhandhena samannāgato, iminā ca ariyena indriyasaṁvarena samannāgato, iminā ca ariyena satisampajaññena samannāgato, imāya ca ariyāya santuṭṭhiyā samannāgato, ",
  "dn13:68.2": "vivittaṁ senāsanaṁ bhajati araññaṁ rukkhamūlaṁ pabbataṁ kandaraṁ giriguhaṁ susānaṁ vanapatthaṁ abbhokāsaṁ palālapuñjaṁ. ",
  "dn13:68.3": "So pacchābhattaṁ piṇḍapātapaṭikkanto nisīdati pallaṅkaṁ ābhujitvā ujuṁ kāyaṁ paṇidhāya parimukhaṁ satiṁ upaṭṭhapetvā. ",
  "dn13:69.1": "So abhijjhaṁ loke pahāya vigatābhijjhena cetasā viharati, abhijjhāya cittaṁ parisodheti. ",
  "dn13:69.2": "Byāpādapadosaṁ pahāya abyāpannacitto viharati sabbapāṇabhūtahitānukampī, byāpādapadosā cittaṁ parisodheti. ",
  "dn13:69.3": "Thinamiddhaṁ pahāya vigatathinamiddho viharati ālokasaññī, sato sampajāno, thinamiddhā cittaṁ parisodheti. ",
  "dn13:69.4": "Uddhaccakukkuccaṁ pahāya anuddhato viharati, ajjhattaṁ vūpasantacitto, uddhaccakukkuccā cittaṁ parisodheti. ",
  "dn13:69.5": "Vicikicchaṁ pahāya tiṇṇavicikiccho viharati, akathaṅkathī kusalesu dhammesu, vicikicchāya cittaṁ parisodheti. ",
  "dn13:70.1": "Seyyathāpi, vāseṭṭha, puriso iṇaṁ ādāya kammante payojeyya. ",
  "dn13:70.2": "Tassa te kammantā samijjheyyuṁ. ",
  "dn13:70.3": "So yāni ca porāṇāni iṇamūlāni, tāni ca byantiṁ kareyya, siyā cassa uttariṁ avasiṭṭhaṁ dārabharaṇāya. ",
  "dn13:70.4": "Tassa evamassa: ",
  "dn13:70.5": "‘ahaṁ kho pubbe iṇaṁ ādāya kammante payojesiṁ. ",
  "dn13:70.6": "Tassa me te kammantā samijjhiṁsu. ",
  "dn13:70.7": "Sohaṁ yāni ca porāṇāni iṇamūlāni, tāni ca byantiṁ akāsiṁ, atthi ca me uttariṁ avasiṭṭhaṁ dārabharaṇāyā’ti. ",
  "dn13:70.8": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn13:71.1": "Seyyathāpi, vāseṭṭha, puriso ābādhiko assa dukkhito bāḷhagilāno; bhattañcassa nacchādeyya, na cassa kāye balamattā. ",
  "dn13:71.2": "So aparena samayena tamhā ābādhā mucceyya; bhattaṁ cassa chādeyya, siyā cassa kāye balamattā. ",
  "dn13:71.3": "Tassa evamassa: ",
  "dn13:71.4": "‘ahaṁ kho pubbe ābādhiko ahosiṁ dukkhito bāḷhagilāno; ",
  "dn13:71.5": "bhattañca me nacchādesi, na ca me āsi kāye balamattā. ",
  "dn13:71.6": "Somhi etarahi tamhā ābādhā mutto; ",
  "dn13:71.7": "bhattañca me chādeti, atthi ca me kāye balamattā’ti. ",
  "dn13:71.8": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn13:72.1": "Seyyathāpi, vāseṭṭha, puriso bandhanāgāre baddho assa. ",
  "dn13:72.2": "So aparena samayena tamhā bandhanāgārā mucceyya sotthinā abbhayena, na cassa kiñci bhogānaṁ vayo. ",
  "dn13:72.3": "Tassa evamassa: ",
  "dn13:72.4": "‘ahaṁ kho pubbe bandhanāgāre baddho ahosiṁ, somhi etarahi tamhā bandhanāgārā mutto sotthinā abbhayena. ",
  "dn13:72.5": "Natthi ca me kiñci bhogānaṁ vayo’ti. ",
  "dn13:72.6": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn13:73.1": "Seyyathāpi, vāseṭṭha, puriso dāso assa anattādhīno parādhīno na yenakāmaṅgamo. ",
  "dn13:73.2": "So aparena samayena tamhā dāsabyā mucceyya attādhīno aparādhīno bhujisso yenakāmaṅgamo. ",
  "dn13:73.3": "Tassa evamassa: ",
  "dn13:73.4": "‘ahaṁ kho pubbe dāso ahosiṁ anattādhīno parādhīno na yenakāmaṅgamo. ",
  "dn13:73.5": "Somhi etarahi tamhā dāsabyā mutto attādhīno aparādhīno bhujisso yenakāmaṅgamo’ti. ",
  "dn13:73.6": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn13:74.1": "Seyyathāpi, vāseṭṭha, puriso sadhano sabhogo kantāraddhānamaggaṁ paṭipajjeyya dubbhikkhaṁ sappaṭibhayaṁ. ",
  "dn13:74.2": "So aparena samayena taṁ kantāraṁ nitthareyya sotthinā, gāmantaṁ anupāpuṇeyya khemaṁ appaṭibhayaṁ. ",
  "dn13:74.3": "Tassa evamassa: ",
  "dn13:74.4": "‘ahaṁ kho pubbe sadhano sabhogo kantāraddhānamaggaṁ paṭipajjiṁ dubbhikkhaṁ sappaṭibhayaṁ. ",
  "dn13:74.5": "Somhi etarahi taṁ kantāraṁ nitthiṇṇo sotthinā, gāmantaṁ anuppatto khemaṁ appaṭibhayan’ti. ",
  "dn13:74.6": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn13:75.1": "Evameva kho, vāseṭṭha, bhikkhu yathā iṇaṁ yathā rogaṁ yathā bandhanāgāraṁ yathā dāsabyaṁ yathā kantāraddhānamaggaṁ, evaṁ ime pañca nīvaraṇe appahīne attani samanupassati. ",
  "dn13:75.2": "Seyyathāpi, vāseṭṭha, yathā āṇaṇyaṁ yathā ārogyaṁ yathā bandhanāmokkhaṁ yathā bhujissaṁ yathā khemantabhūmiṁ; ",
  "dn13:75.3": "evameva kho, vāseṭṭha, bhikkhu ime pañca nīvaraṇe pahīne attani samanupassati. ",
  "dn13:75.4": "tassime pañca nīvaraṇe pahīne attani samanupassato pāmojjaṁ jāyati, pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṁ vedeti, sukhino cittaṁ samādhiyati. ",
  "dn13:76.1": "So mettāsahagatena cetasā ekaṁ disaṁ pharitvā viharati. Tathā dutiyaṁ. Tathā tatiyaṁ. Tathā catutthaṁ. Iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. ",
  "dn13:77.1": "Seyyathāpi, vāseṭṭha, balavā saṅkhadhamo appakasireneva catuddisā viññāpeyya; ",
  "dn13:77.2": "evameva kho, vāseṭṭha, evaṁ bhāvitāya mettāya cetovimuttiyā yaṁ pamāṇakataṁ kammaṁ na taṁ tatrāvasissati, na taṁ tatrāvatiṭṭhati. ",
  "dn13:77.3": "Ayampi kho, vāseṭṭha, brahmānaṁ sahabyatāya maggo. ",
  "dn13:78.1": "Puna caparaṁ, vāseṭṭha, bhikkhu karuṇāsahagatena cetasā …pe… ",
  "dn13:78.2": "muditāsahagatena cetasā …pe… ",
  "dn13:78.3": "upekkhāsahagatena cetasā ekaṁ disaṁ pharitvā viharati. Tathā dutiyaṁ. Tathā tatiyaṁ. Tathā catutthaṁ. Iti uddhamadho tiriyaṁ sabbadhi sabbattatāya sabbāvantaṁ lokaṁ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. ",
  "dn13:79.1": "Seyyathāpi, vāseṭṭha, balavā saṅkhadhamo appakasireneva catuddisā viññāpeyya; ",
  "dn13:79.2": "evameva kho, vāseṭṭha, evaṁ bhāvitāya upekkhāya cetovimuttiyā yaṁ pamāṇakataṁ kammaṁ na taṁ tatrāvasissati, na taṁ tatrāvatiṭṭhati. ",
  "dn13:79.3": "Ayampi kho, vāseṭṭha, brahmānaṁ sahabyatāya maggo. ",
  "dn13:80.1": "Taṁ kiṁ maññasi, vāseṭṭha, ",
  "dn13:80.2": "evaṁvihārī bhikkhu sapariggaho vā apariggaho vā”ti? ",
  "dn13:80.3": "“Apariggaho, bho gotama”. ",
  "dn13:80.4": "“Saveracitto vā averacitto vā”ti? ",
  "dn13:80.5": "“Averacitto, bho gotama”. ",
  "dn13:80.6": "“Sabyāpajjacitto vā abyāpajjacitto vā”ti? ",
  "dn13:80.7": "“Abyāpajjacitto, bho gotama”. ",
  "dn13:80.8": "“Saṅkiliṭṭhacitto vā asaṅkiliṭṭhacitto vā”ti? ",
  "dn13:80.9": "“Asaṅkiliṭṭhacitto, bho gotama”. ",
  "dn13:80.10": "“Vasavattī vā avasavattī vā”ti? ",
  "dn13:80.11": "“Vasavattī, bho gotama”. ",
  "dn13:81.1": "“Iti kira, vāseṭṭha, apariggaho bhikkhu, apariggaho brahmā. ",
  "dn13:81.2": "Api nu kho apariggahassa bhikkhuno apariggahena brahmunā saddhiṁ saṁsandati sametī”ti? ",
  "dn13:81.3": "“Evaṁ, bho gotama”. ",
  "dn13:81.4": "“Sādhu, vāseṭṭha, so vata vāseṭṭha apariggaho bhikkhu kāyassa bhedā paraṁ maraṇā apariggahassa brahmuno sahabyūpago bhavissatīti, ṭhānametaṁ vijjati. ",
  "dn13:81.5": "Iti kira, vāseṭṭha, averacitto bhikkhu, averacitto brahmā …pe… ",
  "dn13:81.6": "abyāpajjacitto bhikkhu, abyāpajjacitto brahmā … ",
  "dn13:81.7": "asaṅkiliṭṭhacitto bhikkhu, asaṅkiliṭṭhacitto brahmā … ",
  "dn13:81.8": "vasavattī bhikkhu, vasavattī brahmā, api nu kho vasavattissa bhikkhuno vasavattinā brahmunā saddhiṁ saṁsandati sametī”ti? ",
  "dn13:81.9": "“Evaṁ, bho gotama”. ",
  "dn13:81.10": "“Sādhu, vāseṭṭha, so vata, vāseṭṭha, vasavattī bhikkhu kāyassa bhedā paraṁ maraṇā vasavattissa brahmuno sahabyūpago bhavissatīti, ṭhānametaṁ vijjatī”ti. ",
  "dn13:82.1": "Evaṁ vutte, vāseṭṭhabhāradvājā māṇavā bhagavantaṁ etadavocuṁ: ",
  "dn13:82.2": "“abhikkantaṁ, bho gotama, abhikkantaṁ, bho gotama. ",
  "dn13:82.3": "Seyyathāpi, bho gotama, nikkujjitaṁ vā ukkujjeyya, paṭicchannaṁ vā vivareyya, mūḷhassa vā maggaṁ ācikkheyya, andhakāre vā telapajjotaṁ dhāreyya: ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṁ bhotā gotamena anekapariyāyena dhammo pakāsito. ",
  "dn13:82.4": "Ete mayaṁ bhavantaṁ gotamaṁ saraṇaṁ gacchāma, dhammañca bhikkhusaṅghañca. ",
  "dn13:82.5": "Upāsake no bhavaṁ gotamo dhāretu ajjatagge pāṇupete saraṇaṁ gate”ti. ",
  "dn13:82.6": "Tevijjasuttaṁ niṭṭhitaṁ terasamaṁ. ",
  "dn13:82.7": "Sīlakkhandhavaggo niṭṭhito. ",
  "dn13:83.0": "Tassuddānaṁ ",
  "dn13:83.1": "Brahmāsāmaññaambaṭṭha, ",
  "dn13:83.2": "Soṇakūṭamahālijālinī; ",
  "dn13:83.3": "Sīhapoṭṭhapādasubho kevaṭṭo, ",
  "dn13:83.4": "Lohiccatevijjā terasāti. ",
  "dn13:83.5": "Sīlakkhandhavaggapāḷi niṭṭhitā. "
}