{
  "dn13:0.1": "Long Discourses 13 ",
  "dn13:0.2": "Experts in the Three Vedas ",
  "dn13:1.1": "So I have heard. ",
  "dn13:1.2": "At one time the Buddha was wandering in the land of the Kosalans together with a large Saṅgha of five hundred mendicants when he arrived at a village of the Kosalan brahmins named Manasākaṭa. ",
  "dn13:1.3": "He stayed in a mango grove on a bank of the river Aciravatī to the north of Manasākaṭa. ",
  "dn13:2.1": "Now at that time several very well-known well-to-do brahmins were residing in Manasākaṭa. They included ",
  "dn13:2.2": "the brahmins Caṅkī, Tārukkha, Pokkharasāti, Jānussoṇi, Todeyya, and others. ",
  "dn13:3.1": "Then as the students Vāseṭṭha and Bhāradvāja were going for a walk they began a discussion regarding what is the path and what is not the path. ",
  "dn13:4.1": "Vāseṭṭha said this: ",
  "dn13:4.2": "“This is the only straight path, the direct route that delivers one who practices it to the company of Divinity; namely, that explained by the brahmin Pokkharasāti.” ",
  "dn13:5.1": "Bhāradvāja said this: ",
  "dn13:5.2": "“This is the only straight path, the direct route that delivers one who practices it to the company of Divinity; namely, that explained by the brahmin Tārukkha.” ",
  "dn13:6.1": "But neither was able to persuade the other. ",
  "dn13:7.1": "So Vāseṭṭha said to Bhāradvāja, ",
  "dn13:7.2": "“Bhāradvāja, the ascetic Gotama—a Sakyan, gone forth from a Sakyan family—is staying in a mango grove on a bank of the river Aciravatī to the north of Manasākaṭa. ",
  "dn13:7.3": "He has this good reputation: ",
  "dn13:7.4": "‘That Blessed One is perfected, a fully awakened Buddha, accomplished in knowledge and conduct, holy, knower of the world, supreme guide for those who wish to train, teacher of gods and humans, awakened, blessed.’ ",
  "dn13:7.5": "Come, let’s go to see him and ask him about this matter. ",
  "dn13:7.6": "As he answers, so we’ll remember it.” ",
  "dn13:7.7": "“Yes, worthy sir,” replied Bhāradvāja. ",
  "dn13:8.0": "1. What is the Path and What is Not the Path ",
  "dn13:8.1": "So they went to the Buddha and exchanged greetings with him. ",
  "dn13:8.2": "When the greetings and polite conversation were over, they sat down to one side and Vāseṭṭha told him of their conversation, adding: ",
  "dn13:8.3": "",
  "dn13:8.4": "",
  "dn13:8.5": "",
  "dn13:8.6": "",
  "dn13:8.7": "",
  "dn13:8.8": "“In this matter we have a dispute, a disagreement, a difference of opinion.” ",
  "dn13:9.1": "“So, Vāseṭṭha, it seems that you say that ",
  "dn13:9.2": "the straight path is that explained by Pokkharasāti, ",
  "dn13:9.3": "while Bhāradvāja says that ",
  "dn13:9.4": "the straight path is that explained by Tārukkha. ",
  "dn13:9.5": "But what exactly is your disagreement about?” ",
  "dn13:10.1": "“About what is the path and what is not the path, worthy Gotama. ",
  "dn13:10.2": "Even though brahmins describe different paths—the Adhvaryu brahmins, the Taittirīya brahmins, the Chāndogya brahmins, the Cāndrāyaṇa brahmins, and the Bahvṛca brahmins—all of them still lead someone who practices them to the company of Divinity. ",
  "dn13:10.3": "It’s like a village or town that has many different roads nearby, yet all of them meet at that village. ",
  "dn13:10.4": "In the same way, even though brahmins describe different paths—the Adhvaryu brahmins, the Taittirīya brahmins, the Chāndogya brahmins, the Cāndrāyaṇa brahmins, and the Bahvṛca brahmins—all of them still lead someone who practices them to the company of Divinity.” ",
  "dn13:11.0": "2. Questioning Vāseṭṭha ",
  "dn13:11.1": "“Do you say, ‘they lead someone’, Vāseṭṭha?” ",
  "dn13:11.2": "“I do, worthy Gotama.” ",
  "dn13:11.3": "“Do you say, ‘they lead someone’, Vāseṭṭha?” ",
  "dn13:11.4": "“I do, worthy Gotama.” ",
  "dn13:11.5": "“Do you say, ‘they lead someone’, Vāseṭṭha?” ",
  "dn13:11.6": "“I do, worthy Gotama.” ",
  "dn13:12.1": "“Well, of the brahmins who are proficient in the three Vedas, Vāseṭṭha, is there even a single one who has seen the Divinity with their own eyes?” ",
  "dn13:12.2": "“No, worthy Gotama.” ",
  "dn13:12.3": "“Well, has even a single one of their tutors seen the Divinity with their own eyes?” ",
  "dn13:12.4": "“No, worthy Gotama.” ",
  "dn13:12.5": "“Well, has even a single one of their tutors’ tutors seen the Divinity with their own eyes?” ",
  "dn13:12.6": "“No, worthy Gotama.” ",
  "dn13:12.7": "“Well, has anyone back to the seventh generation of tutors seen the Divinity with their own eyes?” ",
  "dn13:12.8": "“No, worthy Gotama.” ",
  "dn13:13.1": "“Well, what of the ancient seers of the brahmins proficient in the three Vedas, namely Aṭṭhaka, Vāmaka, Vāmadeva, Vessāmitta, Yamadaggi, Aṅgīrasa, Bhāradvāja, Vāseṭṭha, Kassapa, and Bhagu? They were the authors and propagators of the hymns. Their hymnal was sung and propagated and compiled in ancient times; and these days, brahmins continue to sing and chant it, chanting what was chanted and teaching what was taught. ",
  "dn13:13.2": "Did they say: ",
  "dn13:13.3": "‘We know and see where the Divinity is or what way he lies’?” ",
  "dn13:13.4": "“No, worthy Gotama.” ",
  "dn13:14.1": "“So it seems that none of those brahmins have seen the Divinity with their own eyes, ",
  "dn13:14.2": "",
  "dn13:14.3": "",
  "dn13:14.4": "",
  "dn13:14.5": "and not even the ancient seers ",
  "dn13:14.6": "claimed to know where he is. ",
  "dn13:14.7": "Yet the brahmins proficient in the three Vedas say: ",
  "dn13:14.8": "‘We teach the path to the company of that which we neither know nor see. ",
  "dn13:14.9": "This is the only straight path, the direct route that delivers one who practices it to the company of Divinity.’ ",
  "dn13:14.10": "What do you think, Vāseṭṭha? ",
  "dn13:14.11": "This being so, doesn’t their statement turn out to have no demonstrable basis?” ",
  "dn13:14.12": "“Clearly that’s the case, worthy Gotama.” ",
  "dn13:15.1": "“Good, Vāseṭṭha. For it is impossible that they should teach the path to that which they neither know nor see. ",
  "dn13:15.2": "Suppose there was a queue of blind men, each holding the one in front: the first one does not see, the middle one does not see, and the last one does not see. ",
  "dn13:15.3": "In the same way, it seems to me that the brahmins’ statement turns out to be comparable to a queue of blind men: the first one does not see, the middle one does not see, and the last one does not see. ",
  "dn13:15.4": "Their statement turns out to be a joke—mere words, vacuous and hollow. ",
  "dn13:16.1": "What do you think, Vāseṭṭha? ",
  "dn13:16.2": "Do the brahmins proficient in the three Vedas see the sun and moon just as other folk do? And do they pray to them and exalt them, following their course from where they rise to where they set with joined palms held in worship?” ",
  "dn13:16.3": "“Yes, worthy Gotama.” ",
  "dn13:17.1": "“What do you think, Vāseṭṭha? ",
  "dn13:17.2": "Though this is so, are the brahmins proficient in the three Vedas able to teach the path to the company of the sun and moon, saying: ",
  "dn13:17.3": "‘This is the only straight path, the direct route that delivers one who practices it to the company of the sun and moon’?” ",
  "dn13:17.4": "“No, worthy Gotama.” ",
  "dn13:18.1": "“So it seems that even though the brahmins proficient in the three Vedas see the sun and moon, they are not able to teach the path to the company of the sun and moon. ",
  "dn13:18.2": "",
  "dn13:18.3": "But it seems that even though they have not seen the Divinity with their own eyes, ",
  "dn13:18.4": "",
  "dn13:18.5": "",
  "dn13:18.6": "",
  "dn13:18.7": "",
  "dn13:18.8": "",
  "dn13:18.9": "they still claim ",
  "dn13:18.10": "to teach the path to the company of that which they neither know nor see. ",
  "dn13:18.11": "What do you think, Vāseṭṭha? ",
  "dn13:18.12": "This being so, doesn’t their statement turn out to have no demonstrable basis?” ",
  "dn13:18.13": "“Clearly that’s the case, worthy Gotama.” ",
  "dn13:18.14": "“Good, Vāseṭṭha. For it is impossible that they should teach the path to that which they neither know nor see. ",
  "dn13:19.0": "2.1. The Simile of the Finest Lady in the Land ",
  "dn13:19.1": "Suppose a man were to say, ",
  "dn13:19.2": "‘Whoever the finest lady in the land is, it is her that I want, her that I desire!’ ",
  "dn13:19.3": "They’d say to him, ",
  "dn13:19.4": "‘Worthy man, that finest lady in the land who you desire—do you know whether ",
  "dn13:19.5": "she’s an aristocrat, a brahmin, a peasant, or a menial?’ ",
  "dn13:19.6": "Asked this, he’d say, ‘No.’ ",
  "dn13:19.7": "They’d say to him, ",
  "dn13:19.8": "‘Worthy man, that finest lady in the land who you desire—do you know her name or clan? Whether she’s tall or short or medium? Whether her skin is black, brown, or tawny? What village, town, or city she comes from?’ ",
  "dn13:19.9": "Asked this, he’d say, ‘No.’ ",
  "dn13:19.10": "They’d say to him, ",
  "dn13:19.11": "‘Worthy man, do you desire someone who you’ve never even known or seen?’ ",
  "dn13:19.12": "Asked this, he’d say, ‘Yes.’ ",
  "dn13:19.13": "What do you think, Vāseṭṭha? ",
  "dn13:19.14": "This being so, doesn’t that man’s statement turn out to have no demonstrable basis?” ",
  "dn13:19.15": "“Clearly that’s the case, worthy Gotama.” ",
  "dn13:20.1": "“In the same way, ",
  "dn13:20.2": "",
  "dn13:20.3": "",
  "dn13:20.4": "",
  "dn13:20.5": "",
  "dn13:20.6": "",
  "dn13:20.7": "doesn’t the statement of those brahmins turn out to have no demonstrable basis?” ",
  "dn13:20.8": "“Clearly that’s the case, worthy Gotama.” ",
  "dn13:20.9": "“Good, Vāseṭṭha. For it is impossible that they should teach the path to that which they neither know nor see. ",
  "dn13:21.0": "2.2. The Simile of the Ladder ",
  "dn13:21.1": "Suppose a man was to build a ladder at the crossroads for climbing up to a stilt longhouse. ",
  "dn13:21.2": "They’d say to him, ",
  "dn13:21.3": "‘Worthy man, that stilt longhouse that you’re building a ladder for—do you know whether it’s to the north, south, east, or west? Or whether it’s tall or short or medium?’ ",
  "dn13:21.4": "Asked this, he’d say, ‘No.’ ",
  "dn13:22.1": "They’d say to him, ",
  "dn13:22.2": "‘Worthy man, are you building a ladder for a longhouse that you’ve never even known or seen?’ ",
  "dn13:22.3": "Asked this, he’d say, ‘Yes.’ ",
  "dn13:22.4": "What do you think, Vāseṭṭha? ",
  "dn13:22.5": "This being so, doesn’t that man’s statement turn out to have no demonstrable basis?” ",
  "dn13:22.6": "“Clearly that’s the case, worthy Gotama.” ",
  "dn13:22.7": "“In the same way, ",
  "dn13:22.8": "",
  "dn13:22.9": "",
  "dn13:22.10": "",
  "dn13:22.11": "",
  "dn13:22.12": "doesn’t the statement of those brahmins turn out to have no demonstrable basis?” ",
  "dn13:22.13": "“Clearly that’s the case, worthy Gotama.” ",
  "dn13:23.1": "“Good, Vāseṭṭha. For it is impossible that they should teach the path to that which they neither know nor see. ",
  "dn13:24.0": "2.3. The Simile of the River Aciravatī ",
  "dn13:24.1": "Suppose the river Aciravatī was full to the brim so a crow could drink from it. ",
  "dn13:24.2": "Then along comes a person who wants to cross over to the far shore. ",
  "dn13:24.3": "Standing on the near shore, they’d call out to the far shore, ",
  "dn13:24.4": "‘Come here, far shore! Come here, far shore!’ ",
  "dn13:24.5": "What do you think, Vāseṭṭha? ",
  "dn13:24.6": "Would the far shore of the Aciravatī river come over to the near shore because of that man’s call, request, desire, or expectation?” ",
  "dn13:24.7": "“No, worthy Gotama.” ",
  "dn13:25.1": "“In the same way, Vāseṭṭha, the brahmins proficient in the three Vedas proceed having given up those things that make one a true brahmin, and having undertaken those things that make one not a true brahmin. Yet they say: ",
  "dn13:25.2": "‘We call upon Indra! We call upon Soma! We call upon Varuṇa! We call upon Īsāna! We call upon the Progenitor! We call upon the Divinity! We call upon Mahinda! We call upon Yama!’ ",
  "dn13:25.3": "So long as they proceed in this way it’s impossible that they will, when the body breaks up, after death, be reborn in the company of Divinity. ",
  "dn13:26.1": "Suppose the river Aciravatī was full to the brim so a crow could drink from it. ",
  "dn13:26.2": "Then along comes a person who wants to cross over to the far shore. ",
  "dn13:26.3": "But while still on the near shore, their arms are tied tightly behind their back with a strong chain. ",
  "dn13:26.4": "What do you think, Vāseṭṭha? ",
  "dn13:26.5": "Could that person cross over to the far shore?” ",
  "dn13:26.6": "“No, worthy Gotama.” ",
  "dn13:27.1": "“In the same way, the five kinds of sensual stimulation are called ‘chains’ and ‘fetters’ in the training of the Noble One. ",
  "dn13:27.2": "What five? ",
  "dn13:27.3": "Sights known by the eye, which are likable, desirable, agreeable, pleasant, sensual, and arousing. ",
  "dn13:27.4": "Sounds known by the ear … ",
  "dn13:27.5": "Smells known by the nose … ",
  "dn13:27.6": "Tastes known by the tongue … ",
  "dn13:27.7": "Touches known by the body, which are likable, desirable, agreeable, pleasant, sensual, and arousing. ",
  "dn13:27.8": "These are the five kinds of sensual stimulation that are called ‘chains’ and ‘fetters’ in the training of the Noble One. ",
  "dn13:27.9": "The brahmins proficient in the three Vedas enjoy these five kinds of sensual stimulation tied, infatuated, attached, blind to the drawbacks, and not understanding the escape. ",
  "dn13:28.1": "So long as they enjoy them it’s impossible that they will, when the body breaks up, after death, be reborn in the company of Divinity. ",
  "dn13:29.1": "Suppose the river Aciravatī was full to the brim so a crow could drink from it. ",
  "dn13:29.2": "Then along comes a person who wants to cross over to the far shore. ",
  "dn13:29.3": "But they’d lie down wrapped in cloth from head to foot. ",
  "dn13:29.4": "What do you think, Vāseṭṭha? ",
  "dn13:29.5": "Could that person cross over to the far shore?” ",
  "dn13:29.6": "“No, worthy Gotama.” ",
  "dn13:30.1": "“In the same way, the five hindrances are called ‘obstacles’ and ‘hindrances’ and ‘encasings’ and ‘shrouds’ in the training of the Noble One. ",
  "dn13:30.2": "What five? ",
  "dn13:30.3": "The hindrances of sensual desire, ill will, dullness and drowsiness, restlessness and remorse, and doubt. ",
  "dn13:30.4": "These five hindrances are called ‘obstacles’ and ‘hindrances’ and ‘encasings’ and ‘shrouds’ in the training of the Noble One. ",
  "dn13:30.5": "The brahmins proficient in the three Vedas are obstructed, hindered, encased, and shrouded by these five hindrances. ",
  "dn13:30.6": "So long as they are so obstructed it’s impossible that they will, when the body breaks up, after death, be reborn in the company of Divinity. ",
  "dn13:31.0": "3. Converging ",
  "dn13:31.1": "What do you think, Vāseṭṭha? ",
  "dn13:31.2": "Have you heard that the brahmins who are elderly and senior, the tutors of tutors, say whether the Divinity is encumbered with possessions or not?” ",
  "dn13:31.3": "“That he is not, worthy Gotama.” ",
  "dn13:31.4": "“Is his heart full of enmity or not?” ",
  "dn13:31.5": "“It is not.” ",
  "dn13:31.6": "“Is his heart full of ill will or not?” ",
  "dn13:31.7": "“It is not.” ",
  "dn13:31.8": "“Is his heart corrupted or not?” ",
  "dn13:31.9": "“It is not.” ",
  "dn13:31.10": "“Does he wield power or not?” ",
  "dn13:31.11": "“He does.” ",
  "dn13:32.1": "“What do you think, Vāseṭṭha? ",
  "dn13:32.2": "Are the brahmins proficient in the three Vedas encumbered with possessions or not?” ",
  "dn13:32.3": "“They are.” ",
  "dn13:32.4": "“Are their hearts full of enmity or not?” ",
  "dn13:32.5": "“They are.” ",
  "dn13:32.6": "“Are their hearts full of ill will or not?” ",
  "dn13:32.7": "“They are.” ",
  "dn13:32.8": "“Are their hearts corrupted or not?” ",
  "dn13:32.9": "“They are.” ",
  "dn13:32.10": "“Do they wield power or not?” ",
  "dn13:32.11": "“They do not.” ",
  "dn13:33.1": "“So it seems that the brahmins proficient in the three Vedas are encumbered with possessions, but the Divinity is not. ",
  "dn13:33.2": "But would brahmins who are encumbered with possessions come together and converge with the Divinity, who isn’t encumbered with possessions?” ",
  "dn13:33.3": "“No, worthy Gotama.” ",
  "dn13:34.1": "“Good, Vāseṭṭha! It’s impossible that the brahmins who are encumbered with possessions will, when the body breaks up, after death, be reborn in the company of Divinity, who isn’t encumbered with possessions. ",
  "dn13:35.1": "And it seems that the brahmins have enmity, ",
  "dn13:35.2": "ill will, ",
  "dn13:35.3": "corruption, ",
  "dn13:35.4": "and do not wield power, while the Divinity is the opposite in all these things. But would brahmins who are opposite to the Divinity in all things come together and converge with him?” ",
  "dn13:35.5": "“No, worthy Gotama.” ",
  "dn13:36.1": "“Good, Vāseṭṭha! It’s impossible that such brahmins will, when the body breaks up, after death, be reborn in the company of Divinity. ",
  "dn13:36.2": "But here the brahmins proficient in the three Vedas sink down where they have sat, only to drift apart, while imagining they’re crossing over to drier ground. ",
  "dn13:36.3": "That’s why the three Vedas of the brahmins are called a ‘salted land’ and a ‘barren land’ and a ‘disaster’.” ",
  "dn13:37.1": "When he said this, Vāseṭṭha said to the Buddha, ",
  "dn13:37.2": "“I have heard, worthy Gotama, that you know the path to company with Divinity.” ",
  "dn13:37.3": "“What do you think, Vāseṭṭha? ",
  "dn13:37.4": "Is the village of Manasākaṭa nearby?” ",
  "dn13:37.5": "“Yes it is.” ",
  "dn13:37.6": "“What do you think, Vāseṭṭha? ",
  "dn13:37.7": "Suppose a person was born and raised in Manasākaṭa. ",
  "dn13:37.8": "And as soon as they left the town some people asked them for the road to Manasākaṭa. ",
  "dn13:37.9": "Would they be slow or hesitant to answer?” ",
  "dn13:37.10": "“No, worthy Gotama. ",
  "dn13:37.11": "Why is that? ",
  "dn13:37.12": "Because they were born and raised in Manasākaṭa. They’re well acquainted with all the roads to the village.” ",
  "dn13:38.1": "“Still, it’s possible they might be slow or hesitant to answer. But the Realized One is never slow or hesitant when questioned about the realm of divinity or the practice that leads to the realm of divinity. ",
  "dn13:38.2": "I understand the Divinity, the realm of divinity, and the practice that leads to the realm of divinity, practicing in accordance with which one is reborn in the realm of divinity.” ",
  "dn13:39.1": "When he said this, Vāseṭṭha said to the Buddha, ",
  "dn13:39.2": "“I have heard, worthy Gotama, that you teach the path to company with Divinity. ",
  "dn13:39.3": "Please teach us that path and elevate this generation of brahmins.” ",
  "dn13:39.4": "“Well then, Vāseṭṭha, listen and apply your mind well, I will speak.” ",
  "dn13:39.5": "“Yes, worthy sir,” replied Vāseṭṭha. ",
  "dn13:40.0": "4. Teaching the Path to the Divinity ",
  "dn13:40.1": "The Buddha said this: ",
  "dn13:41.1": "“It’s when a Realized One arises in the world, perfected, a fully awakened Buddha, accomplished in knowledge and conduct, holy, knower of the world, supreme guide for those who wish to train, teacher of gods and humans, awakened, blessed. ",
  "dn13:41.2": "He has realized with his own insight this world—with its gods, Māras, and divinities, this population with its ascetics and brahmins, gods and humans—and he makes it known to others. ",
  "dn13:41.3": "He proclaims a teaching that is good in the beginning, good in the middle, and good in the end, meaningful and well-phrased. And he reveals a spiritual practice that’s entirely full and pure. ",
  "dn13:42.1": "A householder hears that teaching, or a householder’s child, or someone reborn in a good family. ",
  "dn13:42.2": "They gain faith in the Realized One ",
  "dn13:42.3": "and reflect: ",
  "dn13:42.4": "‘Life at home is cramped and dirty, life gone forth is wide open. ",
  "dn13:42.5": "It’s not easy for someone living at home to lead the spiritual life utterly full and pure, like a polished shell. ",
  "dn13:42.6": "Why don’t I shave off my hair and beard, dress in ocher robes, and go forth from the lay life to homelessness?’ ",
  "dn13:42.7": "After some time they give up a large or small fortune, and a large or small family circle. They shave off hair and beard, dress in ocher robes, and go forth from the lay life to homelessness. ",
  "dn13:43.1": "Once they’ve gone forth, they live restrained in the monastic code, conducting themselves well and resorting for alms in suitable places. Seeing danger in the slightest fault, they keep the rules they’ve undertaken. They act skillfully by body and speech. They’re purified in livelihood and accomplished in ethical conduct. They guard the sense doors, have mindfulness and situational awareness, and are content. ",
  "dn13:44.0.1": "4.1. Ethics ",
  "dn13:44.0.2": "4.1.1. The Shorter Section on Ethics ",
  "dn13:44.1": "And how, Vāseṭṭha, is a mendicant accomplished in ethics? ",
  "dn13:44.2": "It’s when a mendicant gives up killing living creatures, renouncing the rod and the sword. They’re scrupulous and kind, living full of sympathy for all living beings. ",
  "dn13:44.3": "This pertains to their ethics. ",
  "dn13:44.4": "They give up stealing. They take only what’s given, and expect only what’s given. They keep themselves clean by not thieving. ",
  "dn13:44.5": "This pertains to their ethics. ",
  "dn13:44.6": "They give up unchastity. They are chaste, set apart, avoiding the vulgar act of sex. ",
  "dn13:44.7": "This pertains to their ethics. ",
  "dn13:45.1": "They give up lying. They speak the truth and stick to the truth. They’re honest and dependable, and don’t trick the world with their words. ",
  "dn13:45.2": "This pertains to their ethics. ",
  "dn13:45.3": "They give up divisive speech. They don’t repeat in one place what they heard in another so as to divide people against each other. Instead, they reconcile those who are divided, supporting unity, delighting in harmony, loving harmony, speaking words that promote harmony. ",
  "dn13:45.4": "This pertains to their ethics. ",
  "dn13:45.5": "They give up harsh speech. They speak in a way that’s mellow, pleasing to the ear, lovely, going to the heart, polite, likable and agreeable to the people. ",
  "dn13:45.6": "This pertains to their ethics. ",
  "dn13:45.7": "They give up talking nonsense. Their words are timely, true, and meaningful, in line with the teaching and training. They say things at the right time which are valuable, reasonable, succinct, and beneficial. ",
  "dn13:45.8": "This pertains to their ethics. ",
  "dn13:46.1": "They refrain from injuring plants and seeds. ",
  "dn13:46.2": "They eat in one part of the day, abstaining from eating at night and food at the wrong time. ",
  "dn13:46.3": "They refrain from seeing shows of dancing, singing, and music . ",
  "dn13:46.4": "They refrain from beautifying and adorning themselves with garlands, fragrance, and makeup. ",
  "dn13:46.5": "They refrain from high and luxurious beds. ",
  "dn13:46.6": "They refrain from receiving gold and currency, ",
  "dn13:46.7": "raw grains, ",
  "dn13:46.8": "raw meat, ",
  "dn13:46.9": "women and girls, ",
  "dn13:46.10": "male and female bondservants, ",
  "dn13:46.11": "goats and sheep, ",
  "dn13:46.12": "chickens and pigs, ",
  "dn13:46.13": "elephants, cows, horses, and mares, ",
  "dn13:46.14": "and fields and land. ",
  "dn13:46.15": "They refrain from running errands and messages; ",
  "dn13:46.16": "buying and selling; ",
  "dn13:46.17": "falsifying weights, metals, or measures; ",
  "dn13:46.18": "bribery, fraud, cheating, and duplicity; ",
  "dn13:46.19": "mutilation, murder, abduction, banditry, plunder, and violence. ",
  "dn13:46.20": "This pertains to their ethics. ",
  "dn13:46.21": "The shorter section on ethics is finished. ",
  "dn13:47.0": "4.1.2. The Middle Section on Ethics ",
  "dn13:47.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in injuring plants and seeds. ",
  "dn13:47.2": "These include plants propagated from roots, stems, cuttings, or joints; and those from regular seeds as the fifth. They refrain from such injury to plants and seeds. ",
  "dn13:47.3": "This pertains to their ethics. ",
  "dn13:48.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in storing up goods for their own use. ",
  "dn13:48.2": "This includes such things as food, drink, clothes, vehicles, bedding, fragrance, and things of the flesh. ",
  "dn13:48.3": "They refrain from storing up such goods. ",
  "dn13:48.4": "This pertains to their ethics. ",
  "dn13:49.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in seeing shows. ",
  "dn13:49.2": "This includes such things as dancing, singing, music, performances, and storytelling; clapping, gongs, and kettledrums; beauty pageants; pole-acrobatics and bone-washing displays of the corpse-workers; battles of elephants, horses, buffaloes, bulls, goats, rams, chickens, and quails; staff-fights, boxing, and wrestling; combat, roll calls of the armed forces, battle-formations, and regimental reviews. ",
  "dn13:49.3": "They refrain from such shows. ",
  "dn13:49.4": "This pertains to their ethics. ",
  "dn13:50.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in gambling that causes negligence. ",
  "dn13:50.2": "This includes such things as checkers with eight or ten rows, checkers in the air, hopscotch, spillikins, board-games, tip-cat, drawing straws, dice, leaf-flutes, toy plows, somersaults, pinwheels, toy measures, toy carts, toy bows, guessing words from syllables, guessing another’s thoughts, and imitating musical instruments. ",
  "dn13:50.3": "They refrain from such gambling. ",
  "dn13:50.4": "This pertains to their ethics. ",
  "dn13:51.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still make use of high and luxurious bedding. ",
  "dn13:51.2": "This includes such things as sofas, couches, woolen covers—shag-piled, colorful, white, embroidered with flowers, quilted, embroidered with animals, double-or single-fringed—and silk covers studded with gems, as well as silken sheets, woven carpets, rugs for elephants, horses, or chariots, antelope hide rugs, and spreads of fine deer hide, with a canopy above and red cushions at both ends. ",
  "dn13:51.3": "They refrain from such bedding. ",
  "dn13:51.4": "This pertains to their ethics. ",
  "dn13:52.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in beautifying and adorning themselves with garlands, fragrance, and makeup. ",
  "dn13:52.2": "This includes such things as applying beauty products by anointing, massaging, bathing, and rubbing; mirrors, ointments, garlands, fragrances, and makeup; face-powder, foundation, bracelets, headbands, fancy walking-sticks or containers, rapiers, parasols, fancy sandals, turbans, jewelry, chowries, and long-fringed white robes. ",
  "dn13:52.3": "They refrain from such beautification and adornment. ",
  "dn13:52.4": "This pertains to their ethics. ",
  "dn13:53.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in low talk. ",
  "dn13:53.2": "This includes such topics as talk about kings, bandits, and ministers; talk about armies, threats, and wars; talk about food, drink, clothes, and beds; talk about garlands and fragrances; talk about family, vehicles, villages, towns, cities, and countries; talk about women and heroes; street talk and well talk; talk about the departed; motley talk; tales of land and sea; and talk about being reborn in this or that place. ",
  "dn13:53.3": "They refrain from such low talk. ",
  "dn13:53.4": "This pertains to their ethics. ",
  "dn13:54.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in arguments. ",
  "dn13:54.2": "They say such things as: ‘You don’t understand this teaching and training. I understand this teaching and training. What, you understand this teaching and training? You’re practicing wrong. I’m practicing right. I stay on topic, you don’t. You said last what you should have said first. You said first what you should have said last. What you’ve thought so much about has been disproved. Your doctrine is refuted. Go on, save your doctrine! You’re trapped; get yourself out of this—if you can!’ ",
  "dn13:54.3": "They refrain from such argumentative talk. ",
  "dn13:54.4": "This pertains to their ethics. ",
  "dn13:55.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in running errands and messages. ",
  "dn13:55.2": "This includes running errands for rulers, ministers, aristocrats, brahmins, householders, or princes who say: ‘Go here, go there. Take this, bring that from there.’ ",
  "dn13:55.3": "They refrain from such errands. ",
  "dn13:55.4": "This pertains to their ethics. ",
  "dn13:56.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in deceit, flattery, hinting, and belittling, and using material things to chase after other material things. They refrain from such deceit and flattery. ",
  "dn13:56.2": "This pertains to their ethics. ",
  "dn13:56.3": "The middle section on ethics is finished. ",
  "dn13:57.0": "4.1.3. The Long Section on Ethics ",
  "dn13:57.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn13:57.2": "This includes such fields as limb-reading, omenology, divining celestial portents, interpreting dreams, divining bodily marks, divining holes in cloth gnawed by mice, fire offerings, ladle offerings, offerings of husks, rice powder, rice, ghee, or oil; offerings from the mouth, blood sacrifices, palmistry; geomancy for building sites, fields, and cemeteries; exorcisms, earth magic, snake charming, poisons; the lore of the scorpion, the rat, the bird, and the crow; prophesying lifespan, chanting for protection, and divining omens from wild animals. ",
  "dn13:57.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn13:57.4": "This pertains to their ethics. ",
  "dn13:58.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn13:58.2": "This includes reading the marks of gems, cloth, clubs, swords, spears, arrows, bows, weapons, women, men, boys, girls, male and female bondservants, elephants, horses, buffaloes, bulls, cows, goats, rams, chickens, quails, monitor lizards, rabbits, tortoises, or deer. ",
  "dn13:58.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn13:58.4": "This pertains to their ethics. ",
  "dn13:59.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn13:59.2": "This includes making predictions that the king will march forth or march back; or that our king will attack and the enemy king will retreat, or vice versa; or that our king will triumph and the enemy king will be defeated, or vice versa; and so there will be victory for one and defeat for the other. ",
  "dn13:59.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn13:59.4": "This pertains to their ethics. ",
  "dn13:60.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn13:60.2": "This includes making predictions that there will be an eclipse of the moon, or sun, or stars; that the sun, moon, and stars will be in conjunction or in opposition; that there will be a meteor shower, a fiery sky, an earthquake, or thunder in the heavens; that there will be a rising, a setting, a darkening, a brightening of the moon, sun, and stars. And it also includes making predictions about the results of all such phenomena. ",
  "dn13:60.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn13:60.4": "This pertains to their ethics. ",
  "dn13:61.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn13:61.2": "This includes predicting whether there will be plenty of rain or drought; plenty to eat or famine; an abundant harvest or a bad harvest; security or peril; sickness or health. It also includes such occupations as arithmetic, accounting, calculating, poetry, and cosmology. ",
  "dn13:61.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn13:61.4": "This pertains to their ethics. ",
  "dn13:62.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn13:62.2": "This includes making arrangements for giving and taking in marriage; for engagement and divorce; and for scattering rice inwards or outwards at the wedding ceremony. It also includes casting spells for good or bad luck, treating impacted fetuses, binding the tongue, or locking the jaws; charms for the hands and ears; questioning a mirror, a girl, or a god as an oracle; worshiping the sun, worshiping the Great One, breathing fire, and invoking Siri, the goddess of luck. ",
  "dn13:62.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn13:62.4": "This pertains to their ethics. ",
  "dn13:63.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn13:63.2": "This includes rites for propitiation, for granting wishes, for ghosts, for the earth, for rain, for property settlement, and for preparing and consecrating house sites, and rites involving rinsing and bathing, and oblations. It also includes administering emetics, purgatives, expectorants, and phlegmagogues; administering ear-oils, eye restoratives, nasal medicine, ointments, and counter-ointments; surgery with needle and scalpel, treating children, prescribing root medicines, and binding on herbs. ",
  "dn13:63.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn13:63.4": "This pertains to their ethics. ",
  "dn13:64.1": "A mendicant thus accomplished in ethics sees no danger in any quarter in regards to their ethical restraint. ",
  "dn13:64.2": "It’s like a king who has defeated his enemies. He sees no danger from his foes in any quarter. ",
  "dn13:64.3": "In the same way, a mendicant thus accomplished in ethics sees no danger in any quarter in regards to their ethical restraint. ",
  "dn13:64.4": "When they have this entire spectrum of noble ethics, they experience a blameless happiness inside themselves. ",
  "dn13:64.5": "That’s how a mendicant is accomplished in ethics. ",
  "dn13:64.6": "The longer section on ethics is finished. ",
  "dn13:65.0.1": "4.2. Immersion ",
  "dn13:65.0.2": "4.2.1. Sense Restraint ",
  "dn13:65.1": "And how does a mendicant guard the sense doors? ",
  "dn13:65.2": "When a mendicant sees a sight with their eyes, they don’t get caught up in the features and details. ",
  "dn13:65.3": "If the faculty of sight were left unrestrained, bad unskillful qualities of covetousness and displeasure would become overwhelming. For this reason, they practice restraint, protecting the faculty of sight, and achieving its restraint. ",
  "dn13:65.4": "When they hear a sound with their ears … ",
  "dn13:65.5": "When they smell an odor with their nose … ",
  "dn13:65.6": "When they taste a flavor with their tongue … ",
  "dn13:65.7": "When they feel a touch with their body … ",
  "dn13:65.8": "When they know an idea with their mind, they don’t get caught up in the features and details. ",
  "dn13:65.9": "If the faculty of mind were left unrestrained, bad unskillful qualities of covetousness and displeasure would become overwhelming. For this reason, they practice restraint, protecting the faculty of mind, and achieving its restraint. ",
  "dn13:65.10": "When they have this noble sense restraint, they experience an unsullied bliss inside themselves. ",
  "dn13:65.11": "That’s how a mendicant guards the sense doors. ",
  "dn13:66.0": "4.2.2. Mindfulness and Situational Awareness ",
  "dn13:66.1": "And how does a mendicant have mindfulness and situational awareness? ",
  "dn13:66.2": "It’s when a mendicant acts with situational awareness when going out and coming back; when looking ahead and aside; when bending and extending the limbs; when bearing the outer robe, bowl and robes; when eating, drinking, chewing, and tasting; when urinating and defecating; when walking, standing, sitting, sleeping, waking, speaking, and keeping silent. ",
  "dn13:66.3": "That’s how a mendicant has mindfulness and situational awareness. ",
  "dn13:67.0": "4.2.3. Contentment ",
  "dn13:67.1": "And how is a mendicant content? ",
  "dn13:67.2": "It’s when a mendicant is content with robes to look after the body and almsfood to look after the belly. Wherever they go, they set out taking only these things. ",
  "dn13:67.3": "They’re like a bird: wherever it flies, wings are its only burden. ",
  "dn13:67.4": "In the same way, a mendicant is content with robes to look after the body and almsfood to look after the belly. Wherever they go, they set out taking only these things. ",
  "dn13:67.5": "That’s how a mendicant is content. ",
  "dn13:68.0": "4.2.4. Giving Up the Hindrances ",
  "dn13:68.1": "When they have this entire spectrum of noble ethics, this noble sense restraint, this noble mindfulness and situational awareness, and this noble contentment, ",
  "dn13:68.2": "they frequent a secluded lodging—a wilderness, the root of a tree, a hill, a ravine, a mountain cave, a charnel ground, a forest, the open air, a heap of straw. ",
  "dn13:68.3": "After the meal, they return from almsround, sit down cross-legged, set their body straight, and establish mindfulness in their presence. ",
  "dn13:69.1": "Giving up covetousness for the world, they meditate with a heart rid of covetousness, cleansing the mind of covetousness. ",
  "dn13:69.2": "Giving up ill will and malevolence, they meditate with a mind rid of ill will, full of sympathy for all living beings, cleansing the mind of ill will. ",
  "dn13:69.3": "Giving up dullness and drowsiness, they meditate with a mind rid of dullness and drowsiness, perceiving light, mindful and aware, cleansing the mind of dullness and drowsiness. ",
  "dn13:69.4": "Giving up restlessness and remorse, they meditate without restlessness, their mind peaceful inside, cleansing the mind of restlessness and remorse. ",
  "dn13:69.5": "Giving up doubt, they meditate having gone beyond doubt, not undecided about skillful qualities, cleansing the mind of doubt. ",
  "dn13:70.1": "Suppose a man who has gotten into debt were to apply himself to work, ",
  "dn13:70.2": "and his efforts proved successful. ",
  "dn13:70.3": "He would pay off the original loan and have enough left over to support his partner. ",
  "dn13:70.4": "Thinking about this, ",
  "dn13:70.5": "",
  "dn13:70.6": "",
  "dn13:70.7": "",
  "dn13:70.8": "he’d be filled with joy and happiness. ",
  "dn13:71.1": "Suppose there was a person who was sick, suffering, gravely ill. They’d lose their appetite and get physically weak. ",
  "dn13:71.2": "But after some time they’d recover from that illness, and regain their appetite and their strength. ",
  "dn13:71.3": "Thinking about this, ",
  "dn13:71.4": "",
  "dn13:71.5": "",
  "dn13:71.6": "",
  "dn13:71.7": "",
  "dn13:71.8": "they’d be filled with joy and happiness. ",
  "dn13:72.1": "Suppose a person was imprisoned in a jail. ",
  "dn13:72.2": "But after some time they were released from jail, safe and sound, with no loss of wealth. ",
  "dn13:72.3": "Thinking about this, ",
  "dn13:72.4": "",
  "dn13:72.5": "",
  "dn13:72.6": "they’d be filled with joy and happiness. ",
  "dn13:73.1": "Suppose a person was a bondservant. They would not be their own master, but indentured to another, unable to go where they wish. ",
  "dn13:73.2": "But after some time they’d be freed from servitude. They would be their own master, not indentured to another, an emancipated individual able to go where they wish. ",
  "dn13:73.3": "Thinking about this, ",
  "dn13:73.4": "",
  "dn13:73.5": "",
  "dn13:73.6": "they’d be filled with joy and happiness. ",
  "dn13:74.1": "Suppose there was a person with wealth and property who was traveling along a desert road, which was perilous, with nothing to eat. ",
  "dn13:74.2": "But after some time they crossed over the desert safely, arriving within a village, a sanctuary free of peril. ",
  "dn13:74.3": "Thinking about this, ",
  "dn13:74.4": "",
  "dn13:74.5": "",
  "dn13:74.6": "they’d be filled with joy and happiness. ",
  "dn13:75.1": "In the same way, as long as these five hindrances are not given up inside themselves, a mendicant regards them thus as a debt, a disease, a prison, slavery, and a desert crossing. ",
  "dn13:75.2": "But when these five hindrances are given up inside themselves, a mendicant regards this as freedom from debt, good health, release from prison, emancipation, and a place of sanctuary at last. ",
  "dn13:75.3": "",
  "dn13:75.4": "Seeing that the hindrances have been given up in them, joy springs up. Being joyful, rapture springs up. When the mind is full of rapture, the body becomes tranquil. When the body is tranquil, they feel bliss. And when blissful, the mind becomes immersed. ",
  "dn13:76.1": "They meditate spreading a heart full of love to one direction, and to the second, and to the third, and to the fourth. In the same way above, below, across, everywhere, all around, they spread a heart full of love to the whole world—abundant, expansive, limitless, free of enmity and ill will. ",
  "dn13:77.1": "Suppose there was a powerful horn blower. They’d easily make themselves heard in the four quarters. ",
  "dn13:77.2": "In the same way, when the heart’s release by love has been developed like this, any limited deeds they’ve done don’t remain or persist there. ",
  "dn13:77.3": "This is a path to company with Divinity. ",
  "dn13:78.1": "Furthermore, a mendicant meditates spreading a heart full of compassion … ",
  "dn13:78.2": "They meditate spreading a heart full of rejoicing … ",
  "dn13:78.3": "They meditate spreading a heart full of equanimity to one direction, and to the second, and to the third, and to the fourth. In the same way above, below, across, everywhere, all around, they spread a heart full of equanimity to the whole world—abundant, expansive, limitless, free of enmity and ill will. ",
  "dn13:79.1": "Suppose there was a powerful horn blower. They’d easily make themselves heard in the four quarters. ",
  "dn13:79.2": "In the same way, when the heart’s release by equanimity has been developed and cultivated like this, any limited deeds they’ve done don’t remain or persist there. ",
  "dn13:79.3": "This too is a path to company with Divinity. ",
  "dn13:80.1": "What do you think, Vāseṭṭha? ",
  "dn13:80.2": "When a mendicant meditates like this, are they encumbered with possessions or not?” ",
  "dn13:80.3": "“They are not.” ",
  "dn13:80.4": "“Is their heart full of enmity or not?” ",
  "dn13:80.5": "“It is not.” ",
  "dn13:80.6": "“Is their heart full of ill will or not?” ",
  "dn13:80.7": "“It is not.” ",
  "dn13:80.8": "“Is their heart corrupted or not?” ",
  "dn13:80.9": "“It is not.” ",
  "dn13:80.10": "“Do they wield power or not?” ",
  "dn13:80.11": "“They do.” ",
  "dn13:81.1": "“So it seems that that mendicant is not encumbered with possessions, and neither is the Divinity. ",
  "dn13:81.2": "Would a mendicant who is not encumbered with possessions come together and converge with the Divinity, who isn’t encumbered with possessions?” ",
  "dn13:81.3": "“Yes, worthy Gotama.” ",
  "dn13:81.4": "“Good, Vāseṭṭha! It’s quite possible that a mendicant who is not encumbered with possessions will, when the body breaks up, after death, be reborn in the company of Divinity, who isn’t encumbered with possessions. ",
  "dn13:81.5": "And it seems that that mendicant has no enmity, ",
  "dn13:81.6": "ill will, ",
  "dn13:81.7": "corruption, ",
  "dn13:81.8": "and does wield power, while the Divinity is the same in all these things. Would a mendicant who is the same as the Divinity in all things come together and converge with him?” ",
  "dn13:81.9": "“Yes, worthy Gotama.” ",
  "dn13:81.10": "“Good, Vāseṭṭha! It’s quite possible that that mendicant will, when the body breaks up, after death, be reborn in the company of Divinity.” ",
  "dn13:82.1": "When he had spoken, Vāseṭṭha and Bhāradvāja said to him, ",
  "dn13:82.2": "“Excellent, worthy Gotama! Excellent! ",
  "dn13:82.3": "As if he were righting the overturned, or revealing the hidden, or pointing out the path to the lost, or lighting a lamp in the dark so people with clear eyes can see what’s there, worthy Gotama has made the teaching clear in many ways. ",
  "dn13:82.4": "We go for refuge to the worthy Gotama, to the teaching, and to the mendicant Saṅgha. ",
  "dn13:82.5": "From this day forth, may the worthy Gotama remember us as lay followers who have gone for refuge for life.” ",
  "dn13:82.6": "",
  "dn13:82.7": "",
  "dn13:83.1": "",
  "dn13:83.2": "",
  "dn13:83.3": "",
  "dn13:83.4": ""
}