{
  "dn4:0.1": "Dīgha Nikāya 4 ",
  "dn4:0.2": "Soṇadaṇḍasutta ",
  "dn4:1.0": "1. Campeyyakabrāhmaṇagahapatikā ",
  "dn4:1.1": "Evaṁ me sutaṁ—",
  "dn4:1.2": "ekaṁ samayaṁ bhagavā aṅgesu cārikaṁ caramāno mahatā bhikkhusaṅghena saddhiṁ pañcamattehi bhikkhusatehi yena campā tadavasari. ",
  "dn4:1.3": "Tatra sudaṁ bhagavā campāyaṁ viharati gaggarāya pokkharaṇiyā tīre. ",
  "dn4:1.4": "Tena kho pana samayena soṇadaṇḍo brāhmaṇo campaṁ ajjhāvasati sattussadaṁ satiṇakaṭṭhodakaṁ sadhaññaṁ rājabhoggaṁ raññā māgadhena seniyena bimbisārena dinnaṁ rājadāyaṁ brahmadeyyaṁ. ",
  "dn4:2.1": "Assosuṁ kho campeyyakā brāhmaṇagahapatikā: ",
  "dn4:2.2": "“samaṇo khalu bho gotamo sakyaputto sakyakulā pabbajito aṅgesu cārikaṁ caramāno mahatā bhikkhusaṅghena saddhiṁ pañcamattehi bhikkhusatehi campaṁ anuppatto campāyaṁ viharati gaggarāya pokkharaṇiyā tīre. ",
  "dn4:2.3": "Taṁ kho pana bhavantaṁ gotamaṁ evaṁ kalyāṇo kittisaddo abbhuggato: ",
  "dn4:2.4": "‘itipi so bhagavā arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā’. ",
  "dn4:2.5": "So imaṁ lokaṁ sadevakaṁ samārakaṁ sabrahmakaṁ sassamaṇabrāhmaṇiṁ pajaṁ sadevamanussaṁ sayaṁ abhiññā sacchikatvā pavedeti. ",
  "dn4:2.6": "So dhammaṁ deseti ādikalyāṇaṁ majjhekalyāṇaṁ pariyosānakalyāṇaṁ sātthaṁ sabyañjanaṁ kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ pakāseti. ",
  "dn4:2.7": "Sādhu kho pana tathārūpānaṁ arahataṁ dassanaṁ hotī”ti. ",
  "dn4:2.8": "Atha kho campeyyakā brāhmaṇagahapatikā campāya nikkhamitvā saṅghasaṅghī gaṇībhūtā yena gaggarā pokkharaṇī tenupasaṅkamanti. ",
  "dn4:3.1": "Tena kho pana samayena soṇadaṇḍo brāhmaṇo uparipāsāde divāseyyaṁ upagato hoti. ",
  "dn4:3.2": "Addasā kho soṇadaṇḍo brāhmaṇo campeyyake brāhmaṇagahapatike campāya nikkhamitvā saṅghasaṅghī gaṇībhūte yena gaggarā pokkharaṇī tenupasaṅkamante. ",
  "dn4:3.3": "Disvā khattaṁ āmantesi: ",
  "dn4:3.4": "“kiṁ nu kho, bho khatte, campeyyakā brāhmaṇagahapatikā campāya nikkhamitvā saṅghasaṅghī gaṇībhūtā yena gaggarā pokkharaṇī tenupasaṅkamantī”ti? ",
  "dn4:3.5": "“Atthi kho, bho, samaṇo gotamo sakyaputto sakyakulā pabbajito aṅgesu cārikaṁ caramāno mahatā bhikkhusaṅghena saddhiṁ pañcamattehi bhikkhusatehi campaṁ anuppatto campāyaṁ viharati gaggarāya pokkharaṇiyā tīre. ",
  "dn4:3.6": "Taṁ kho pana bhavantaṁ gotamaṁ evaṁ kalyāṇo kittisaddo abbhuggato: ",
  "dn4:3.7": "‘itipi so bhagavā arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā’ti. ",
  "dn4:3.8": "Tamete bhavantaṁ gotamaṁ dassanāya upasaṅkamantī”ti. ",
  "dn4:3.9": "“Tena hi, bho khatte, yena campeyyakā brāhmaṇagahapatikā tenupasaṅkama, upasaṅkamitvā campeyyake brāhmaṇagahapatike evaṁ vadehi: ",
  "dn4:3.10": "‘soṇadaṇḍo, bho, brāhmaṇo evamāha—",
  "dn4:3.11": "āgamentu kira bhavanto, soṇadaṇḍopi brāhmaṇo samaṇaṁ gotamaṁ dassanāya upasaṅkamissatī’”ti. ",
  "dn4:3.12": "“Evaṁ, bho”ti kho so khattā soṇadaṇḍassa brāhmaṇassa paṭissutvā yena campeyyakā brāhmaṇagahapatikā tenupasaṅkami; upasaṅkamitvā campeyyake brāhmaṇagahapatike etadavoca: ",
  "dn4:3.13": "“soṇadaṇḍo bho brāhmaṇo evamāha: ",
  "dn4:3.14": "‘āgamentu kira bhavanto, soṇadaṇḍopi brāhmaṇo samaṇaṁ gotamaṁ dassanāya upasaṅkamissatī’”ti. ",
  "dn4:4.0": "2. Soṇadaṇḍaguṇakathā ",
  "dn4:4.1": "Tena kho pana samayena nānāverajjakānaṁ brāhmaṇānaṁ pañcamattāni brāhmaṇasatāni campāyaṁ paṭivasanti kenacideva karaṇīyena. ",
  "dn4:4.2": "Assosuṁ kho te brāhmaṇā: ",
  "dn4:4.3": "“soṇadaṇḍo kira brāhmaṇo samaṇaṁ gotamaṁ dassanāya upasaṅkamissatī”ti. ",
  "dn4:4.4": "Atha kho te brāhmaṇā yena soṇadaṇḍo brāhmaṇo tenupasaṅkamiṁsu; upasaṅkamitvā soṇadaṇḍaṁ brāhmaṇaṁ etadavocuṁ: ",
  "dn4:4.5": "“saccaṁ kira bhavaṁ soṇadaṇḍo samaṇaṁ gotamaṁ dassanāya upasaṅkamissatī”ti? ",
  "dn4:4.6": "“Evaṁ kho me, bho, hoti: ",
  "dn4:4.7": "‘ahampi samaṇaṁ gotamaṁ dassanāya upasaṅkamissāmī’”ti. ",
  "dn4:5.1": "“Mā bhavaṁ soṇadaṇḍo samaṇaṁ gotamaṁ dassanāya upasaṅkami. ",
  "dn4:5.2": "Na arahati bhavaṁ soṇadaṇḍo samaṇaṁ gotamaṁ dassanāya upasaṅkamituṁ. ",
  "dn4:5.3": "Sace bhavaṁ soṇadaṇḍo samaṇaṁ gotamaṁ dassanāya upasaṅkamissati, bhoto soṇadaṇḍassa yaso hāyissati, samaṇassa gotamassa yaso abhivaḍḍhissati. ",
  "dn4:5.4": "Yampi bhoto soṇadaṇḍassa yaso hāyissati, samaṇassa gotamassa yaso abhivaḍḍhissati, imināpaṅgena na arahati bhavaṁ soṇadaṇḍo samaṇaṁ gotamaṁ dassanāya upasaṅkamituṁ; ",
  "dn4:5.5": "samaṇo tveva gotamo arahati bhavantaṁ soṇadaṇḍaṁ dassanāya upasaṅkamituṁ. ",
  "dn4:5.6": "Bhavañhi soṇadaṇḍo ubhato sujāto mātito ca pitito ca, saṁsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena. ",
  "dn4:5.7": "Yampi bhavaṁ soṇadaṇḍo ubhato sujāto mātito ca pitito ca, saṁsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena, imināpaṅgena na arahati bhavaṁ soṇadaṇḍo samaṇaṁ gotamaṁ dassanāya upasaṅkamituṁ; ",
  "dn4:5.8": "samaṇo tveva gotamo arahati bhavantaṁ soṇadaṇḍaṁ dassanāya upasaṅkamituṁ. ",
  "dn4:5.9": "Bhavañhi soṇadaṇḍo aḍḍho mahaddhano mahābhogo …pe… ",
  "dn4:5.10": "Bhavañhi soṇadaṇḍo ajjhāyako mantadharo tiṇṇaṁ vedānaṁ pāragū sanighaṇḍukeṭubhānaṁ sākkharappabhedānaṁ itihāsapañcamānaṁ padako veyyākaraṇo, lokāyatamahāpurisalakkhaṇesu anavayo …pe… ",
  "dn4:5.11": "Bhavañhi soṇadaṇḍo abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato brahmavaṇṇī brahmavacchasī akhuddāvakāso dassanāya …pe… ",
  "dn4:5.12": "Bhavañhi soṇadaṇḍo sīlavā vuddhasīlī vuddhasīlena samannāgato …pe… ",
  "dn4:5.13": "Bhavañhi soṇadaṇḍo kalyāṇavāco kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā …pe… ",
  "dn4:5.14": "Bhavañhi soṇadaṇḍo bahūnaṁ ācariyapācariyo tīṇi māṇavakasatāni mante vāceti. Bahū kho pana nānādisā nānājanapadā māṇavakā āgacchanti bhoto soṇadaṇḍassa santike mantatthikā mante adhiyitukāmā …pe… ",
  "dn4:5.15": "Bhavañhi soṇadaṇḍo jiṇṇo vuddho mahallako addhagato vayoanuppatto; ",
  "dn4:5.16": "samaṇo gotamo taruṇo ceva taruṇapabbajito ca …pe… ",
  "dn4:5.17": "Bhavañhi soṇadaṇḍo rañño māgadhassa seniyassa bimbisārassa sakkato garukato mānito pūjito apacito …pe… ",
  "dn4:5.18": "Bhavañhi soṇadaṇḍo brāhmaṇassa pokkharasātissa sakkato garukato mānito pūjito apacito …pe… ",
  "dn4:5.19": "Bhavañhi soṇadaṇḍo campaṁ ajjhāvasati sattussadaṁ satiṇakaṭṭhodakaṁ sadhaññaṁ rājabhoggaṁ, raññā māgadhena seniyena bimbisārena dinnaṁ, rājadāyaṁ brahmadeyyaṁ. ",
  "dn4:5.20": "Yampi bhavaṁ soṇadaṇḍo campaṁ ajjhāvasati sattussadaṁ satiṇakaṭṭhodakaṁ sadhaññaṁ rājabhoggaṁ, raññā māgadhena seniyena bimbisārena dinnaṁ, rājadāyaṁ brahmadeyyaṁ. ",
  "dn4:5.21": "Imināpaṅgena na arahati bhavaṁ soṇadaṇḍo samaṇaṁ gotamaṁ dassanāya upasaṅkamituṁ; ",
  "dn4:5.22": "samaṇo tveva gotamo arahati bhavantaṁ soṇadaṇḍaṁ dassanāya upasaṅkamitun”ti. ",
  "dn4:6.0": "3. Buddhaguṇakathā ",
  "dn4:6.1": "Evaṁ vutte, soṇadaṇḍo brāhmaṇo te brāhmaṇe etadavoca: ",
  "dn4:6.2": "“Tena hi, bho, mamapi suṇātha, yathā mayameva arahāma taṁ bhavantaṁ gotamaṁ dassanāya upasaṅkamituṁ; ",
  "dn4:6.3": "na tveva arahati so bhavaṁ gotamo amhākaṁ dassanāya upasaṅkamituṁ. ",
  "dn4:6.4": "Samaṇo khalu, bho, gotamo ubhato sujāto mātito ca pitito ca, saṁsuddhagahaṇiko yāva sattamā pitāmahayugā, akkhitto anupakkuṭṭho jātivādena. ",
  "dn4:6.5": "Yampi, bho, samaṇo gotamo ubhato sujāto mātito ca pitito ca saṁsuddhagahaṇiko yāva sattamā pitāmahayugā, akkhitto anupakkuṭṭho jātivādena, imināpaṅgena na arahati so bhavaṁ gotamo amhākaṁ dassanāya upasaṅkamituṁ; ",
  "dn4:6.6": "atha kho mayameva arahāma taṁ bhavantaṁ gotamaṁ dassanāya upasaṅkamituṁ. ",
  "dn4:6.7": "Samaṇo khalu, bho, gotamo mahantaṁ ñātisaṅghaṁ ohāya pabbajito …pe… ",
  "dn4:6.8": "Samaṇo khalu, bho, gotamo pahūtaṁ hiraññasuvaṇṇaṁ ohāya pabbajito bhūmigatañca vehāsaṭṭhaṁ ca …pe… ",
  "dn4:6.9": "Samaṇo khalu, bho, gotamo daharova samāno yuvā susukāḷakeso bhadrena yobbanena samannāgato paṭhamena vayasā agārasmā anagāriyaṁ pabbajito …pe… ",
  "dn4:6.10": "Samaṇo khalu, bho, gotamo akāmakānaṁ mātāpitūnaṁ assumukhānaṁ rudantānaṁ kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajito …pe… ",
  "dn4:6.11": "Samaṇo khalu, bho, gotamo abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato, brahmavaṇṇī, brahmavacchasī, akhuddāvakāso dassanāya …pe… ",
  "dn4:6.12": "Samaṇo khalu, bho, gotamo sīlavā ariyasīlī kusalasīlī kusalasīlena samannāgato …pe… ",
  "dn4:6.13": "Samaṇo khalu, bho, gotamo kalyāṇavāco kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā …pe… ",
  "dn4:6.14": "Samaṇo khalu, bho, gotamo bahūnaṁ ācariyapācariyo …pe… ",
  "dn4:6.15": "Samaṇo khalu, bho, gotamo khīṇakāmarāgo vigatacāpallo …pe… ",
  "dn4:6.16": "Samaṇo khalu, bho, gotamo kammavādī kiriyavādī apāpapurekkhāro brahmaññāya pajāya …pe… ",
  "dn4:6.17": "Samaṇo khalu, bho, gotamo uccā kulā pabbajito asambhinnakhattiyakulā …pe… ",
  "dn4:6.18": "Samaṇo khalu, bho, gotamo aḍḍhā kulā pabbajito mahaddhanā mahābhogā …pe… ",
  "dn4:6.19": "Samaṇaṁ khalu, bho, gotamaṁ tiroraṭṭhā tirojanapadā pañhaṁ pucchituṁ āgacchanti …pe… ",
  "dn4:6.20": "Samaṇaṁ khalu, bho, gotamaṁ anekāni devatāsahassāni pāṇehi saraṇaṁ gatāni …pe… ",
  "dn4:6.21": "Samaṇaṁ khalu, bho, gotamaṁ evaṁ kalyāṇo kittisaddo abbhuggato: ",
  "dn4:6.22": "‘itipi so bhagavā arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā’ti …pe… ",
  "dn4:6.23": "Samaṇo khalu, bho, gotamo dvattiṁsamahāpurisalakkhaṇehi samannāgato …pe… ",
  "dn4:6.24": "Samaṇo khalu, bho, gotamo ehisvāgatavādī sakhilo sammodako abbhākuṭiko uttānamukho pubbabhāsī …pe… ",
  "dn4:6.25": "Samaṇo khalu, bho, gotamo catunnaṁ parisānaṁ sakkato garukato mānito pūjito apacito …pe… ",
  "dn4:6.26": "Samaṇe khalu, bho, gotame bahū devā ca manussā ca abhippasannā …pe… ",
  "dn4:6.27": "Samaṇo khalu, bho, gotamo yasmiṁ gāme vā nigame vā paṭivasati, na tasmiṁ gāme vā nigame vā amanussā manusse viheṭhenti …pe… ",
  "dn4:6.28": "Samaṇo khalu, bho, gotamo saṅghī gaṇī gaṇācariyo puthutitthakarānaṁ aggamakkhāyati. Yathā kho pana, bho, etesaṁ samaṇabrāhmaṇānaṁ yathā vā tathā vā yaso samudāgacchati, na hevaṁ samaṇassa gotamassa yaso samudāgato. ",
  "dn4:6.29": "Atha kho anuttarāya vijjācaraṇasampadāya samaṇassa gotamassa yaso samudāgato …pe… ",
  "dn4:6.30": "Samaṇaṁ khalu, bho, gotamaṁ rājā māgadho seniyo bimbisāro saputto sabhariyo sapariso sāmacco pāṇehi saraṇaṁ gato …pe… ",
  "dn4:6.31": "Samaṇaṁ khalu, bho, gotamaṁ rājā pasenadi kosalo saputto sabhariyo sapariso sāmacco pāṇehi saraṇaṁ gato …pe… ",
  "dn4:6.32": "Samaṇaṁ khalu, bho, gotamaṁ brāhmaṇo pokkharasāti saputto sabhariyo sapariso sāmacco pāṇehi saraṇaṁ gato …pe… ",
  "dn4:6.33": "Samaṇo khalu, bho, gotamo rañño māgadhassa seniyassa bimbisārassa sakkato garukato mānito pūjito apacito …pe… ",
  "dn4:6.34": "Samaṇo khalu, bho, gotamo rañño pasenadissa kosalassa sakkato garukato mānito pūjito apacito …pe… ",
  "dn4:6.35": "Samaṇo khalu, bho, gotamo brāhmaṇassa pokkharasātissa sakkato garukato mānito pūjito apacito …pe… ",
  "dn4:6.36": "Samaṇo khalu, bho, gotamo campaṁ anuppatto, campāyaṁ viharati gaggarāya pokkharaṇiyā tīre. ",
  "dn4:6.37": "Ye kho pana, bho, keci samaṇā vā brāhmaṇā vā amhākaṁ gāmakhettaṁ āgacchanti atithī no te honti. ",
  "dn4:6.38": "Atithī kho panamhehi sakkātabbā garukātabbā mānetabbā pūjetabbā apacetabbā. ",
  "dn4:6.39": "Yampi, bho, samaṇo gotamo campaṁ anuppatto campāyaṁ viharati gaggarāya pokkharaṇiyā tīre, atithimhākaṁ samaṇo gotamo; ",
  "dn4:6.40": "atithi kho panamhehi sakkātabbo garukātabbo mānetabbo pūjetabbo apacetabbo. ",
  "dn4:6.41": "Imināpaṅgena na arahati so bhavaṁ gotamo amhākaṁ dassanāya upasaṅkamituṁ. ",
  "dn4:6.42": "Atha kho mayameva arahāma taṁ bhavantaṁ gotamaṁ dassanāya upasaṅkamituṁ. ",
  "dn4:6.43": "Ettake kho ahaṁ, bho, tassa bhoto gotamassa vaṇṇe pariyāpuṇāmi, no ca kho so bhavaṁ gotamo ettakavaṇṇo. ",
  "dn4:6.44": "Aparimāṇavaṇṇo hi so bhavaṁ gotamo”ti. ",
  "dn4:6.45": "Evaṁ vutte, te brāhmaṇā soṇadaṇḍaṁ brāhmaṇaṁ etadavocuṁ: ",
  "dn4:6.46": "“yathā kho bhavaṁ soṇadaṇḍo samaṇassa gotamassa vaṇṇe bhāsati ito cepi so bhavaṁ gotamo yojanasate viharati, alameva saddhena kulaputtena dassanāya upasaṅkamituṁ api puṭosenā”ti. ",
  "dn4:6.47": "“Tena hi, bho, sabbeva mayaṁ samaṇaṁ gotamaṁ dassanāya upasaṅkamissāmā”ti. ",
  "dn4:7.0": "4. Soṇadaṇḍaparivitakka ",
  "dn4:7.1": "Atha kho soṇadaṇḍo brāhmaṇo mahatā brāhmaṇagaṇena saddhiṁ yena gaggarā pokkharaṇī tenupasaṅkami. ",
  "dn4:8.1": "Atha kho soṇadaṇḍassa brāhmaṇassa tirovanasaṇḍagatassa evaṁ cetaso parivitakko udapādi: ",
  "dn4:8.2": "“ahañceva kho pana samaṇaṁ gotamaṁ pañhaṁ puccheyyaṁ; ",
  "dn4:8.3": "tatra ce maṁ samaṇo gotamo evaṁ vadeyya: ",
  "dn4:8.4": "‘na kho esa, brāhmaṇa, pañho evaṁ pucchitabbo, evaṁ nāmesa, brāhmaṇa, pañho pucchitabbo’ti, tena maṁ ayaṁ parisā paribhaveyya: ",
  "dn4:8.5": "‘bālo soṇadaṇḍo brāhmaṇo abyatto, nāsakkhi samaṇaṁ gotamaṁ yoniso pañhaṁ pucchitun’ti. ",
  "dn4:8.6": "Yaṁ kho panāyaṁ parisā paribhaveyya, yasopi tassa hāyetha. ",
  "dn4:8.7": "Yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṁ. ",
  "dn4:8.8": "Yasoladdhā kho panamhākaṁ bhogā. ",
  "dn4:8.9": "Mamañceva kho pana samaṇo gotamo pañhaṁ puccheyya, tassa cāhaṁ pañhassa veyyākaraṇena cittaṁ na ārādheyyaṁ; ",
  "dn4:8.10": "tatra ce maṁ samaṇo gotamo evaṁ vadeyya: ",
  "dn4:8.11": "‘na kho esa, brāhmaṇa, pañho evaṁ byākātabbo, evaṁ nāmesa, brāhmaṇa, pañho byākātabbo’ti, tena maṁ ayaṁ parisā paribhaveyya: ",
  "dn4:8.12": "‘bālo soṇadaṇḍo brāhmaṇo abyatto, nāsakkhi samaṇassa gotamassa pañhassa veyyākaraṇena cittaṁ ārādhetun’ti. ",
  "dn4:8.13": "Yaṁ kho panāyaṁ parisā paribhaveyya, yasopi tassa hāyetha. ",
  "dn4:8.14": "Yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṁ. ",
  "dn4:8.15": "Yasoladdhā kho panamhākaṁ bhogā. ",
  "dn4:8.16": "Ahañceva kho pana evaṁ samīpagato samāno adisvāva samaṇaṁ gotamaṁ nivatteyyaṁ, tena maṁ ayaṁ parisā paribhaveyya: ",
  "dn4:8.17": "‘bālo soṇadaṇḍo brāhmaṇo abyatto mānathaddho bhīto ca, no visahati samaṇaṁ gotamaṁ dassanāya upasaṅkamituṁ, kathañhi nāma evaṁ samīpagato samāno adisvā samaṇaṁ gotamaṁ nivattissatī’ti. ",
  "dn4:8.18": "Yaṁ kho panāyaṁ parisā paribhaveyya, yasopi tassa hāyetha. ",
  "dn4:8.19": "Yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṁ, ",
  "dn4:8.20": "yasoladdhā kho panamhākaṁ bhogā”ti. ",
  "dn4:9.1": "Atha kho soṇadaṇḍo brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṁ sammodi. ",
  "dn4:9.2": "Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. ",
  "dn4:9.3": "Campeyyakāpi kho brāhmaṇagahapatikā appekacce bhagavantaṁ abhivādetvā ekamantaṁ nisīdiṁsu; appekacce bhagavatā saddhiṁ sammodiṁsu; sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdiṁsu; appekacce yena bhagavā tenañjaliṁ paṇāmetvā ekamantaṁ nisīdiṁsu; appekacce nāmagottaṁ sāvetvā ekamantaṁ nisīdiṁsu; appekacce tuṇhībhūtā ekamantaṁ nisīdiṁsu. ",
  "dn4:10.1": "Tatrapi sudaṁ soṇadaṇḍo brāhmaṇo etadeva bahulamanuvitakkento nisinno hoti: ",
  "dn4:10.2": "“ahañceva kho pana samaṇaṁ gotamaṁ pañhaṁ puccheyyaṁ; ",
  "dn4:10.3": "tatra ce maṁ samaṇo gotamo evaṁ vadeyya: ",
  "dn4:10.4": "‘na kho esa, brāhmaṇa, pañho evaṁ pucchitabbo, evaṁ nāmesa, brāhmaṇa, pañho pucchitabbo’ti, tena maṁ ayaṁ parisā paribhaveyya: ",
  "dn4:10.5": "‘bālo soṇadaṇḍo brāhmaṇo abyatto, nāsakkhi samaṇaṁ gotamaṁ yoniso pañhaṁ pucchitun’ti. ",
  "dn4:10.6": "Yaṁ kho panāyaṁ parisā paribhaveyya, yasopi tassa hāyetha. ",
  "dn4:10.7": "Yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṁ. ",
  "dn4:10.8": "Yasoladdhā kho panamhākaṁ bhogā. ",
  "dn4:10.9": "Mamañceva kho pana samaṇo gotamo pañhaṁ puccheyya, tassa cāhaṁ pañhassa veyyākaraṇena cittaṁ na ārādheyyaṁ; ",
  "dn4:10.10": "tatra ce maṁ samaṇo gotamo evaṁ vadeyya: ",
  "dn4:10.11": "‘na kho esa, brāhmaṇa, pañho evaṁ byākātabbo, evaṁ nāmesa, brāhmaṇa, pañho byākātabbo’ti, tena maṁ ayaṁ parisā paribhaveyya: ",
  "dn4:10.12": "‘bālo soṇadaṇḍo brāhmaṇo abyatto, nāsakkhi samaṇassa gotamassa pañhassa veyyākaraṇena cittaṁ ārādhetun’ti. ",
  "dn4:10.13": "Yaṁ kho panāyaṁ parisā paribhaveyya, yasopi tassa hāyetha. ",
  "dn4:10.14": "Yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṁ. ",
  "dn4:10.15": "Yasoladdhā kho panamhākaṁ bhogā. ",
  "dn4:10.16": "Aho vata maṁ samaṇo gotamo sake ācariyake tevijjake pañhaṁ puccheyya, addhā vatassāhaṁ cittaṁ ārādheyyaṁ pañhassa veyyākaraṇenā”ti. ",
  "dn4:11.0": "5. Brāhmaṇapaññatti ",
  "dn4:11.1": "Atha kho bhagavato soṇadaṇḍassa brāhmaṇassa cetasā cetoparivitakkamaññāya etadahosi: ",
  "dn4:11.2": "“vihaññati kho ayaṁ soṇadaṇḍo brāhmaṇo sakena cittena. ",
  "dn4:11.3": "Yannūnāhaṁ soṇadaṇḍaṁ brāhmaṇaṁ sake ācariyake tevijjake pañhaṁ puccheyyan”ti. ",
  "dn4:11.4": "Atha kho bhagavā soṇadaṇḍaṁ brāhmaṇaṁ etadavoca: ",
  "dn4:11.5": "“katihi pana, brāhmaṇa, aṅgehi samannāgataṁ brāhmaṇā brāhmaṇaṁ paññapenti; ",
  "dn4:11.6": "‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṁ āpajjeyyā”ti? ",
  "dn4:12.1": "Atha kho soṇadaṇḍassa brāhmaṇassa etadahosi: ",
  "dn4:12.2": "“yaṁ vata no ahosi icchitaṁ, yaṁ ākaṅkhitaṁ, yaṁ adhippetaṁ, yaṁ abhipatthitaṁ: ",
  "dn4:12.3": "‘aho vata maṁ samaṇo gotamo sake ācariyake tevijjake pañhaṁ puccheyya, addhā vatassāhaṁ cittaṁ ārādheyyaṁ pañhassa veyyākaraṇenā’ti, tatra maṁ samaṇo gotamo sake ācariyake tevijjake pañhaṁ pucchati. ",
  "dn4:12.4": "Addhā vatassāhaṁ cittaṁ ārādhessāmi pañhassa veyyākaraṇenā”ti. ",
  "dn4:13.1": "Atha kho soṇadaṇḍo brāhmaṇo abbhunnāmetvā kāyaṁ anuviloketvā parisaṁ bhagavantaṁ etadavoca: ",
  "dn4:13.2": "“pañcahi, bho gotama, aṅgehi samannāgataṁ brāhmaṇā brāhmaṇaṁ paññapenti; ",
  "dn4:13.3": "‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṁ āpajjeyya. ",
  "dn4:13.4": "Katamehi pañcahi? ",
  "dn4:13.5": "Idha, bho gotama, brāhmaṇo ubhato sujāto hoti mātito ca pitito ca, saṁsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena; ",
  "dn4:13.6": "ajjhāyako hoti mantadharo tiṇṇaṁ vedānaṁ pāragū sanighaṇḍukeṭubhānaṁ sākkharappabhedānaṁ itihāsapañcamānaṁ padako veyyākaraṇo lokāyatamahāpurisalakkhaṇesu anavayo; ",
  "dn4:13.7": "abhirūpo hoti dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato brahmavaṇṇī brahmavacchasī akhuddāvakāso dassanāya; ",
  "dn4:13.8": "sīlavā hoti vuddhasīlī vuddhasīlena samannāgato; ",
  "dn4:13.9": "paṇḍito ca hoti medhāvī paṭhamo vā dutiyo vā sujaṁ paggaṇhantānaṁ. ",
  "dn4:13.10": "Imehi kho, bho gotama, pañcahi aṅgehi samannāgataṁ brāhmaṇā brāhmaṇaṁ paññapenti; ",
  "dn4:13.11": "‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṁ āpajjeyyā”ti. ",
  "dn4:14.1": "“Imesaṁ pana, brāhmaṇa, pañcannaṁ aṅgānaṁ sakkā ekaṁ aṅgaṁ ṭhapayitvā catūhaṅgehi samannāgataṁ brāhmaṇā brāhmaṇaṁ paññapetuṁ; ",
  "dn4:14.2": "‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṁ āpajjeyyā”ti? ",
  "dn4:14.3": "“Sakkā, bho gotama. ",
  "dn4:14.4": "Imesañhi, bho gotama, pañcannaṁ aṅgānaṁ vaṇṇaṁ ṭhapayāma. ",
  "dn4:14.5": "Kiñhi vaṇṇo karissati? ",
  "dn4:14.6": "Yato kho, bho gotama, brāhmaṇo ubhato sujāto hoti mātito ca pitito ca saṁsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena; ",
  "dn4:14.7": "ajjhāyako ca hoti mantadharo ca tiṇṇaṁ vedānaṁ pāragū sanighaṇḍukeṭubhānaṁ sākkharappabhedānaṁ itihāsapañcamānaṁ padako veyyākaraṇo lokāyatamahāpurisalakkhaṇesu anavayo; ",
  "dn4:14.8": "sīlavā ca hoti vuddhasīlī vuddhasīlena samannāgato; ",
  "dn4:14.9": "paṇḍito ca hoti medhāvī paṭhamo vā dutiyo vā sujaṁ paggaṇhantānaṁ. ",
  "dn4:14.10": "Imehi kho, bho gotama, catūhaṅgehi samannāgataṁ brāhmaṇā brāhmaṇaṁ paññapenti; ",
  "dn4:14.11": "‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṁ āpajjeyyā”ti. ",
  "dn4:15.1": "“Imesaṁ pana, brāhmaṇa, catunnaṁ aṅgānaṁ sakkā ekaṁ aṅgaṁ ṭhapayitvā tīhaṅgehi samannāgataṁ brāhmaṇā brāhmaṇaṁ paññapetuṁ; ",
  "dn4:15.2": "‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṁ āpajjeyyā”ti? ",
  "dn4:15.3": "“Sakkā, bho gotama. ",
  "dn4:15.4": "Imesañhi, bho gotama, catunnaṁ aṅgānaṁ mante ṭhapayāma. ",
  "dn4:15.5": "Kiñhi mantā karissanti? ",
  "dn4:15.6": "Yato kho, bho gotama, brāhmaṇo ubhato sujāto hoti mātito ca pitito ca saṁsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena; ",
  "dn4:15.7": "sīlavā ca hoti vuddhasīlī vuddhasīlena samannāgato; ",
  "dn4:15.8": "paṇḍito ca hoti medhāvī paṭhamo vā dutiyo vā sujaṁ paggaṇhantānaṁ. ",
  "dn4:15.9": "Imehi kho, bho gotama, tīhaṅgehi samannāgataṁ brāhmaṇā brāhmaṇaṁ paññapenti; ",
  "dn4:15.10": "‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṁ āpajjeyyā”ti. ",
  "dn4:16.1": "“Imesaṁ pana, brāhmaṇa, tiṇṇaṁ aṅgānaṁ sakkā ekaṁ aṅgaṁ ṭhapayitvā dvīhaṅgehi samannāgataṁ brāhmaṇā brāhmaṇaṁ paññapetuṁ; ",
  "dn4:16.2": "‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṁ āpajjeyyā”ti? ",
  "dn4:16.3": "“Sakkā, bho gotama. ",
  "dn4:16.4": "Imesañhi, bho gotama, tiṇṇaṁ aṅgānaṁ jātiṁ ṭhapayāma. ",
  "dn4:16.5": "Kiñhi jāti karissati? ",
  "dn4:16.6": "Yato kho, bho gotama, brāhmaṇo sīlavā hoti vuddhasīlī vuddhasīlena samannāgato; ",
  "dn4:16.7": "paṇḍito ca hoti medhāvī paṭhamo vā dutiyo vā sujaṁ paggaṇhantānaṁ. ",
  "dn4:16.8": "Imehi kho, bho gotama, dvīhaṅgehi samannāgataṁ brāhmaṇā brāhmaṇaṁ paññapenti; ",
  "dn4:16.9": "‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṁ āpajjeyyā”ti. ",
  "dn4:17.1": "Evaṁ vutte, te brāhmaṇā soṇadaṇḍaṁ brāhmaṇaṁ etadavocuṁ: ",
  "dn4:17.2": "“mā bhavaṁ soṇadaṇḍo evaṁ avaca, mā bhavaṁ soṇadaṇḍo evaṁ avaca. ",
  "dn4:17.3": "Apavadateva bhavaṁ soṇadaṇḍo vaṇṇaṁ, apavadati mante, apavadati jātiṁ, ekaṁsena bhavaṁ soṇadaṇḍo samaṇasseva gotamassa vādaṁ anupakkhandatī”ti. ",
  "dn4:18.1": "Atha kho bhagavā te brāhmaṇe etadavoca: ",
  "dn4:18.2": "“sace kho tumhākaṁ brāhmaṇānaṁ evaṁ hoti: ",
  "dn4:18.3": "‘appassuto ca soṇadaṇḍo brāhmaṇo, akalyāṇavākkaraṇo ca soṇadaṇḍo brāhmaṇo, duppañño ca soṇadaṇḍo brāhmaṇo, na ca pahoti soṇadaṇḍo brāhmaṇo samaṇena gotamena saddhiṁ asmiṁ vacane paṭimantetun’ti, tiṭṭhatu soṇadaṇḍo brāhmaṇo, tumhe mayā saddhiṁ mantavho asmiṁ vacane. ",
  "dn4:18.4": "Sace pana tumhākaṁ brāhmaṇānaṁ evaṁ hoti: ",
  "dn4:18.5": "‘bahussuto ca soṇadaṇḍo brāhmaṇo, kalyāṇavākkaraṇo ca soṇadaṇḍo brāhmaṇo, paṇḍito ca soṇadaṇḍo brāhmaṇo, pahoti ca soṇadaṇḍo brāhmaṇo samaṇena gotamena saddhiṁ asmiṁ vacane paṭimantetun’ti, tiṭṭhatha tumhe, soṇadaṇḍo brāhmaṇo mayā saddhiṁ paṭimantetū”ti. ",
  "dn4:19.1": "Evaṁ vutte, soṇadaṇḍo brāhmaṇo bhagavantaṁ etadavoca: ",
  "dn4:19.2": "“tiṭṭhatu bhavaṁ gotamo, tuṇhī bhavaṁ gotamo hotu, ahameva tesaṁ sahadhammena paṭivacanaṁ karissāmī”ti. ",
  "dn4:19.3": "Atha kho soṇadaṇḍo brāhmaṇo te brāhmaṇe etadavoca: ",
  "dn4:19.4": "“mā bhavanto evaṁ avacuttha, mā bhavanto evaṁ avacuttha: ",
  "dn4:19.5": "‘apavadateva bhavaṁ soṇadaṇḍo vaṇṇaṁ, apavadati mante, apavadati jātiṁ, ekaṁsena bhavaṁ soṇadaṇḍo samaṇasseva gotamassa vādaṁ anupakkhandatī’ti. ",
  "dn4:19.6": "Nāhaṁ, bho, apavadāmi vaṇṇaṁ vā mante vā jātiṁ vā”ti. ",
  "dn4:20.1": "Tena kho pana samayena soṇadaṇḍassa brāhmaṇassa bhāgineyyo aṅgako nāma māṇavako tassaṁ parisāyaṁ nisinno hoti. ",
  "dn4:20.2": "Atha kho soṇadaṇḍo brāhmaṇo te brāhmaṇe etadavoca: ",
  "dn4:20.3": "“passanti no bhonto imaṁ aṅgakaṁ māṇavakaṁ amhākaṁ bhāgineyyan”ti? ",
  "dn4:20.4": "“Evaṁ, bho”. ",
  "dn4:20.5": "“Aṅgako kho, bho, māṇavako abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato brahmavaṇṇī brahmavacchasī akhuddāvakāso dassanāya, nāssa imissaṁ parisāyaṁ samasamo atthi vaṇṇena ṭhapetvā samaṇaṁ gotamaṁ. ",
  "dn4:20.6": "Aṅgako kho māṇavako ajjhāyako mantadharo, tiṇṇaṁ vedānaṁ pāragū sanighaṇḍukeṭubhānaṁ sākkharappabhedānaṁ itihāsapañcamānaṁ padako veyyākaraṇo lokāyatamahāpurisalakkhaṇesu anavayo. ",
  "dn4:20.7": "Ahamassa mante vācetā. ",
  "dn4:20.8": "Aṅgako kho māṇavako ubhato sujāto mātito ca pitito ca saṁsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena. ",
  "dn4:20.9": "Ahamassa mātāpitaro jānāmi. ",
  "dn4:20.10": "Aṅgako kho māṇavako pāṇampi haneyya, adinnampi ādiyeyya, paradārampi gaccheyya, musāvādampi bhaṇeyya, majjampi piveyya, ettha dāni, bho, kiṁ vaṇṇo karissati, kiṁ mantā, kiṁ jāti? ",
  "dn4:20.11": "Yato kho, bho, brāhmaṇo sīlavā ca hoti vuddhasīlī vuddhasīlena samannāgato, ",
  "dn4:20.12": "paṇḍito ca hoti medhāvī paṭhamo vā dutiyo vā sujaṁ paggaṇhantānaṁ. ",
  "dn4:20.13": "Imehi kho, bho, dvīhaṅgehi samannāgataṁ brāhmaṇā brāhmaṇaṁ paññapenti; ",
  "dn4:20.14": "‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṁ āpajjeyyā”ti. ",
  "dn4:21.0": "6. Sīlapaññākathā ",
  "dn4:21.1": "“Imesaṁ pana, brāhmaṇa, dvinnaṁ aṅgānaṁ sakkā ekaṁ aṅgaṁ ṭhapayitvā ekena aṅgena samannāgataṁ brāhmaṇā brāhmaṇaṁ paññapetuṁ; ",
  "dn4:21.2": "‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṁ āpajjeyyā”ti? ",
  "dn4:21.3": "“No hidaṁ, bho gotama. ",
  "dn4:21.4": "Sīlaparidhotā hi, bho gotama, paññā; paññāparidhotaṁ sīlaṁ. ",
  "dn4:21.5": "Yattha sīlaṁ tattha paññā, yattha paññā tattha sīlaṁ. ",
  "dn4:21.6": "Sīlavato paññā, paññavato sīlaṁ. ",
  "dn4:21.7": "Sīlapaññāṇañca pana lokasmiṁ aggamakkhāyati. ",
  "dn4:21.8": "Seyyathāpi, bho gotama, hatthena vā hatthaṁ dhoveyya, pādena vā pādaṁ dhoveyya; ",
  "dn4:21.9": "evameva kho, bho gotama, sīlaparidhotā paññā, paññāparidhotaṁ sīlaṁ. ",
  "dn4:21.10": "Yattha sīlaṁ tattha paññā, yattha paññā tattha sīlaṁ. ",
  "dn4:21.11": "Sīlavato paññā, paññavato sīlaṁ. ",
  "dn4:21.12": "Sīlapaññāṇañca pana lokasmiṁ aggamakkhāyatī”ti. ",
  "dn4:22.1": "“Evametaṁ, brāhmaṇa, evametaṁ, brāhmaṇa, sīlaparidhotā hi, brāhmaṇa, paññā, paññāparidhotaṁ sīlaṁ. ",
  "dn4:22.2": "Yattha sīlaṁ tattha paññā, yattha paññā tattha sīlaṁ. ",
  "dn4:22.3": "Sīlavato paññā, paññavato sīlaṁ. ",
  "dn4:22.4": "Sīlapaññāṇañca pana lokasmiṁ aggamakkhāyati. ",
  "dn4:22.5": "Seyyathāpi, brāhmaṇa, hatthena vā hatthaṁ dhoveyya, pādena vā pādaṁ dhoveyya; ",
  "dn4:22.6": "evameva kho, brāhmaṇa, sīlaparidhotā paññā, paññāparidhotaṁ sīlaṁ. ",
  "dn4:22.7": "Yattha sīlaṁ tattha paññā, yattha paññā tattha sīlaṁ. ",
  "dn4:22.8": "Sīlavato paññā, paññavato sīlaṁ. ",
  "dn4:22.9": "Sīlapaññāṇañca pana lokasmiṁ aggamakkhāyati. ",
  "dn4:22.10": "Katamaṁ pana taṁ, brāhmaṇa, sīlaṁ? ",
  "dn4:22.11": "Katamā sā paññā”ti? ",
  "dn4:22.12": "“Ettakaparamāva mayaṁ, bho gotama, etasmiṁ atthe. ",
  "dn4:22.13": "Sādhu vata bhavantaṁyeva gotamaṁ paṭibhātu etassa bhāsitassa attho”ti. ",
  "dn4:23.1": "“Tena hi, brāhmaṇa, suṇohi, sādhukaṁ manasikarohi, bhāsissāmī”ti. ",
  "dn4:23.2": "“Evaṁ, bho”ti kho soṇadaṇḍo brāhmaṇo bhagavato paccassosi. ",
  "dn4:23.3": "Bhagavā etadavoca: ",
  "dn4:23.4": "“idha, mahārāja, tathāgato loke uppajjati arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā. ",
  "dn4:23.4.1.2": "So imaṁ lokaṁ sadevakaṁ samārakaṁ sabrahmakaṁ sassamaṇabrāhmaṇiṁ pajaṁ sadevamanussaṁ sayaṁ abhiññā sacchikatvā pavedeti. ",
  "dn4:23.4.1.3": "So dhammaṁ deseti ādikalyāṇaṁ majjhekalyāṇaṁ pariyosānakalyāṇaṁ sātthaṁ sabyañjanaṁ, kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ pakāseti. ",
  "dn4:23.4.2.1": "Taṁ dhammaṁ suṇāti gahapati vā gahapatiputto vā aññatarasmiṁ vā kule paccājāto. ",
  "dn4:23.4.2.2": "So taṁ dhammaṁ sutvā tathāgate saddhaṁ paṭilabhati. ",
  "dn4:23.4.2.3": "So tena saddhāpaṭilābhena samannāgato iti paṭisañcikkhati: ",
  "dn4:23.4.2.4": "‘sambādho gharāvāso rajopatho, abbhokāso pabbajjā. ",
  "dn4:23.4.2.5": "Nayidaṁ sukaraṁ agāraṁ ajjhāvasatā ekantaparipuṇṇaṁ ekantaparisuddhaṁ saṅkhalikhitaṁ brahmacariyaṁ carituṁ. ",
  "dn4:23.4.2.6": "Yannūnāhaṁ kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajeyyan’ti. ",
  "dn4:23.4.2.7": "So aparena samayena appaṁ vā bhogakkhandhaṁ pahāya mahantaṁ vā bhogakkhandhaṁ pahāya appaṁ vā ñātiparivaṭṭaṁ pahāya mahantaṁ vā ñātiparivaṭṭaṁ pahāya kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajati. ",
  "dn4:23.4.3.1": "So evaṁ pabbajito samāno pātimokkhasaṁvarasaṁvuto viharati ācāragocarasampanno, aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu, kāyakammavacīkammena samannāgato kusalena, parisuddhājīvo sīlasampanno, indriyesu guttadvāro, satisampajaññena samannāgato, santuṭṭho. ",
  "dn4:23.4.4.0.1": "6.1. Sīla ",
  "dn4:23.4.4.0.2": "6.1.1. Cūḷasīla ",
  "dn4:23.4.4.1": "Kathañca, mahārāja, bhikkhu sīlasampanno hoti? ",
  "dn4:23.4.4.2": "Idha, mahārāja, bhikkhu pāṇātipātaṁ pahāya pāṇātipātā paṭivirato hoti. Nihitadaṇḍo nihitasattho lajjī dayāpanno sabbapāṇabhūtahitānukampī viharati. ",
  "dn4:23.4.4.3": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.4.4": "Adinnādānaṁ pahāya adinnādānā paṭivirato hoti dinnādāyī dinnapāṭikaṅkhī, athenena sucibhūtena attanā viharati. ",
  "dn4:23.4.4.5": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.4.6": "Abrahmacariyaṁ pahāya brahmacārī hoti ārācārī virato methunā gāmadhammā. ",
  "dn4:23.4.4.7": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.5.1": "Musāvādaṁ pahāya musāvādā paṭivirato hoti saccavādī saccasandho theto paccayiko avisaṁvādako lokassa. ",
  "dn4:23.4.5.2": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.5.3": "Pisuṇaṁ vācaṁ pahāya pisuṇāya vācāya paṭivirato hoti; ito sutvā na amutra akkhātā imesaṁ bhedāya; amutra vā sutvā na imesaṁ akkhātā, amūsaṁ bhedāya. Iti bhinnānaṁ vā sandhātā, sahitānaṁ vā anuppadātā, samaggārāmo samaggarato samagganandī samaggakaraṇiṁ vācaṁ bhāsitā hoti. ",
  "dn4:23.4.5.4": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.5.5": "Pharusaṁ vācaṁ pahāya pharusāya vācāya paṭivirato hoti; yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā tathārūpiṁ vācaṁ bhāsitā hoti. ",
  "dn4:23.4.5.6": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.5.7": "Samphappalāpaṁ pahāya samphappalāpā paṭivirato hoti kālavādī bhūtavādī atthavādī dhammavādī vinayavādī, nidhānavatiṁ vācaṁ bhāsitā hoti kālena sāpadesaṁ pariyantavatiṁ atthasaṁhitaṁ. ",
  "dn4:23.4.5.8": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.6.1": "Bījagāmabhūtagāmasamārambhā paṭivirato hoti …pe… ",
  "dn4:23.4.6.2": "ekabhattiko hoti rattūparato virato vikālabhojanā. ",
  "dn4:23.4.6.3": "Naccagītavāditavisūkadassanā paṭivirato hoti. ",
  "dn4:23.4.6.4": "Mālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānā paṭivirato hoti. ",
  "dn4:23.4.6.5": "Uccāsayanamahāsayanā paṭivirato hoti. ",
  "dn4:23.4.6.6": "Jātarūparajatapaṭiggahaṇā paṭivirato hoti. ",
  "dn4:23.4.6.7": "Āmakadhaññapaṭiggahaṇā paṭivirato hoti. ",
  "dn4:23.4.6.8": "Āmakamaṁsapaṭiggahaṇā paṭivirato hoti. ",
  "dn4:23.4.6.9": "Itthikumārikapaṭiggahaṇā paṭivirato hoti. ",
  "dn4:23.4.6.10": "Dāsidāsapaṭiggahaṇā paṭivirato hoti. ",
  "dn4:23.4.6.11": "Ajeḷakapaṭiggahaṇā paṭivirato hoti. ",
  "dn4:23.4.6.12": "Kukkuṭasūkarapaṭiggahaṇā paṭivirato hoti. ",
  "dn4:23.4.6.13": "Hatthigavassavaḷavapaṭiggahaṇā paṭivirato hoti. ",
  "dn4:23.4.6.14": "Khettavatthupaṭiggahaṇā paṭivirato hoti. ",
  "dn4:23.4.6.15": "Dūteyyapahiṇagamanānuyogā paṭivirato hoti. ",
  "dn4:23.4.6.16": "Kayavikkayā paṭivirato hoti. ",
  "dn4:23.4.6.17": "Tulākūṭakaṁsakūṭamānakūṭā paṭivirato hoti. ",
  "dn4:23.4.6.18": "Ukkoṭanavañcananikatisāciyogā paṭivirato hoti. ",
  "dn4:23.4.6.19": "Chedanavadhabandhanaviparāmosaālopasahasākārā paṭivirato hoti. ",
  "dn4:23.4.6.20": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.6.21": "Cūḷasīlaṁ niṭṭhitaṁ. ",
  "dn4:23.4.7.0": "6.1.2. Majjhimasīla ",
  "dn4:23.4.7.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ bījagāmabhūtagāmasamārambhaṁ anuyuttā viharanti. ",
  "dn4:23.4.7.2": "Seyyathidaṁ—mūlabījaṁ khandhabījaṁ phaḷubījaṁ aggabījaṁ bījabījameva pañcamaṁ, iti evarūpā bījagāmabhūtagāmasamārambhā paṭivirato hoti. ",
  "dn4:23.4.7.3": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.8.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ sannidhikāraparibhogaṁ anuyuttā viharanti. ",
  "dn4:23.4.8.2": "Seyyathidaṁ—annasannidhiṁ pānasannidhiṁ vatthasannidhiṁ yānasannidhiṁ sayanasannidhiṁ gandhasannidhiṁ āmisasannidhiṁ, ",
  "dn4:23.4.8.3": "iti vā iti evarūpā sannidhikāraparibhogā paṭivirato hoti. ",
  "dn4:23.4.8.4": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.9.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ visūkadassanaṁ anuyuttā viharanti. ",
  "dn4:23.4.9.2": "Seyyathidaṁ—naccaṁ gītaṁ vāditaṁ pekkhaṁ akkhānaṁ pāṇissaraṁ vetāḷaṁ kumbhathūṇaṁ sobhanakaṁ caṇḍālaṁ vaṁsaṁ dhovanaṁ hatthiyuddhaṁ assayuddhaṁ mahiṁsayuddhaṁ usabhayuddhaṁ ajayuddhaṁ meṇḍayuddhaṁ kukkuṭayuddhaṁ vaṭṭakayuddhaṁ daṇḍayuddhaṁ muṭṭhiyuddhaṁ nibbuddhaṁ uyyodhikaṁ balaggaṁ senābyūhaṁ anīkadassanaṁ ",
  "dn4:23.4.9.3": "iti vā iti evarūpā visūkadassanā paṭivirato hoti. ",
  "dn4:23.4.9.4": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.10.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ jūtappamādaṭṭhānānuyogaṁ anuyuttā viharanti. ",
  "dn4:23.4.10.2": "Seyyathidaṁ—aṭṭhapadaṁ dasapadaṁ ākāsaṁ parihārapathaṁ santikaṁ khalikaṁ ghaṭikaṁ salākahatthaṁ akkhaṁ paṅgacīraṁ vaṅkakaṁ mokkhacikaṁ ciṅgulikaṁ pattāḷhakaṁ rathakaṁ dhanukaṁ akkharikaṁ manesikaṁ yathāvajjaṁ ",
  "dn4:23.4.10.3": "iti vā iti evarūpā jūtappamādaṭṭhānānuyogā paṭivirato hoti. ",
  "dn4:23.4.10.4": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.11.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ uccāsayanamahāsayanaṁ anuyuttā viharanti. ",
  "dn4:23.4.11.2": "Seyyathidaṁ—āsandiṁ pallaṅkaṁ gonakaṁ cittakaṁ paṭikaṁ paṭalikaṁ tūlikaṁ vikatikaṁ uddalomiṁ ekantalomiṁ kaṭṭissaṁ koseyyaṁ kuttakaṁ hatthattharaṁ assattharaṁ rathattharaṁ ajinappaveṇiṁ kadalimigapavarapaccattharaṇaṁ sauttaracchadaṁ ubhatolohitakūpadhānaṁ ",
  "dn4:23.4.11.3": "iti vā iti evarūpā uccāsayanamahāsayanā paṭivirato hoti. ",
  "dn4:23.4.11.4": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.12.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ maṇḍanavibhūsanaṭṭhānānuyogaṁ anuyuttā viharanti. ",
  "dn4:23.4.12.2": "Seyyathidaṁ—ucchādanaṁ parimaddanaṁ nhāpanaṁ sambāhanaṁ ādāsaṁ añjanaṁ mālāgandhavilepanaṁ mukhacuṇṇaṁ mukhalepanaṁ hatthabandhaṁ sikhābandhaṁ daṇḍaṁ nāḷikaṁ asiṁ chattaṁ citrupāhanaṁ uṇhīsaṁ maṇiṁ vālabījaniṁ odātāni vatthāni dīghadasāni ",
  "dn4:23.4.12.3": "iti vā iti evarūpā maṇḍanavibhūsanaṭṭhānānuyogā paṭivirato hoti. ",
  "dn4:23.4.12.4": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.13.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ tiracchānakathaṁ anuyuttā viharanti. ",
  "dn4:23.4.13.2": "Seyyathidaṁ—rājakathaṁ corakathaṁ mahāmattakathaṁ senākathaṁ bhayakathaṁ yuddhakathaṁ annakathaṁ pānakathaṁ vatthakathaṁ sayanakathaṁ mālākathaṁ gandhakathaṁ ñātikathaṁ yānakathaṁ gāmakathaṁ nigamakathaṁ nagarakathaṁ janapadakathaṁ itthikathaṁ sūrakathaṁ visikhākathaṁ kumbhaṭṭhānakathaṁ pubbapetakathaṁ nānattakathaṁ lokakkhāyikaṁ samuddakkhāyikaṁ itibhavābhavakathaṁ ",
  "dn4:23.4.13.3": "iti vā iti evarūpāya tiracchānakathāya paṭivirato hoti. ",
  "dn4:23.4.13.4": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.14.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ viggāhikakathaṁ anuyuttā viharanti. ",
  "dn4:23.4.14.2": "Seyyathidaṁ—na tvaṁ imaṁ dhammavinayaṁ ājānāsi, ahaṁ imaṁ dhammavinayaṁ ājānāmi, kiṁ tvaṁ imaṁ dhammavinayaṁ ājānissasi, micchā paṭipanno tvamasi, ahamasmi sammā paṭipanno, sahitaṁ me, asahitaṁ te, pure vacanīyaṁ pacchā avaca, pacchā vacanīyaṁ pure avaca, adhiciṇṇaṁ te viparāvattaṁ, āropito te vādo, niggahito tvamasi, cara vādappamokkhāya, nibbeṭhehi vā sace pahosīti ",
  "dn4:23.4.14.3": "iti vā iti evarūpāya viggāhikakathāya paṭivirato hoti. ",
  "dn4:23.4.14.4": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.15.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ dūteyyapahiṇagamanānuyogaṁ anuyuttā viharanti. ",
  "dn4:23.4.15.2": "Seyyathidaṁ—raññaṁ, rājamahāmattānaṁ, khattiyānaṁ, brāhmaṇānaṁ, gahapatikānaṁ, kumārānaṁ—idha gaccha, amutrāgaccha, idaṁ hara, amutra idaṁ āharā’ti ",
  "dn4:23.4.15.3": "iti vā iti evarūpā dūteyyapahiṇagamanānuyogā paṭivirato hoti. ",
  "dn4:23.4.15.4": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.16.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te kuhakā ca honti lapakā ca nemittikā ca nippesikā ca lābhena lābhaṁ nijigīsitāro ca. Iti evarūpā kuhanalapanā paṭivirato hoti. ",
  "dn4:23.4.16.2": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.16.3": "Majjhimasīlaṁ niṭṭhitaṁ. ",
  "dn4:23.4.17.0": "6.1.3. Mahāsīla ",
  "dn4:23.4.17.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn4:23.4.17.2": "Seyyathidaṁ—aṅgaṁ nimittaṁ uppātaṁ supinaṁ lakkhaṇaṁ mūsikacchinnaṁ aggihomaṁ dabbihomaṁ thusahomaṁ kaṇahomaṁ taṇḍulahomaṁ sappihomaṁ telahomaṁ mukhahomaṁ lohitahomaṁ aṅgavijjā vatthuvijjā khattavijjā sivavijjā bhūtavijjā bhūrivijjā ahivijjā visavijjā vicchikavijjā mūsikavijjā sakuṇavijjā vāyasavijjā pakkajjhānaṁ saraparittāṇaṁ migacakkaṁ ",
  "dn4:23.4.17.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn4:23.4.17.4": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.18.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn4:23.4.18.2": "Seyyathidaṁ—maṇilakkhaṇaṁ vatthalakkhaṇaṁ daṇḍalakkhaṇaṁ satthalakkhaṇaṁ asilakkhaṇaṁ usulakkhaṇaṁ dhanulakkhaṇaṁ āvudhalakkhaṇaṁ itthilakkhaṇaṁ purisalakkhaṇaṁ kumāralakkhaṇaṁ kumārilakkhaṇaṁ dāsalakkhaṇaṁ dāsilakkhaṇaṁ hatthilakkhaṇaṁ assalakkhaṇaṁ mahiṁsalakkhaṇaṁ usabhalakkhaṇaṁ golakkhaṇaṁ ajalakkhaṇaṁ meṇḍalakkhaṇaṁ kukkuṭalakkhaṇaṁ vaṭṭakalakkhaṇaṁ godhālakkhaṇaṁ kaṇṇikalakkhaṇaṁ kacchapalakkhaṇaṁ migalakkhaṇaṁ ",
  "dn4:23.4.18.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn4:23.4.18.4": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.19.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn4:23.4.19.2": "Seyyathidaṁ—raññaṁ niyyānaṁ bhavissati, raññaṁ aniyyānaṁ bhavissati, abbhantarānaṁ raññaṁ upayānaṁ bhavissati, bāhirānaṁ raññaṁ apayānaṁ bhavissati, bāhirānaṁ raññaṁ upayānaṁ bhavissati, abbhantarānaṁ raññaṁ apayānaṁ bhavissati, abbhantarānaṁ raññaṁ jayo bhavissati, bāhirānaṁ raññaṁ parājayo bhavissati, bāhirānaṁ raññaṁ jayo bhavissati, abbhantarānaṁ raññaṁ parājayo bhavissati, iti imassa jayo bhavissati, imassa parājayo bhavissati ",
  "dn4:23.4.19.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn4:23.4.19.4": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.20.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn4:23.4.20.2": "Seyyathidaṁ—candaggāho bhavissati, sūriyaggāho bhavissati, nakkhattaggāho bhavissati, candimasūriyānaṁ pathagamanaṁ bhavissati, candimasūriyānaṁ uppathagamanaṁ bhavissati, nakkhattānaṁ pathagamanaṁ bhavissati, nakkhattānaṁ uppathagamanaṁ bhavissati, ukkāpāto bhavissati, disāḍāho bhavissati, bhūmicālo bhavissati, devadudrabhi bhavissati, candimasūriyanakkhattānaṁ uggamanaṁ ogamanaṁ saṅkilesaṁ vodānaṁ bhavissati, evaṁvipāko candaggāho bhavissati, evaṁvipāko sūriyaggāho bhavissati, evaṁvipāko nakkhattaggāho bhavissati, evaṁvipākaṁ candimasūriyānaṁ pathagamanaṁ bhavissati, evaṁvipākaṁ candimasūriyānaṁ uppathagamanaṁ bhavissati, evaṁvipākaṁ nakkhattānaṁ pathagamanaṁ bhavissati, evaṁvipākaṁ nakkhattānaṁ uppathagamanaṁ bhavissati, evaṁvipāko ukkāpāto bhavissati, evaṁvipāko disāḍāho bhavissati, evaṁvipāko bhūmicālo bhavissati, evaṁvipāko devadudrabhi bhavissati, evaṁvipākaṁ candimasūriyanakkhattānaṁ uggamanaṁ ogamanaṁ saṅkilesaṁ vodānaṁ bhavissati ",
  "dn4:23.4.20.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn4:23.4.20.4": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.21.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn4:23.4.21.2": "Seyyathidaṁ—suvuṭṭhikā bhavissati, dubbuṭṭhikā bhavissati, subhikkhaṁ bhavissati, dubbhikkhaṁ bhavissati, khemaṁ bhavissati, bhayaṁ bhavissati, rogo bhavissati, ārogyaṁ bhavissati, muddā, gaṇanā, saṅkhānaṁ, kāveyyaṁ, lokāyataṁ ",
  "dn4:23.4.21.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn4:23.4.21.4": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.22.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn4:23.4.22.2": "Seyyathidaṁ—āvāhanaṁ vivāhanaṁ saṁvaraṇaṁ vivaraṇaṁ saṅkiraṇaṁ vikiraṇaṁ subhagakaraṇaṁ dubbhagakaraṇaṁ viruddhagabbhakaraṇaṁ jivhānibandhanaṁ hanusaṁhananaṁ hatthābhijappanaṁ hanujappanaṁ kaṇṇajappanaṁ ādāsapañhaṁ kumārikapañhaṁ devapañhaṁ ādiccupaṭṭhānaṁ mahatupaṭṭhānaṁ abbhujjalanaṁ sirivhāyanaṁ ",
  "dn4:23.4.22.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn4:23.4.22.4": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.23.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn4:23.4.23.2": "Seyyathidaṁ—santikammaṁ paṇidhikammaṁ bhūtakammaṁ bhūrikammaṁ vassakammaṁ vossakammaṁ vatthukammaṁ vatthuparikammaṁ ācamanaṁ nhāpanaṁ juhanaṁ vamanaṁ virecanaṁ uddhaṁvirecanaṁ adhovirecanaṁ sīsavirecanaṁ kaṇṇatelaṁ nettatappanaṁ natthukammaṁ añjanaṁ paccañjanaṁ sālākiyaṁ sallakattiyaṁ dārakatikicchā, mūlabhesajjānaṁ anuppadānaṁ, osadhīnaṁ paṭimokkho ",
  "dn4:23.4.23.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn4:23.4.23.4": "Idampissa hoti sīlasmiṁ. ",
  "dn4:23.4.24.1": "Sa kho so, mahārāja, bhikkhu evaṁ sīlasampanno na kutoci bhayaṁ samanupassati, yadidaṁ sīlasaṁvarato. ",
  "dn4:23.4.24.2": "Seyyathāpi, mahārāja, rājā khattiyo muddhābhisitto nihatapaccāmitto na kutoci bhayaṁ samanupassati, yadidaṁ paccatthikato; ",
  "dn4:23.4.24.3": "evameva kho, mahārāja, bhikkhu evaṁ sīlasampanno na kutoci bhayaṁ samanupassati, yadidaṁ sīlasaṁvarato. ",
  "dn4:23.4.24.4": "So iminā ariyena sīlakkhandhena samannāgato ajjhattaṁ anavajjasukhaṁ paṭisaṁvedeti. ",
  "dn4:23.5": "Evaṁ kho, brāhmaṇa, bhikkhu sīlasampanno hoti. ",
  "dn4:23.6": "Idaṁ kho taṁ, brāhmaṇa, sīlaṁ …pe… ",
  "dn4:23.6.1.6": "Mahāsīlaṁ niṭṭhitaṁ. ",
  "dn4:23.6.2.0.1": "6.2. Samādhi ",
  "dn4:23.6.2.0.2": "6.2.1. Indriyasaṁvara ",
  "dn4:23.6.2.1": "Kathañca, mahārāja, bhikkhu indriyesu guttadvāro hoti? ",
  "dn4:23.6.2.2": "Idha, mahārāja, bhikkhu cakkhunā rūpaṁ disvā na nimittaggāhī hoti nānubyañjanaggāhī. ",
  "dn4:23.6.2.3": "Yatvādhikaraṇamenaṁ cakkhundriyaṁ asaṁvutaṁ viharantaṁ abhijjhā domanassā pāpakā akusalā dhammā anvāssaveyyuṁ, tassa saṁvarāya paṭipajjati, rakkhati cakkhundriyaṁ, cakkhundriye saṁvaraṁ āpajjati. ",
  "dn4:23.6.2.4": "Sotena saddaṁ sutvā …pe… ",
  "dn4:23.6.2.5": "ghānena gandhaṁ ghāyitvā …pe… ",
  "dn4:23.6.2.6": "jivhāya rasaṁ sāyitvā …pe… ",
  "dn4:23.6.2.7": "kāyena phoṭṭhabbaṁ phusitvā …pe… ",
  "dn4:23.6.2.8": "manasā dhammaṁ viññāya na nimittaggāhī hoti nānubyañjanaggāhī. ",
  "dn4:23.6.2.9": "Yatvādhikaraṇamenaṁ manindriyaṁ asaṁvutaṁ viharantaṁ abhijjhā domanassā pāpakā akusalā dhammā anvāssaveyyuṁ, tassa saṁvarāya paṭipajjati, rakkhati manindriyaṁ, manindriye saṁvaraṁ āpajjati. ",
  "dn4:23.6.2.10": "So iminā ariyena indriyasaṁvarena samannāgato ajjhattaṁ abyāsekasukhaṁ paṭisaṁvedeti. ",
  "dn4:23.6.2.11": "Evaṁ kho, mahārāja, bhikkhu indriyesu guttadvāro hoti. ",
  "dn4:23.6.3.0": "6.2.2. Satisampajañña ",
  "dn4:23.6.3.1": "Kathañca, mahārāja, bhikkhu satisampajaññena samannāgato hoti? ",
  "dn4:23.6.3.2": "Idha, mahārāja, bhikkhu abhikkante paṭikkante sampajānakārī hoti, ālokite vilokite sampajānakārī hoti, samiñjite pasārite sampajānakārī hoti, saṅghāṭipattacīvaradhāraṇe sampajānakārī hoti, asite pīte khāyite sāyite sampajānakārī hoti, uccārapassāvakamme sampajānakārī hoti, gate ṭhite nisinne sutte jāgarite bhāsite tuṇhībhāve sampajānakārī hoti. ",
  "dn4:23.6.3.3": "Evaṁ kho, mahārāja, bhikkhu satisampajaññena samannāgato hoti. ",
  "dn4:23.6.4.0": "6.2.3. Santosa ",
  "dn4:23.6.4.1": "Kathañca, mahārāja, bhikkhu santuṭṭho hoti? ",
  "dn4:23.6.4.2": "Idha, mahārāja, bhikkhu santuṭṭho hoti kāyaparihārikena cīvarena, kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati, samādāyeva pakkamati. ",
  "dn4:23.6.4.3": "Seyyathāpi, mahārāja, pakkhī sakuṇo yena yeneva ḍeti, sapattabhārova ḍeti; ",
  "dn4:23.6.4.4": "evameva kho, mahārāja, bhikkhu santuṭṭho hoti kāyaparihārikena cīvarena kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati, samādāyeva pakkamati. ",
  "dn4:23.6.4.5": "Evaṁ kho, mahārāja, bhikkhu santuṭṭho hoti. ",
  "dn4:23.6.5.0": "6.2.4. Nīvaraṇappahāna ",
  "dn4:23.6.5.1": "So iminā ca ariyena sīlakkhandhena samannāgato, iminā ca ariyena indriyasaṁvarena samannāgato, iminā ca ariyena satisampajaññena samannāgato, imāya ca ariyāya santuṭṭhiyā samannāgato, ",
  "dn4:23.6.5.2": "vivittaṁ senāsanaṁ bhajati araññaṁ rukkhamūlaṁ pabbataṁ kandaraṁ giriguhaṁ susānaṁ vanapatthaṁ abbhokāsaṁ palālapuñjaṁ. ",
  "dn4:23.6.5.3": "So pacchābhattaṁ piṇḍapātapaṭikkanto nisīdati pallaṅkaṁ ābhujitvā ujuṁ kāyaṁ paṇidhāya parimukhaṁ satiṁ upaṭṭhapetvā. ",
  "dn4:23.6.6.1": "So abhijjhaṁ loke pahāya vigatābhijjhena cetasā viharati, abhijjhāya cittaṁ parisodheti. ",
  "dn4:23.6.6.2": "Byāpādapadosaṁ pahāya abyāpannacitto viharati sabbapāṇabhūtahitānukampī, byāpādapadosā cittaṁ parisodheti. ",
  "dn4:23.6.6.3": "Thinamiddhaṁ pahāya vigatathinamiddho viharati ālokasaññī, sato sampajāno, thinamiddhā cittaṁ parisodheti. ",
  "dn4:23.6.6.4": "Uddhaccakukkuccaṁ pahāya anuddhato viharati, ajjhattaṁ vūpasantacitto, uddhaccakukkuccā cittaṁ parisodheti. ",
  "dn4:23.6.6.5": "Vicikicchaṁ pahāya tiṇṇavicikiccho viharati, akathaṅkathī kusalesu dhammesu, vicikicchāya cittaṁ parisodheti. ",
  "dn4:23.6.7.1": "Seyyathāpi, mahārāja, puriso iṇaṁ ādāya kammante payojeyya. ",
  "dn4:23.6.7.2": "Tassa te kammantā samijjheyyuṁ. ",
  "dn4:23.6.7.3": "So yāni ca porāṇāni iṇamūlāni, tāni ca byantiṁ kareyya, siyā cassa uttariṁ avasiṭṭhaṁ dārabharaṇāya. ",
  "dn4:23.6.7.4": "Tassa evamassa: ",
  "dn4:23.6.7.5": "‘ahaṁ kho pubbe iṇaṁ ādāya kammante payojesiṁ. ",
  "dn4:23.6.7.6": "Tassa me te kammantā samijjhiṁsu. ",
  "dn4:23.6.7.7": "Sohaṁ yāni ca porāṇāni iṇamūlāni, tāni ca byantiṁ akāsiṁ, atthi ca me uttariṁ avasiṭṭhaṁ dārabharaṇāyā’ti. ",
  "dn4:23.6.7.8": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn4:23.6.8.1": "Seyyathāpi, mahārāja, puriso ābādhiko assa dukkhito bāḷhagilāno; bhattañcassa nacchādeyya, na cassa kāye balamattā. ",
  "dn4:23.6.8.2": "So aparena samayena tamhā ābādhā mucceyya; bhattaṁ cassa chādeyya, siyā cassa kāye balamattā. ",
  "dn4:23.6.8.3": "Tassa evamassa: ",
  "dn4:23.6.8.4": "‘ahaṁ kho pubbe ābādhiko ahosiṁ dukkhito bāḷhagilāno; ",
  "dn4:23.6.8.5": "bhattañca me nacchādesi, na ca me āsi kāye balamattā. ",
  "dn4:23.6.8.6": "Somhi etarahi tamhā ābādhā mutto; ",
  "dn4:23.6.8.7": "bhattañca me chādeti, atthi ca me kāye balamattā’ti. ",
  "dn4:23.6.8.8": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn4:23.6.9.1": "Seyyathāpi, mahārāja, puriso bandhanāgāre baddho assa. ",
  "dn4:23.6.9.2": "So aparena samayena tamhā bandhanāgārā mucceyya sotthinā abbhayena, na cassa kiñci bhogānaṁ vayo. ",
  "dn4:23.6.9.3": "Tassa evamassa: ",
  "dn4:23.6.9.4": "‘ahaṁ kho pubbe bandhanāgāre baddho ahosiṁ, somhi etarahi tamhā bandhanāgārā mutto sotthinā abbhayena. ",
  "dn4:23.6.9.5": "Natthi ca me kiñci bhogānaṁ vayo’ti. ",
  "dn4:23.6.9.6": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn4:23.6.10.1": "Seyyathāpi, mahārāja, puriso dāso assa anattādhīno parādhīno na yenakāmaṅgamo. ",
  "dn4:23.6.10.2": "So aparena samayena tamhā dāsabyā mucceyya attādhīno aparādhīno bhujisso yenakāmaṅgamo. ",
  "dn4:23.6.10.3": "Tassa evamassa: ",
  "dn4:23.6.10.4": "‘ahaṁ kho pubbe dāso ahosiṁ anattādhīno parādhīno na yenakāmaṅgamo. ",
  "dn4:23.6.10.5": "Somhi etarahi tamhā dāsabyā mutto attādhīno aparādhīno bhujisso yenakāmaṅgamo’ti. ",
  "dn4:23.6.10.6": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn4:23.6.11.1": "Seyyathāpi, mahārāja, puriso sadhano sabhogo kantāraddhānamaggaṁ paṭipajjeyya dubbhikkhaṁ sappaṭibhayaṁ. ",
  "dn4:23.6.11.2": "So aparena samayena taṁ kantāraṁ nitthareyya sotthinā, gāmantaṁ anupāpuṇeyya khemaṁ appaṭibhayaṁ. ",
  "dn4:23.6.11.3": "Tassa evamassa: ",
  "dn4:23.6.11.4": "‘ahaṁ kho pubbe sadhano sabhogo kantāraddhānamaggaṁ paṭipajjiṁ dubbhikkhaṁ sappaṭibhayaṁ. ",
  "dn4:23.6.11.5": "Somhi etarahi taṁ kantāraṁ nitthiṇṇo sotthinā, gāmantaṁ anuppatto khemaṁ appaṭibhayan’ti. ",
  "dn4:23.6.11.6": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn4:23.6.12.1": "Evameva kho, mahārāja, bhikkhu yathā iṇaṁ yathā rogaṁ yathā bandhanāgāraṁ yathā dāsabyaṁ yathā kantāraddhānamaggaṁ, evaṁ ime pañca nīvaraṇe appahīne attani samanupassati. ",
  "dn4:23.6.12.2": "Seyyathāpi, mahārāja, yathā āṇaṇyaṁ yathā ārogyaṁ yathā bandhanāmokkhaṁ yathā bhujissaṁ yathā khemantabhūmiṁ; ",
  "dn4:23.6.12.3": "evameva kho, mahārāja, bhikkhu ime pañca nīvaraṇe pahīne attani samanupassati. ",
  "dn4:23.6.12.4": "Tassime pañca nīvaraṇe pahīne attani samanupassato pāmojjaṁ jāyati, pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṁ vedeti, sukhino cittaṁ samādhiyati. ",
  "dn4:23.6.13.0": "6.2.5. Paṭhamajhāna ",
  "dn4:23.7": "So vivicceva kāmehi, vivicca akusalehi dhammehi savitakkaṁ savicāraṁ vivekajaṁ pītisukhaṁ paṭhamaṁ jhānaṁ upasampajja viharati. ",
  "dn4:23.7.1.2": "So imameva kāyaṁ vivekajena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa vivekajena pītisukhena apphuṭaṁ hoti. ",
  "dn4:23.7.2.1": "Seyyathāpi, mahārāja, dakkho nhāpako vā nhāpakantevāsī vā kaṁsathāle nhānīyacuṇṇāni ākiritvā udakena paripphosakaṁ paripphosakaṁ sanneyya, sāyaṁ nhānīyapiṇḍi snehānugatā snehaparetā santarabāhirā phuṭā snehena, na ca paggharaṇī; ",
  "dn4:23.7.2.2": "evameva kho, mahārāja, bhikkhu imameva kāyaṁ vivekajena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa vivekajena pītisukhena apphuṭaṁ hoti. ",
  "dn4:23.7.2.3": "Idampissa hoti paññāya ",
  "dn4:23.7.3.0": "6.2.6. Dutiyajhāna ",
  "dn4:23.8": "Puna caparaṁ, mahārāja, bhikkhu vitakkavicārānaṁ vūpasamā ajjhattaṁ sampasādanaṁ cetaso ekodibhāvaṁ avitakkaṁ avicāraṁ samādhijaṁ pītisukhaṁ dutiyaṁ jhānaṁ upasampajja viharati. ",
  "dn4:23.8.1.2": "So imameva kāyaṁ samādhijena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa samādhijena pītisukhena apphuṭaṁ hoti. ",
  "dn4:23.8.2.1": "Seyyathāpi, mahārāja, udakarahado gambhīro ubbhidodako tassa nevassa puratthimāya disāya udakassa āyamukhaṁ, na dakkhiṇāya disāya udakassa āyamukhaṁ, na pacchimāya disāya udakassa āyamukhaṁ, na uttarāya disāya udakassa āyamukhaṁ, devo ca na kālena kālaṁ sammādhāraṁ anuppaveccheyya. ",
  "dn4:23.8.2.2": "Atha kho tamhāva udakarahadā sītā vāridhārā ubbhijjitvā tameva udakarahadaṁ sītena vārinā abhisandeyya parisandeyya paripūreyya paripphareyya, nāssa kiñci sabbāvato udakarahadassa sītena vārinā apphuṭaṁ assa. ",
  "dn4:23.8.2.3": "Evameva kho, mahārāja, bhikkhu imameva kāyaṁ samādhijena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa samādhijena pītisukhena apphuṭaṁ hoti. ",
  "dn4:23.8.2.4": "Idampissa hoti paññāya ",
  "dn4:23.8.3.0": "6.2.7. Tatiyajhāna ",
  "dn4:23.9": "Puna caparaṁ, mahārāja, bhikkhu pītiyā ca virāgā upekkhako ca viharati sato sampajāno, sukhañca kāyena paṭisaṁvedeti, yaṁ taṁ ariyā ācikkhanti: ‘upekkhako satimā sukhavihārī’ti, tatiyaṁ jhānaṁ upasampajja viharati. ",
  "dn4:23.9.1.2": "So imameva kāyaṁ nippītikena sukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa nippītikena sukhena apphuṭaṁ hoti. ",
  "dn4:23.9.2.1": "Seyyathāpi, mahārāja, uppaliniyaṁ vā paduminiyaṁ vā puṇḍarīkiniyaṁ vā appekaccāni uppalāni vā padumāni vā puṇḍarīkāni vā udake jātāni udake saṁvaḍḍhāni udakānuggatāni antonimuggaposīni, tāni yāva caggā yāva ca mūlā sītena vārinā abhisannāni parisannāni paripūrāni paripphuṭāni, nāssa kiñci sabbāvataṁ uppalānaṁ vā padumānaṁ vā puṇḍarīkānaṁ vā sītena vārinā apphuṭaṁ assa; ",
  "dn4:23.9.2.2": "evameva kho, mahārāja, bhikkhu imameva kāyaṁ nippītikena sukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa nippītikena sukhena apphuṭaṁ hoti. ",
  "dn4:23.9.2.3": "Idampissa hoti paññāya ",
  "dn4:23.9.3.0": "6.2.8. Catutthajhāna ",
  "dn4:23.10": "Puna caparaṁ, mahārāja, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā, pubbeva somanassadomanassānaṁ atthaṅgamā adukkhamasukhaṁ upekkhāsatipārisuddhiṁ catutthaṁ jhānaṁ upasampajja viharati. ",
  "dn4:23.10.1.2": "So imameva kāyaṁ parisuddhena cetasā pariyodātena pharitvā nisinno hoti, nāssa kiñci sabbāvato kāyassa parisuddhena cetasā pariyodātena apphuṭaṁ hoti. ",
  "dn4:23.10.2.1": "Seyyathāpi, mahārāja, puriso odātena vatthena sasīsaṁ pārupitvā nisinno assa, nāssa kiñci sabbāvato kāyassa odātena vatthena apphuṭaṁ assa; ",
  "dn4:23.10.2.2": "evameva kho, mahārāja, bhikkhu imameva kāyaṁ parisuddhena cetasā pariyodātena pharitvā nisinno hoti, nāssa kiñci sabbāvato kāyassa parisuddhena cetasā pariyodātena apphuṭaṁ hoti. ",
  "dn4:23.10.2.3": "Idampissa hoti paññāya ",
  "dn4:23.10.3.0.1": "6.3. Aṭṭhañāṇa ",
  "dn4:23.10.3.0.2": "6.3.1. Vipassanāñāṇa ",
  "dn4:23.11": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte ñāṇadassanāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn4:23.11.1.2": "So evaṁ pajānāti: ",
  "dn4:23.11.1.3": "‘ayaṁ kho me kāyo rūpī cātumahābhūtiko mātāpettikasambhavo odanakummāsūpacayo aniccucchādanaparimaddanabhedanaviddhaṁsanadhammo; ",
  "dn4:23.11.1.4": "idañca pana me viññāṇaṁ ettha sitaṁ ettha paṭibaddhan’ti. ",
  "dn4:23.11.2.1": "Seyyathāpi, mahārāja, maṇi veḷuriyo subho jātimā aṭṭhaṁso suparikammakato accho vippasanno anāvilo sabbākārasampanno. ",
  "dn4:23.11.2.2": "Tatrāssa suttaṁ āvutaṁ nīlaṁ vā pītaṁ vā lohitaṁ vā odātaṁ vā paṇḍusuttaṁ vā. ",
  "dn4:23.11.2.3": "Tamenaṁ cakkhumā puriso hatthe karitvā paccavekkheyya: ",
  "dn4:23.11.2.4": "‘ayaṁ kho maṇi veḷuriyo subho jātimā aṭṭhaṁso suparikammakato accho vippasanno anāvilo sabbākārasampanno; ",
  "dn4:23.11.2.5": "tatridaṁ suttaṁ āvutaṁ nīlaṁ vā pītaṁ vā lohitaṁ vā odātaṁ vā paṇḍusuttaṁ vā’ti. ",
  "dn4:23.11.2.6": "Evameva kho, mahārāja, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte ñāṇadassanāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn4:23.11.2.7": "So evaṁ pajānāti: ",
  "dn4:23.11.2.8": "‘ayaṁ kho me kāyo rūpī cātumahābhūtiko mātāpettikasambhavo odanakummāsūpacayo aniccucchādanaparimaddanabhedanaviddhaṁsanadhammo; ",
  "dn4:23.11.2.9": "idañca pana me viññāṇaṁ ettha sitaṁ ettha paṭibaddhan’ti. ",
  "dn4:23.11.2.10": "Idampissa hoti paññāya ",
  "dn4:23.11.3.0": "6.3.2. Manomayiddhiñāṇa ",
  "dn4:23.11.3.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte manomayaṁ kāyaṁ abhinimmānāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn4:23.11.3.2": "So imamhā kāyā aññaṁ kāyaṁ abhinimmināti rūpiṁ manomayaṁ sabbaṅgapaccaṅgiṁ ahīnindriyaṁ. ",
  "dn4:23.11.4.1": "Seyyathāpi, mahārāja, puriso muñjamhā īsikaṁ pavāheyya. ",
  "dn4:23.11.4.2": "Tassa evamassa: ",
  "dn4:23.11.4.3": "‘ayaṁ muñjo, ayaṁ īsikā, añño muñjo, aññā īsikā, muñjamhā tveva īsikā pavāḷhā’ti. ",
  "dn4:23.11.4.4": "Seyyathā vā pana, mahārāja, puriso asiṁ kosiyā pavāheyya. ",
  "dn4:23.11.4.5": "Tassa evamassa: ",
  "dn4:23.11.4.6": "‘ayaṁ asi, ayaṁ kosi, añño asi, aññā kosi, kosiyā tveva asi pavāḷho’ti. ",
  "dn4:23.11.4.7": "Seyyathā vā pana, mahārāja, puriso ahiṁ karaṇḍā uddhareyya. ",
  "dn4:23.11.4.8": "Tassa evamassa: ",
  "dn4:23.11.4.9": "‘ayaṁ ahi, ayaṁ karaṇḍo. Añño ahi, añño karaṇḍo, karaṇḍā tveva ahi ubbhato’ti. ",
  "dn4:23.11.4.10": "Evameva kho, mahārāja, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte manomayaṁ kāyaṁ abhinimmānāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn4:23.11.4.11": "So imamhā kāyā aññaṁ kāyaṁ abhinimmināti rūpiṁ manomayaṁ sabbaṅgapaccaṅgiṁ ahīnindriyaṁ. ",
  "dn4:23.11.4.12": "Idampissa hoti paññāya ",
  "dn4:23.11.5.0": "6.3.3. Iddhividhañāṇa ",
  "dn4:23.11.5.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte iddhividhāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn4:23.11.5.2": "So anekavihitaṁ iddhividhaṁ paccanubhoti—ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti; āvibhāvaṁ tirobhāvaṁ tirokuṭṭaṁ tiropākāraṁ tiropabbataṁ asajjamāno gacchati seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṁ karoti seyyathāpi udake; udakepi abhijjamāne gacchati seyyathāpi pathaviyā; ākāsepi pallaṅkena kamati seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṁmahiddhike evaṁmahānubhāve pāṇinā parāmasati parimajjati; yāva brahmalokāpi kāyena vasaṁ vatteti. ",
  "dn4:23.11.6.1": "Seyyathāpi, mahārāja, dakkho kumbhakāro vā kumbhakārantevāsī vā suparikammakatāya mattikāya yaṁ yadeva bhājanavikatiṁ ākaṅkheyya, taṁ tadeva kareyya abhinipphādeyya. ",
  "dn4:23.11.6.2": "Seyyathā vā pana, mahārāja, dakkho dantakāro vā dantakārantevāsī vā suparikammakatasmiṁ dantasmiṁ yaṁ yadeva dantavikatiṁ ākaṅkheyya, taṁ tadeva kareyya abhinipphādeyya. ",
  "dn4:23.11.6.3": "Seyyathā vā pana, mahārāja, dakkho suvaṇṇakāro vā suvaṇṇakārantevāsī vā suparikammakatasmiṁ suvaṇṇasmiṁ yaṁ yadeva suvaṇṇavikatiṁ ākaṅkheyya, taṁ tadeva kareyya abhinipphādeyya. ",
  "dn4:23.11.6.4": "Evameva kho, mahārāja, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte iddhividhāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn4:23.11.6.5": "So anekavihitaṁ iddhividhaṁ paccanubhoti—ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti; āvibhāvaṁ tirobhāvaṁ tirokuṭṭaṁ tiropākāraṁ tiropabbataṁ asajjamāno gacchati seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṁ karoti seyyathāpi udake; udakepi abhijjamāne gacchati seyyathāpi pathaviyā; ākāsepi pallaṅkena kamati seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṁmahiddhike evaṁmahānubhāve pāṇinā parāmasati parimajjati; yāva brahmalokāpi kāyena vasaṁ vatteti. ",
  "dn4:23.11.6.6": "Idampissa hoti paññāya ",
  "dn4:23.11.7.0": "6.3.4. Dibbasotañāṇa ",
  "dn4:23.11.7.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte dibbāya sotadhātuyā cittaṁ abhinīharati abhininnāmeti. ",
  "dn4:23.11.7.2": "So dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇāti dibbe ca mānuse ca ye dūre santike ca. ",
  "dn4:23.11.8.1": "Seyyathāpi, mahārāja, puriso addhānamaggappaṭipanno. So suṇeyya bherisaddampi mudiṅgasaddampi saṅkhapaṇavadindimasaddampi. Tassa evamassa: ‘bherisaddo’ itipi, ‘mudiṅgasaddo’ itipi, ‘saṅkhapaṇavadindimasaddo’ itipi. ",
  "dn4:23.11.8.2": "Evameva kho, mahārāja, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte dibbāya sotadhātuyā cittaṁ abhinīharati abhininnāmeti. ",
  "dn4:23.11.8.3": "So dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇāti dibbe ca mānuse ca ye dūre santike ca. ",
  "dn4:23.11.8.4": "Idampissa hoti paññāya ",
  "dn4:23.11.9.0": "6.3.5. Cetopariyañāṇa ",
  "dn4:23.11.9.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte cetopariyañāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn4:23.11.9.2": "So parasattānaṁ parapuggalānaṁ cetasā ceto paricca pajānāti—",
  "dn4:23.11.9.3": "sarāgaṁ vā cittaṁ ‘sarāgaṁ cittan’ti pajānāti, ",
  "dn4:23.11.9.4": "vītarāgaṁ vā cittaṁ ‘vītarāgaṁ cittan’ti pajānāti, ",
  "dn4:23.11.9.5": "sadosaṁ vā cittaṁ ‘sadosaṁ cittan’ti pajānāti, ",
  "dn4:23.11.9.6": "vītadosaṁ vā cittaṁ ‘vītadosaṁ cittan’ti pajānāti, ",
  "dn4:23.11.9.7": "samohaṁ vā cittaṁ ‘samohaṁ cittan’ti pajānāti, ",
  "dn4:23.11.9.8": "vītamohaṁ vā cittaṁ ‘vītamohaṁ cittan’ti pajānāti, ",
  "dn4:23.11.9.9": "saṅkhittaṁ vā cittaṁ ‘saṅkhittaṁ cittan’ti pajānāti, ",
  "dn4:23.11.9.10": "vikkhittaṁ vā cittaṁ ‘vikkhittaṁ cittan’ti pajānāti, ",
  "dn4:23.11.9.11": "mahaggataṁ vā cittaṁ ‘mahaggataṁ cittan’ti pajānāti, ",
  "dn4:23.11.9.12": "amahaggataṁ vā cittaṁ ‘amahaggataṁ cittan’ti pajānāti, ",
  "dn4:23.11.9.13": "sauttaraṁ vā cittaṁ ‘sauttaraṁ cittan’ti pajānāti, ",
  "dn4:23.11.9.14": "anuttaraṁ vā cittaṁ ‘anuttaraṁ cittan’ti pajānāti, ",
  "dn4:23.11.9.15": "samāhitaṁ vā cittaṁ ‘samāhitaṁ cittan’ti pajānāti, ",
  "dn4:23.11.9.16": "asamāhitaṁ vā cittaṁ ‘asamāhitaṁ cittan’ti pajānāti, ",
  "dn4:23.11.9.17": "vimuttaṁ vā cittaṁ ‘vimuttaṁ cittan’ti pajānāti, ",
  "dn4:23.11.9.18": "avimuttaṁ vā cittaṁ ‘avimuttaṁ cittan’ti pajānāti. ",
  "dn4:23.11.10.1": "Seyyathāpi, mahārāja, itthī vā puriso vā daharo yuvā maṇḍanajātiko ādāse vā parisuddhe pariyodāte acche vā udakapatte sakaṁ mukhanimittaṁ paccavekkhamāno sakaṇikaṁ vā ‘sakaṇikan’ti jāneyya, akaṇikaṁ vā ‘akaṇikan’ti jāneyya; ",
  "dn4:23.11.10.2": "evameva kho, mahārāja, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte cetopariyañāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn4:23.11.10.3": "So parasattānaṁ parapuggalānaṁ cetasā ceto paricca pajānāti—",
  "dn4:23.11.10.20": "Idampissa hoti paññāya ",
  "dn4:23.11.11.0": "6.3.6. Pubbenivāsānussatiñāṇa ",
  "dn4:23.11.11.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn4:23.11.11.2": "So anekavihitaṁ pubbenivāsaṁ anussarati, seyyathidaṁ—ekampi jātiṁ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṁsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṁvaṭṭakappe anekepi vivaṭṭakappe anekepi saṁvaṭṭavivaṭṭakappe, ‘amutrāsiṁ evaṁnāmo evaṅgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhappaṭisaṁvedī evamāyupariyanto, so tato cuto amutra udapādiṁ; tatrāpāsiṁ evaṁnāmo evaṅgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhappaṭisaṁvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṁ sauddesaṁ anekavihitaṁ pubbenivāsaṁ anussarati. ",
  "dn4:23.11.12.": "Idampissa hoti paññāya ",
  "dn4:23.11.12.1": "Seyyathāpi, mahārāja, puriso sakamhā gāmā aññaṁ gāmaṁ gaccheyya, tamhāpi gāmā aññaṁ gāmaṁ gaccheyya. So tamhā gāmā sakaṁyeva gāmaṁ paccāgaccheyya. Tassa evamassa: ‘ahaṁ kho sakamhā gāmā amuṁ gāmaṁ agacchiṁ, tatra evaṁ aṭṭhāsiṁ, evaṁ nisīdiṁ, evaṁ abhāsiṁ, evaṁ tuṇhī ahosiṁ, tamhāpi gāmā amuṁ gāmaṁ agacchiṁ, tatrāpi evaṁ aṭṭhāsiṁ, evaṁ nisīdiṁ, evaṁ abhāsiṁ, evaṁ tuṇhī ahosiṁ, somhi tamhā gāmā sakaṁyeva gāmaṁ paccāgato’ti. ",
  "dn4:23.11.12.2": "Evameva kho, mahārāja, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn4:23.11.12.3": "So anekavihitaṁ pubbenivāsaṁ anussarati, seyyathidaṁ—ekampi jātiṁ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṁsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṁvaṭṭakappe anekepi vivaṭṭakappe anekepi saṁvaṭṭavivaṭṭakappe, ‘amutrāsiṁ evaṁnāmo evaṅgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhappaṭisaṁvedī evamāyupariyanto, so tato cuto amutra udapādiṁ; tatrāpāsiṁ evaṁnāmo evaṅgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhappaṭisaṁvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṁ sauddesaṁ anekavihitaṁ pubbenivāsaṁ anussarati. ",
  "dn4:23.11.13.0": "6.3.7. Dibbacakkhuñāṇa ",
  "dn4:23.11.13.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte sattānaṁ cutūpapātañāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn4:23.11.13.2": "So dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate, yathākammūpage satte pajānāti: ‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṁ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā. Te kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapannā. Ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṁ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate, yathākammūpage satte pajānāti. ",
  "dn4:23.11.14.1": "Seyyathāpi, mahārāja, majjhe siṅghāṭake pāsādo. Tattha cakkhumā puriso ṭhito passeyya manusse gehaṁ pavisantepi nikkhamantepi rathikāyapi vīthiṁ sañcarante majjhe siṅghāṭake nisinnepi. Tassa evamassa: ‘ete manussā gehaṁ pavisanti, ete nikkhamanti, ete rathikāya vīthiṁ sañcaranti, ete majjhe siṅghāṭake nisinnā’ti. ",
  "dn4:23.11.14.2": "Evameva kho, mahārāja, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte sattānaṁ cutūpapātañāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn4:23.11.14.3": "So dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate, yathākammūpage satte pajānāti: ‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṁ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā, te kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapannā. Ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṁ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā. Te kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate; yathākammūpage satte pajānāti. ",
  "dn4:23.11.14.4": "Idampissa hoti paññāya ",
  "dn4:23.11.15.0": "6.3.8. Āsavakkhayañāṇa ",
  "dn4:23.11.15.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṁ khayañāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn4:23.11.15.2": "So idaṁ dukkhanti yathābhūtaṁ pajānāti, ayaṁ dukkhasamudayoti yathābhūtaṁ pajānāti, ayaṁ dukkhanirodhoti yathābhūtaṁ pajānāti, ayaṁ dukkhanirodhagāminī paṭipadāti yathābhūtaṁ pajānāti. ",
  "dn4:23.11.15.3": "Ime āsavāti yathābhūtaṁ pajānāti, ayaṁ āsavasamudayoti yathābhūtaṁ pajānāti, ayaṁ āsavanirodhoti yathābhūtaṁ pajānāti, ayaṁ āsavanirodhagāminī paṭipadāti yathābhūtaṁ pajānāti. ",
  "dn4:23.11.15.4": "Tassa evaṁ jānato evaṁ passato kāmāsavāpi cittaṁ vimuccati, bhavāsavāpi cittaṁ vimuccati, avijjāsavāpi cittaṁ vimuccati, ",
  "dn4:23.11.15.5": "vimuttasmiṁ ‘vimuttam’iti ñāṇaṁ hoti, ",
  "dn4:23.12": "Idampissa hoti paññāya …pe… ",
  "dn4:23.13": "‘khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānāti. ",
  "dn4:23.13.1.1": "Seyyathāpi, mahārāja, pabbatasaṅkhepe udakarahado accho vippasanno anāvilo. Tattha cakkhumā puriso tīre ṭhito passeyya sippisambukampi sakkharakathalampi macchagumbampi carantampi tiṭṭhantampi. Tassa evamassa: ‘ayaṁ kho udakarahado accho vippasanno anāvilo. Tatrime sippisambukāpi sakkharakathalāpi macchagumbāpi carantipi tiṭṭhantipī’ti. ",
  "dn4:23.13.1.2": "Evameva kho, mahārāja, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṁ khayañāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn4:23.14": "Idampissa hoti paññāya ",
  "dn4:23.15": "ayaṁ kho sā, brāhmaṇa, paññā”ti. ",
  "dn4:24.0": "7. Soṇadaṇḍaupāsakattapaṭivedanā ",
  "dn4:24.1": "Evaṁ vutte, soṇadaṇḍo brāhmaṇo bhagavantaṁ etadavoca: ",
  "dn4:24.2": "“abhikkantaṁ, bho gotama, abhikkantaṁ, bho gotama. ",
  "dn4:24.3": "Seyyathāpi, bho gotama, nikkujjitaṁ vā ukkujjeyya, paṭicchannaṁ vā vivareyya, mūḷhassa vā maggaṁ ācikkheyya, andhakāre vā telapajjotaṁ dhāreyya: ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṁ bhotā gotamena anekapariyāyena dhammo pakāsito. ",
  "dn4:24.4": "Esāhaṁ bhavantaṁ gotamaṁ saraṇaṁ gacchāmi, dhammañca, bhikkhusaṅghañca. ",
  "dn4:24.5": "Upāsakaṁ maṁ bhavaṁ gotamo dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gataṁ. ",
  "dn4:24.6": "Adhivāsetu ca me bhavaṁ gotamo svātanāya bhattaṁ saddhiṁ bhikkhusaṅghenā”ti. ",
  "dn4:24.7": "Adhivāsesi bhagavā tuṇhībhāvena. ",
  "dn4:24.8": "Atha kho soṇadaṇḍo brāhmaṇo bhagavato adhivāsanaṁ viditvā uṭṭhāyāsanā bhagavantaṁ abhivādetvā padakkhiṇaṁ katvā pakkāmi. ",
  "dn4:24.9": "Atha kho soṇadaṇḍo brāhmaṇo tassā rattiyā accayena sake nivesane paṇītaṁ khādanīyaṁ bhojanīyaṁ paṭiyādāpetvā bhagavato kālaṁ ārocāpesi: ",
  "dn4:24.10": "“kālo, bho gotama, niṭṭhitaṁ bhattan”ti. ",
  "dn4:25.1": "Atha kho bhagavā pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya saddhiṁ bhikkhusaṅghena yena soṇadaṇḍassa brāhmaṇassa nivesanaṁ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. ",
  "dn4:25.2": "Atha kho soṇadaṇḍo brāhmaṇo buddhappamukhaṁ bhikkhusaṅghaṁ paṇītena khādanīyena bhojanīyena sahatthā santappesi sampavāresi. ",
  "dn4:26.1": "Atha kho soṇadaṇḍo brāhmaṇo bhagavantaṁ bhuttāviṁ onītapattapāṇiṁ aññataraṁ nīcaṁ āsanaṁ gahetvā ekamantaṁ nisīdi. ",
  "dn4:26.2": "Ekamantaṁ nisinno kho soṇadaṇḍo brāhmaṇo bhagavantaṁ etadavoca: ",
  "dn4:26.3": "“ahañceva kho pana, bho gotama, parisagato samāno āsanā vuṭṭhahitvā bhavantaṁ gotamaṁ abhivādeyyaṁ, tena maṁ sā parisā paribhaveyya. ",
  "dn4:26.4": "Yaṁ kho pana sā parisā paribhaveyya, yasopi tassa hāyetha. ",
  "dn4:26.5": "Yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṁ. ",
  "dn4:26.6": "Yasoladdhā kho panamhākaṁ bhogā. ",
  "dn4:26.7": "Ahañceva kho pana, bho gotama, parisagato samāno añjaliṁ paggaṇheyyaṁ, āsanā me taṁ bhavaṁ gotamo paccuṭṭhānaṁ dhāretu. ",
  "dn4:26.8": "Ahañceva kho pana, bho gotama, parisagato samāno veṭhanaṁ omuñceyyaṁ, sirasā me taṁ bhavaṁ gotamo abhivādanaṁ dhāretu. ",
  "dn4:26.9": "Ahañceva kho pana, bho gotama, yānagato samāno yānā paccorohitvā bhavantaṁ gotamaṁ abhivādeyyaṁ, tena maṁ sā parisā paribhaveyya. ",
  "dn4:26.10": "Yaṁ kho pana sā parisā paribhaveyya, yasopi tassa hāyetha, yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṁ. ",
  "dn4:26.11": "Yasoladdhā kho panamhākaṁ bhogā. ",
  "dn4:26.12": "Ahañceva kho pana, bho gotama, yānagato samāno patodalaṭṭhiṁ abbhunnāmeyyaṁ, yānā me taṁ bhavaṁ gotamo paccorohanaṁ dhāretu. ",
  "dn4:26.13": "Ahañceva kho pana, bho gotama, yānagato samāno chattaṁ apanāmeyyaṁ, sirasā me taṁ bhavaṁ gotamo abhivādanaṁ dhāretū”ti. ",
  "dn4:27.1": "Atha kho bhagavā soṇadaṇḍaṁ brāhmaṇaṁ dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṁsetvā uṭṭhāyāsanā pakkāmīti. ",
  "dn4:27.2": "Soṇadaṇḍasuttaṁ niṭṭhitaṁ catutthaṁ. "
}