{
  "dn4:0.1": "Long Discourses 4 ",
  "dn4:0.2": "With Soṇadaṇḍa ",
  "dn4:1.0": "1. The Brahmins and Householders of Campā ",
  "dn4:1.1": "So I have heard. ",
  "dn4:1.2": "At one time the Buddha was wandering in the land of the Aṅgas together with a large Saṅgha of five hundred mendicants when he arrived at Campā, ",
  "dn4:1.3": "where he stayed by the banks of the Gaggarā Lotus Pond. ",
  "dn4:1.4": "Now at that time the brahmin Soṇadaṇḍa was living in Campā. It was a crown property given by King Seniya Bimbisāra of Magadha, teeming with living creatures, full of hay, wood, water, and grain, a royal park endowed to a brahmin. ",
  "dn4:2.1": "The brahmins and householders of Campā heard: ",
  "dn4:2.2": "“It seems the ascetic Gotama—a Sakyan, gone forth from a Sakyan family—has arrived at Campā and is staying on the banks of the Gaggarā Lotus Pond. ",
  "dn4:2.3": "He has this good reputation: ",
  "dn4:2.4": "‘That Blessed One is perfected, a fully awakened Buddha, accomplished in knowledge and conduct, holy, knower of the world, supreme guide for those who wish to train, teacher of gods and humans, awakened, blessed.’ ",
  "dn4:2.5": "He has realized with his own insight this world—with its gods, Māras, and divinities, this population with its ascetics and brahmins, gods and humans—and he makes it known to others. ",
  "dn4:2.6": "He proclaims a teaching that is good in the beginning, good in the middle, and good in the end, meaningful and well-phrased. And he reveals a spiritual practice that’s entirely full and pure. ",
  "dn4:2.7": "It’s good to see such perfected ones.” ",
  "dn4:2.8": "Then, having departed Campā, they formed into companies and headed to the Gaggarā Lotus Pond. ",
  "dn4:3.1": "Now at that time the brahmin Soṇadaṇḍa had retired to the upper floor of his stilt longhouse for his midday nap. ",
  "dn4:3.2": "He saw the brahmins and householders heading for the lotus pond, ",
  "dn4:3.3": "and addressed his butler, ",
  "dn4:3.4": "“My butler, why are the brahmins and householders headed for the Gaggarā Lotus Pond?” ",
  "dn4:3.5": "“The ascetic Gotama has arrived at Campā and is staying on the banks of the Gaggarā Lotus Pond. ",
  "dn4:3.6": "He has this good reputation: ",
  "dn4:3.7": "‘That Blessed One is perfected, a fully awakened Buddha, accomplished in knowledge and conduct, holy, knower of the world, supreme guide for those who wish to train, teacher of gods and humans, awakened, blessed.’ ",
  "dn4:3.8": "They’re going to see that worthy Gotama.” ",
  "dn4:3.9": "“Well then, go to the brahmins and householders and say to them: ",
  "dn4:3.10": "‘Sirs, the brahmin Soṇadaṇḍa asks ",
  "dn4:3.11": "you to wait, as he will also go to see the ascetic Gotama.’” ",
  "dn4:3.12": "“Yes, worthy sir,” replied the butler, and did as he was asked. ",
  "dn4:3.13": "",
  "dn4:3.14": "",
  "dn4:4.0": "2. The Qualities of Soṇadaṇḍa ",
  "dn4:4.1": "Now at that time around five hundred brahmins from abroad were residing in Campā on some business. ",
  "dn4:4.2": "They heard that ",
  "dn4:4.3": "the brahmin Soṇadaṇḍa was going to see the ascetic Gotama. ",
  "dn4:4.4": "They approached Soṇadaṇḍa and said to him, ",
  "dn4:4.5": "“Is it really true that you are going to see the ascetic Gotama?” ",
  "dn4:4.6": "“Yes, gentlemen, it is true.” ",
  "dn4:4.7": "",
  "dn4:5.1": "“Please don’t, worthy Soṇadaṇḍa! ",
  "dn4:5.2": "It’s not appropriate for you to go to see the ascetic Gotama. ",
  "dn4:5.3": "For if you do so, your reputation will diminish and his will increase. ",
  "dn4:5.4": "For this reason it’s not appropriate for you to go to see the ascetic Gotama; ",
  "dn4:5.5": "it’s appropriate that he comes to see you. ",
  "dn4:5.6": "You are well born on both your mother’s and father’s side, of pure descent, with irrefutable and impeccable genealogy back to the seventh paternal generation. ",
  "dn4:5.7": "For this reason it’s not appropriate for you to go to see the ascetic Gotama; ",
  "dn4:5.8": "it’s appropriate that he comes to see you. ",
  "dn4:5.9": "You’re rich, affluent, and wealthy. … ",
  "dn4:5.10": "You recite and remember the hymns, and have mastered the three Vedas, together with their vocabularies and ritual performance, their phonology and word classification, and the testaments as fifth. You know them word-by-word, and their grammar. You are well versed in cosmology and the marks of a great man. … ",
  "dn4:5.11": "You are attractive, good-looking, lovely, of surpassing beauty. You are magnificent and splendid as the Divinity, remarkable to behold. … ",
  "dn4:5.12": "You are ethical, mature in ethical conduct. … ",
  "dn4:5.13": "You’re a good speaker who enunciates well, with a polished, clear, and articulate voice that expresses the meaning. … ",
  "dn4:5.14": "You tutor the tutors of many, and teach three hundred young students to recite the hymns. Many students come from various districts and countries for the sake of the hymns, wishing to learn the hymns. … ",
  "dn4:5.15": "You’re old, elderly and senior, advanced in years, and have reached the final stage of life. ",
  "dn4:5.16": "The ascetic Gotama is young, and has newly gone forth. … ",
  "dn4:5.17": "You’re honored, respected, revered, venerated, and esteemed by King Bimbisāra of Magadha … ",
  "dn4:5.18": "and the brahmin Pokkharasāti. … ",
  "dn4:5.19": "You live in Campā, a crown property given by King Seniya Bimbisāra of Magadha, teeming with living creatures, full of hay, wood, water, and grain, a royal park endowed to a brahmin. ",
  "dn4:5.20": "",
  "dn4:5.21": "For this reason, too, it’s not appropriate for you to go to see the ascetic Gotama; ",
  "dn4:5.22": "it’s appropriate that he comes to see you.” ",
  "dn4:6.0": "3. The Qualities of the Buddha ",
  "dn4:6.1": "When they had spoken, Soṇadaṇḍa said to those brahmins: ",
  "dn4:6.2": "“Well then, gentlemen, listen to why it’s appropriate for me to go to see the ascetic Gotama, ",
  "dn4:6.3": "and it’s not appropriate for him to come to see me. ",
  "dn4:6.4": "He is well born on both his mother’s and father’s side, of pure descent, with irrefutable and impeccable genealogy back to the seventh paternal generation. ",
  "dn4:6.5": "For this reason it’s not appropriate for the ascetic Gotama to come to see me; ",
  "dn4:6.6": "rather, it’s appropriate for me to go to see him. ",
  "dn4:6.7": "When he went forth he abandoned a large family circle. … ",
  "dn4:6.8": "When he went forth he abandoned abundant gold, both coined and uncoined, stored above and below ground. … ",
  "dn4:6.9": "He went forth from the lay life to homelessness while still a youth, young, with pristine black hair, blessed with youth, in the prime of life. … ",
  "dn4:6.10": "Though his mother and father wished otherwise, weeping with tearful faces, he shaved off his hair and beard, dressed in ocher robes, and went forth from the lay life to homelessness. … ",
  "dn4:6.11": "He is attractive, good-looking, lovely, of surpassing beauty. He is magnificent and splendid as the Divinity, remarkable to behold. … ",
  "dn4:6.12": "He is ethical, possessing ethical conduct that is noble and skillful. … ",
  "dn4:6.13": "He’s a good speaker who enunciates well, with a polished, clear, and articulate voice that expresses the meaning. … ",
  "dn4:6.14": "He’s a tutor of tutors. … ",
  "dn4:6.15": "He has ended sensual desire, and is rid of caprice. … ",
  "dn4:6.16": "He teaches the efficacy of deeds and action. He doesn’t wish any harm upon the community of brahmins. … ",
  "dn4:6.17": "He went forth from an eminent family of unbroken aristocratic lineage. … ",
  "dn4:6.18": "He went forth from a rich, affluent, and wealthy family. … ",
  "dn4:6.19": "People come from distant lands and distant countries to question him. … ",
  "dn4:6.20": "Many thousands of deities have gone for refuge for life to him. … ",
  "dn4:6.21": "He has this good reputation: ",
  "dn4:6.22": "‘That Blessed One is perfected, a fully awakened Buddha, accomplished in knowledge and conduct, holy, knower of the world, supreme guide for those who wish to train, teacher of gods and humans, awakened, blessed.’ … ",
  "dn4:6.23": "He has the thirty-two marks of a great man. … ",
  "dn4:6.24": "He is welcoming, congenial, polite, smiling, open, the first to speak. … ",
  "dn4:6.25": "He’s honored, respected, revered, venerated, and esteemed by the four assemblies. … ",
  "dn4:6.26": "Many gods and humans are devoted to him. … ",
  "dn4:6.27": "While he is residing in a village or town, non-human entities do not harass them. … ",
  "dn4:6.28": "He leads an order and a community, and tutors a community, and is said to be the best of the various religious founders. He didn’t come by his fame in the same ways as those other ascetics and brahmins. ",
  "dn4:6.29": "Rather, he came by his fame due to his supreme knowledge and conduct. … ",
  "dn4:6.30": "King Seniya Bimbisāra of Magadha and his wives and children have gone for refuge for life to the ascetic Gotama. … ",
  "dn4:6.31": "King Pasenadi of Kosala and his wives and children have gone for refuge for life to the ascetic Gotama. … ",
  "dn4:6.32": "The brahmin Pokkharasāti and his wives and children have gone for refuge for life to the ascetic Gotama. … ",
  "dn4:6.33": "He’s honored, respected, revered, venerated, and esteemed by King Bimbisāra of Magadha … ",
  "dn4:6.34": "King Pasenadi of Kosala … ",
  "dn4:6.35": "and the brahmin Pokkharasāti. ",
  "dn4:6.36": "The ascetic Gotama has arrived at Campā and is staying at the Gaggarā Lotus Pond. ",
  "dn4:6.37": "Any ascetic or brahmin who comes to stay in our village district is our guest, ",
  "dn4:6.38": "and should be honored and respected as such. ",
  "dn4:6.39": "",
  "dn4:6.40": "",
  "dn4:6.41": "For this reason, too, it’s not appropriate for the worthy Gotama to come to see me; ",
  "dn4:6.42": "rather, it’s appropriate for me to go to see him. ",
  "dn4:6.43": "This is the extent of the worthy Gotama’s praise that I have memorized. But his praises are not confined to this, ",
  "dn4:6.44": "for the praise of the worthy Gotama is limitless.” ",
  "dn4:6.45": "When he had spoken, those brahmins said to him, ",
  "dn4:6.46": "“According to Soṇadaṇḍa’s praises, if the worthy Gotama were staying within a hundred leagues, it’d be worthwhile for a faithful gentleman to go to see him, even if he had to carry his own provisions in a knapsack.” ",
  "dn4:6.47": "“Well then, gentlemen, let’s all go to see the ascetic Gotama.” ",
  "dn4:7.0": "4. Soṇadaṇḍa Has Second Thoughts ",
  "dn4:7.1": "Then Soṇadaṇḍa together with a large group of brahmins went to see the Buddha. ",
  "dn4:8.1": "But as he reached the far side of the forest, this thought came to mind, ",
  "dn4:8.2": "“Suppose I was to ask the ascetic Gotama a question. ",
  "dn4:8.3": "He might say to me: ",
  "dn4:8.4": "‘Brahmin, you shouldn’t ask your question like that. This is how you should ask it.’ And the assembly might disparage me for that: ",
  "dn4:8.5": "‘Soṇadaṇḍa is foolish and incompetent. He’s not able to ask the ascetic Gotama a rational question.’ ",
  "dn4:8.6": "And when you’re disparaged by the assembly, your reputation diminishes. ",
  "dn4:8.7": "When your reputation diminishes, your wealth also diminishes. ",
  "dn4:8.8": "But my wealth relies on my reputation. ",
  "dn4:8.9": "Or if the ascetic Gotama asks me a question, I might not satisfy him with my answer. ",
  "dn4:8.10": "He might say to me: ",
  "dn4:8.11": "‘Brahmin, you shouldn’t answer the question like that. This is how you should answer it.’ And the assembly might disparage me for that: ",
  "dn4:8.12": "‘Soṇadaṇḍa is foolish and incompetent. He’s not able to satisfy the ascetic Gotama’s mind with his answer.’ ",
  "dn4:8.13": "And when you’re disparaged by the assembly, your reputation diminishes. ",
  "dn4:8.14": "When your reputation diminishes, your wealth also diminishes. ",
  "dn4:8.15": "But my wealth relies on my reputation. ",
  "dn4:8.16": "On the other hand, if I were to turn back after having come so far without having seen the ascetic Gotama, the assembly might disparage me for that: ",
  "dn4:8.17": "‘Soṇadaṇḍa is foolish and incompetent. He’s stuck-up and scared. He doesn’t dare to go and see the ascetic Gotama. For how on earth can he turn back after having come so far without having seen the ascetic Gotama!’ ",
  "dn4:8.18": "And when you’re disparaged by the assembly, your reputation diminishes. ",
  "dn4:8.19": "When your reputation diminishes, your wealth also diminishes. ",
  "dn4:8.20": "But my wealth relies on my reputation.” ",
  "dn4:9.1": "Then Soṇadaṇḍa went up to the Buddha, and exchanged greetings with him. ",
  "dn4:9.2": "When the greetings and polite conversation were over, he sat down to one side. ",
  "dn4:9.3": "Before sitting down to one side, some of the brahmins and householders of Campā bowed, some exchanged greetings and polite conversation, some held up their joined palms toward the Buddha, some announced their name and clan, while some kept silent. ",
  "dn4:10.1": "But while sitting there, Soṇadaṇḍa continued to be plagued by many second thoughts. He thought, ",
  "dn4:10.2": "",
  "dn4:10.3": "",
  "dn4:10.4": "",
  "dn4:10.5": "",
  "dn4:10.6": "",
  "dn4:10.7": "",
  "dn4:10.8": "",
  "dn4:10.9": "",
  "dn4:10.10": "",
  "dn4:10.11": "",
  "dn4:10.12": "",
  "dn4:10.13": "",
  "dn4:10.14": "",
  "dn4:10.15": "",
  "dn4:10.16": "“If only the ascetic Gotama would ask me about my own tutor’s scriptural heritage of the three Vedas! Then I could definitely satisfy his mind with my answer.” ",
  "dn4:11.0": "5. What Makes a Brahmin ",
  "dn4:11.1": "Then the Buddha, knowing Soṇadaṇḍa’s train of thought, thought, ",
  "dn4:11.2": "“This brahmin Soṇadaṇḍa is troubled by his own thoughts. ",
  "dn4:11.3": "Why don’t I ask him about his own tutor’s scriptural heritage of the three Vedas?” ",
  "dn4:11.4": "So he said to Soṇadaṇḍa, ",
  "dn4:11.5": "“Brahmin, how many factors must a brahmin possess for the brahmins to describe him as a brahmin; ",
  "dn4:11.6": "and so that when he says ‘I am a brahmin’ he speaks rightly, without falling into falsehood?” ",
  "dn4:12.1": "Then Soṇadaṇḍa thought, ",
  "dn4:12.2": "“The ascetic Gotama has asked me about exactly what I wanted, what I wished for, what I desired, what I yearned for; that is, my own scriptural heritage. ",
  "dn4:12.3": "",
  "dn4:12.4": "I can definitely satisfy his mind with my answer.” ",
  "dn4:13.1": "Then Soṇadaṇḍa straightened his back, looked around the assembly, and said to the Buddha, ",
  "dn4:13.2": "“Worthy Gotama, a brahmin must possess five factors for the brahmins to describe him as a brahmin; ",
  "dn4:13.3": "and so that when he says ‘I am a brahmin’ he speaks rightly, without falling into falsehood. ",
  "dn4:13.4": "What five? ",
  "dn4:13.5": "It’s when a brahmin is well born on both his mother’s and father’s side, of pure descent, with irrefutable and impeccable genealogy back to the seventh paternal generation. ",
  "dn4:13.6": "He recites and remembers the hymns, and has mastered the three Vedas, together with their vocabularies and ritual performance, their phonology and word classification, and the testaments as fifth. He knows them word-by-word, and their grammar. He is well versed in cosmology and the marks of a great man. ",
  "dn4:13.7": "He is attractive, good-looking, lovely, of surpassing beauty. He is magnificent and splendid as the Divinity, remarkable to behold. ",
  "dn4:13.8": "He is ethical, mature in ethical conduct. ",
  "dn4:13.9": "He’s astute and clever, being the first or second to hold the sacrificial ladle. ",
  "dn4:13.10": "These are the five factors which a brahmin must possess for the brahmins to describe him as a brahmin; ",
  "dn4:13.11": "and so that when he says ‘I am a brahmin’ he speaks rightly, without falling into falsehood.” ",
  "dn4:14.1": "“But brahmin, is it possible to set aside one of these five factors and still rightly describe someone as a brahmin?” ",
  "dn4:14.2": "",
  "dn4:14.3": "“It is possible, worthy Gotama. ",
  "dn4:14.4": "We could leave appearance out of the five factors. ",
  "dn4:14.5": "For what does appearance matter? ",
  "dn4:14.6": "",
  "dn4:14.7": "",
  "dn4:14.8": "",
  "dn4:14.9": "",
  "dn4:14.10": "A brahmin must possess the remaining four factors for the brahmins to rightly describe him as a brahmin.” ",
  "dn4:14.11": "",
  "dn4:15.1": "“But brahmin, is it possible to set aside one of these four factors and still rightly describe someone as a brahmin?” ",
  "dn4:15.2": "",
  "dn4:15.3": "“It is possible, worthy Gotama. ",
  "dn4:15.4": "We could leave the hymns out of the four factors. ",
  "dn4:15.5": "For what do the hymns matter? ",
  "dn4:15.6": "",
  "dn4:15.7": "",
  "dn4:15.8": "",
  "dn4:15.9": "A brahmin must possess the remaining three factors for the brahmins to rightly describe him as a brahmin.” ",
  "dn4:15.10": "",
  "dn4:16.1": "“But brahmin, is it possible to set aside one of these three factors and still rightly describe someone as a brahmin?” ",
  "dn4:16.2": "",
  "dn4:16.3": "“It is possible, worthy Gotama. ",
  "dn4:16.4": "We could leave birth out of the three factors. ",
  "dn4:16.5": "For what does birth matter? ",
  "dn4:16.6": "It’s when a brahmin is ethical, mature in ethical conduct; ",
  "dn4:16.7": "and he’s astute and clever, being the first or second to hold the sacrificial ladle. ",
  "dn4:16.8": "A brahmin must possess these two factors for the brahmins to rightly describe him as a brahmin.” ",
  "dn4:16.9": "",
  "dn4:17.1": "When he had spoken, those brahmins said to him, ",
  "dn4:17.2": "“Please don’t say that, worthy Soṇadaṇḍa, please don’t say that! ",
  "dn4:17.3": "You’re just condemning appearance, the hymns, and birth! You’re totally going over to the ascetic Gotama’s doctrine!” ",
  "dn4:18.1": "So the Buddha said to them, ",
  "dn4:18.2": "“Well, brahmins, if you think that ",
  "dn4:18.3": "Soṇadaṇḍa is unlearned, a poor speaker, witless, and not capable of debating with me about this, then leave him aside and you can debate with me. ",
  "dn4:18.4": "But if you think that ",
  "dn4:18.5": "he’s learned, a good speaker who enunciates well, astute, and capable of debating with me about this, then you should stand aside and let him debate with me.” ",
  "dn4:19.1": "When he said this, Soṇadaṇḍa said to the Buddha, ",
  "dn4:19.2": "“Let it be, worthy Gotama, be silent. I myself will respond to them in a legitimate manner.” ",
  "dn4:19.3": "Then he said to those brahmins, ",
  "dn4:19.4": "“Don’t say this, good fellows, don’t say this: ",
  "dn4:19.5": "‘You’re just condemning appearance, the hymns, and birth! You’re totally going over to the ascetic Gotama’s doctrine!’ ",
  "dn4:19.6": "I’m not condemning appearance, hymns, or birth.” ",
  "dn4:20.1": "Now at that time Soṇadaṇḍa’s nephew, the young student Aṅgaka was sitting in that assembly. ",
  "dn4:20.2": "Then Soṇadaṇḍa said to those brahmins, ",
  "dn4:20.3": "“Gentlemen, do you see my nephew, the young student Aṅgaka?” ",
  "dn4:20.4": "“Yes, sir.” ",
  "dn4:20.5": "“Aṅgaka is attractive, good-looking, lovely, of surpassing beauty. He is magnificent and splendid as the Divinity, remarkable to behold. There’s no-one in this assembly so good-looking, apart from the ascetic Gotama. ",
  "dn4:20.6": "Aṅgaka recites and remembers the hymns, and has mastered the three Vedas, together with their vocabularies and ritual performance, their phonology and word classification, and the testaments as fifth. He knows them word-by-word, and their grammar. He is well versed in cosmology and the marks of a great man. ",
  "dn4:20.7": "And I am the one who teaches him the hymns. ",
  "dn4:20.8": "Aṅgaka is well born on both his mother’s and father’s side, of pure descent, with irrefutable and impeccable genealogy back to the seventh paternal generation. ",
  "dn4:20.9": "And I know his mother and father. ",
  "dn4:20.10": "But if Aṅgaka were to kill living creatures, steal, commit adultery, lie, and drink liquor, then what’s the use of his appearance, his hymns, or his birth? ",
  "dn4:20.11": "It’s when a brahmin is ethical, mature in ethical conduct; ",
  "dn4:20.12": "and he’s astute and clever, being the first or second to hold the sacrificial ladle. ",
  "dn4:20.13": "A brahmin must possess these two factors for the brahmins to rightly describe him as a brahmin.” ",
  "dn4:20.14": "",
  "dn4:21.0": "6. The Discussion of Ethics and Wisdom ",
  "dn4:21.1": "“But brahmin, is it possible to set aside one of these two factors and still rightly describe someone as a brahmin?” ",
  "dn4:21.2": "",
  "dn4:21.3": "“No, worthy Gotama. ",
  "dn4:21.4": "For wisdom is cleansed by ethics, and ethics are cleansed by wisdom. ",
  "dn4:21.5": "Ethics and wisdom always go together. ",
  "dn4:21.6": "An ethical person is wise, and a wise person ethical. ",
  "dn4:21.7": "And ethics and wisdom are said to be the best things in the world. ",
  "dn4:21.8": "It’s just like when you clean one hand with the other, or clean one foot with the other. ",
  "dn4:21.9": "In the same way, wisdom is cleansed by ethics, and ethics are cleansed by wisdom. ",
  "dn4:21.10": "Ethics and wisdom always go together. ",
  "dn4:21.11": "An ethical person is wise, and a wise person ethical. ",
  "dn4:21.12": "And ethics and wisdom are said to be the best things in the world.” ",
  "dn4:22.1": "“That’s so true, brahmin, that’s so true! For wisdom is cleansed by ethics, and ethics are cleansed by wisdom. ",
  "dn4:22.2": "Ethics and wisdom always go together. ",
  "dn4:22.3": "An ethical person is wise, and a wise person ethical. ",
  "dn4:22.4": "And ethics and wisdom are said to be the best things in the world. ",
  "dn4:22.5": "It’s just like when you clean one hand with the other, or clean one foot with the other. ",
  "dn4:22.6": "In the same way, wisdom is cleansed by ethics, and ethics are cleansed by wisdom. ",
  "dn4:22.7": "Ethics and wisdom always go together. ",
  "dn4:22.8": "An ethical person is wise, and a wise person ethical. ",
  "dn4:22.9": "And ethics and wisdom are said to be the best things in the world. ",
  "dn4:22.10": "But what, brahmin, is that ethical conduct? ",
  "dn4:22.11": "And what is that wisdom?” ",
  "dn4:22.12": "“That’s all I know about this matter, worthy Gotama. ",
  "dn4:22.13": "May the worthy Gotama himself please clarify the meaning of this.” ",
  "dn4:23.1": "“Well then, brahmin, listen and apply your mind well, I will speak.” ",
  "dn4:23.2": "“Yes, worthy sir,” Soṇadaṇḍa replied. ",
  "dn4:23.3": "The Buddha said this: ",
  "dn4:23.4": "“It’s when a Realized One arises in the world, perfected, a fully awakened Buddha, accomplished in knowledge and conduct, holy, knower of the world, supreme guide for those who wish to train, teacher of gods and humans, awakened, blessed. ",
  "dn4:23.4.1.2": "He has realized with his own insight this world—with its gods, Māras, and divinities, this population with its ascetics and brahmins, gods and humans—and he makes it known to others. ",
  "dn4:23.4.1.3": "He proclaims a teaching that is good in the beginning, good in the middle, and good in the end, meaningful and well-phrased. And he reveals a spiritual practice that’s entirely full and pure. ",
  "dn4:23.4.2.1": "A householder hears that teaching, or a householder’s child, or someone reborn in a good family. ",
  "dn4:23.4.2.2": "They gain faith in the Realized One ",
  "dn4:23.4.2.3": "and reflect: ",
  "dn4:23.4.2.4": "‘Life at home is cramped and dirty, life gone forth is wide open. ",
  "dn4:23.4.2.5": "It’s not easy for someone living at home to lead the spiritual life utterly full and pure, like a polished shell. ",
  "dn4:23.4.2.6": "Why don’t I shave off my hair and beard, dress in ocher robes, and go forth from the lay life to homelessness?’ ",
  "dn4:23.4.2.7": "After some time they give up a large or small fortune, and a large or small family circle. They shave off hair and beard, dress in ocher robes, and go forth from the lay life to homelessness. ",
  "dn4:23.4.3.1": "Once they’ve gone forth, they live restrained in the monastic code, conducting themselves well and resorting for alms in suitable places. Seeing danger in the slightest fault, they keep the rules they’ve undertaken. They act skillfully by body and speech. They’re purified in livelihood and accomplished in ethical conduct. They guard the sense doors, have mindfulness and situational awareness, and are content. ",
  "dn4:23.4.4.0.1": "6.1. Ethics ",
  "dn4:23.4.4.0.2": "6.1.1. The Shorter Section on Ethics ",
  "dn4:23.4.4.1": "And how, brahmin, is a mendicant accomplished in ethics? ",
  "dn4:23.4.4.2": "It’s when a mendicant gives up killing living creatures, renouncing the rod and the sword. They’re scrupulous and kind, living full of sympathy for all living beings. ",
  "dn4:23.4.4.3": "This pertains to their ethics. ",
  "dn4:23.4.4.4": "They give up stealing. They take only what’s given, and expect only what’s given. They keep themselves clean by not thieving. ",
  "dn4:23.4.4.5": "This pertains to their ethics. ",
  "dn4:23.4.4.6": "They give up unchastity. They are chaste, set apart, avoiding the vulgar act of sex. ",
  "dn4:23.4.4.7": "This pertains to their ethics. ",
  "dn4:23.4.5.1": "They give up lying. They speak the truth and stick to the truth. They’re honest and dependable, and don’t trick the world with their words. ",
  "dn4:23.4.5.2": "This pertains to their ethics. ",
  "dn4:23.4.5.3": "They give up divisive speech. They don’t repeat in one place what they heard in another so as to divide people against each other. Instead, they reconcile those who are divided, supporting unity, delighting in harmony, loving harmony, speaking words that promote harmony. ",
  "dn4:23.4.5.4": "This pertains to their ethics. ",
  "dn4:23.4.5.5": "They give up harsh speech. They speak in a way that’s mellow, pleasing to the ear, lovely, going to the heart, polite, likable and agreeable to the people. ",
  "dn4:23.4.5.6": "This pertains to their ethics. ",
  "dn4:23.4.5.7": "They give up talking nonsense. Their words are timely, true, and meaningful, in line with the teaching and training. They say things at the right time which are valuable, reasonable, succinct, and beneficial. ",
  "dn4:23.4.5.8": "This pertains to their ethics. ",
  "dn4:23.4.6.1": "They refrain from injuring plants and seeds. ",
  "dn4:23.4.6.2": "They eat in one part of the day, abstaining from eating at night and food at the wrong time. ",
  "dn4:23.4.6.3": "They refrain from seeing shows of dancing, singing, and music . ",
  "dn4:23.4.6.4": "They refrain from beautifying and adorning themselves with garlands, fragrance, and makeup. ",
  "dn4:23.4.6.5": "They refrain from high and luxurious beds. ",
  "dn4:23.4.6.6": "They refrain from receiving gold and currency, ",
  "dn4:23.4.6.7": "raw grains, ",
  "dn4:23.4.6.8": "raw meat, ",
  "dn4:23.4.6.9": "women and girls, ",
  "dn4:23.4.6.10": "male and female bondservants, ",
  "dn4:23.4.6.11": "goats and sheep, ",
  "dn4:23.4.6.12": "chickens and pigs, ",
  "dn4:23.4.6.13": "elephants, cows, horses, and mares, ",
  "dn4:23.4.6.14": "and fields and land. ",
  "dn4:23.4.6.15": "They refrain from running errands and messages; ",
  "dn4:23.4.6.16": "buying and selling; ",
  "dn4:23.4.6.17": "falsifying weights, metals, or measures; ",
  "dn4:23.4.6.18": "bribery, fraud, cheating, and duplicity; ",
  "dn4:23.4.6.19": "mutilation, murder, abduction, banditry, plunder, and violence. ",
  "dn4:23.4.6.20": "This pertains to their ethics. ",
  "dn4:23.4.6.21": "The shorter section on ethics is finished. ",
  "dn4:23.4.7.0": "6.1.2. The Middle Section on Ethics ",
  "dn4:23.4.7.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in injuring plants and seeds. ",
  "dn4:23.4.7.2": "These include plants propagated from roots, stems, cuttings, or joints; and those from regular seeds as the fifth. They refrain from such injury to plants and seeds. ",
  "dn4:23.4.7.3": "This pertains to their ethics. ",
  "dn4:23.4.8.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in storing up goods for their own use. ",
  "dn4:23.4.8.2": "This includes such things as food, drink, clothes, vehicles, bedding, fragrance, and things of the flesh. ",
  "dn4:23.4.8.3": "They refrain from storing up such goods. ",
  "dn4:23.4.8.4": "This pertains to their ethics. ",
  "dn4:23.4.9.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in seeing shows. ",
  "dn4:23.4.9.2": "This includes such things as dancing, singing, music, performances, and storytelling; clapping, gongs, and kettledrums; beauty pageants; pole-acrobatics and bone-washing displays of the corpse-workers; battles of elephants, horses, buffaloes, bulls, goats, rams, chickens, and quails; staff-fights, boxing, and wrestling; combat, roll calls of the armed forces, battle-formations, and regimental reviews. ",
  "dn4:23.4.9.3": "They refrain from such shows. ",
  "dn4:23.4.9.4": "This pertains to their ethics. ",
  "dn4:23.4.10.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in gambling that causes negligence. ",
  "dn4:23.4.10.2": "This includes such things as checkers with eight or ten rows, checkers in the air, hopscotch, spillikins, board-games, tip-cat, drawing straws, dice, leaf-flutes, toy plows, somersaults, pinwheels, toy measures, toy carts, toy bows, guessing words from syllables, guessing another’s thoughts, and imitating musical instruments. ",
  "dn4:23.4.10.3": "They refrain from such gambling. ",
  "dn4:23.4.10.4": "This pertains to their ethics. ",
  "dn4:23.4.11.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still make use of high and luxurious bedding. ",
  "dn4:23.4.11.2": "This includes such things as sofas, couches, woolen covers—shag-piled, colorful, white, embroidered with flowers, quilted, embroidered with animals, double-or single-fringed—and silk covers studded with gems, as well as silken sheets, woven carpets, rugs for elephants, horses, or chariots, antelope hide rugs, and spreads of fine deer hide, with a canopy above and red cushions at both ends. ",
  "dn4:23.4.11.3": "They refrain from such bedding. ",
  "dn4:23.4.11.4": "This pertains to their ethics. ",
  "dn4:23.4.12.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in beautifying and adorning themselves with garlands, fragrance, and makeup. ",
  "dn4:23.4.12.2": "This includes such things as applying beauty products by anointing, massaging, bathing, and rubbing; mirrors, ointments, garlands, fragrances, and makeup; face-powder, foundation, bracelets, headbands, fancy walking-sticks or containers, rapiers, parasols, fancy sandals, turbans, jewelry, chowries, and long-fringed white robes. ",
  "dn4:23.4.12.3": "They refrain from such beautification and adornment. ",
  "dn4:23.4.12.4": "This pertains to their ethics. ",
  "dn4:23.4.13.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in low talk. ",
  "dn4:23.4.13.2": "This includes such topics as talk about kings, bandits, and ministers; talk about armies, threats, and wars; talk about food, drink, clothes, and beds; talk about garlands and fragrances; talk about family, vehicles, villages, towns, cities, and countries; talk about women and heroes; street talk and well talk; talk about the departed; motley talk; tales of land and sea; and talk about being reborn in this or that place. ",
  "dn4:23.4.13.3": "They refrain from such low talk. ",
  "dn4:23.4.13.4": "This pertains to their ethics. ",
  "dn4:23.4.14.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in arguments. ",
  "dn4:23.4.14.2": "They say such things as: ‘You don’t understand this teaching and training. I understand this teaching and training. What, you understand this teaching and training? You’re practicing wrong. I’m practicing right. I stay on topic, you don’t. You said last what you should have said first. You said first what you should have said last. What you’ve thought so much about has been disproved. Your doctrine is refuted. Go on, save your doctrine! You’re trapped; get yourself out of this—if you can!’ ",
  "dn4:23.4.14.3": "They refrain from such argumentative talk. ",
  "dn4:23.4.14.4": "This pertains to their ethics. ",
  "dn4:23.4.15.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in running errands and messages. ",
  "dn4:23.4.15.2": "This includes running errands for rulers, ministers, aristocrats, brahmins, householders, or princes who say: ‘Go here, go there. Take this, bring that from there.’ ",
  "dn4:23.4.15.3": "They refrain from such errands. ",
  "dn4:23.4.15.4": "This pertains to their ethics. ",
  "dn4:23.4.16.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in deceit, flattery, hinting, and belittling, and using material things to chase after other material things. They refrain from such deceit and flattery. ",
  "dn4:23.4.16.2": "This pertains to their ethics. ",
  "dn4:23.4.16.3": "The middle section on ethics is finished. ",
  "dn4:23.4.17.0": "6.1.3. The Long Section on Ethics ",
  "dn4:23.4.17.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn4:23.4.17.2": "This includes such fields as limb-reading, omenology, divining celestial portents, interpreting dreams, divining bodily marks, divining holes in cloth gnawed by mice, fire offerings, ladle offerings, offerings of husks, rice powder, rice, ghee, or oil; offerings from the mouth, blood sacrifices, palmistry; geomancy for building sites, fields, and cemeteries; exorcisms, earth magic, snake charming, poisons; the lore of the scorpion, the rat, the bird, and the crow; prophesying lifespan, chanting for protection, and divining omens from wild animals. ",
  "dn4:23.4.17.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn4:23.4.17.4": "This pertains to their ethics. ",
  "dn4:23.4.18.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn4:23.4.18.2": "This includes reading the marks of gems, cloth, clubs, swords, spears, arrows, bows, weapons, women, men, boys, girls, male and female bondservants, elephants, horses, buffaloes, bulls, cows, goats, rams, chickens, quails, monitor lizards, rabbits, tortoises, or deer. ",
  "dn4:23.4.18.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn4:23.4.18.4": "This pertains to their ethics. ",
  "dn4:23.4.19.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn4:23.4.19.2": "This includes making predictions that the king will march forth or march back; or that our king will attack and the enemy king will retreat, or vice versa; or that our king will triumph and the enemy king will be defeated, or vice versa; and so there will be victory for one and defeat for the other. ",
  "dn4:23.4.19.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn4:23.4.19.4": "This pertains to their ethics. ",
  "dn4:23.4.20.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn4:23.4.20.2": "This includes making predictions that there will be an eclipse of the moon, or sun, or stars; that the sun, moon, and stars will be in conjunction or in opposition; that there will be a meteor shower, a fiery sky, an earthquake, or thunder in the heavens; that there will be a rising, a setting, a darkening, a brightening of the moon, sun, and stars. And it also includes making predictions about the results of all such phenomena. ",
  "dn4:23.4.20.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn4:23.4.20.4": "This pertains to their ethics. ",
  "dn4:23.4.21.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn4:23.4.21.2": "This includes predicting whether there will be plenty of rain or drought; plenty to eat or famine; an abundant harvest or a bad harvest; security or peril; sickness or health. It also includes such occupations as arithmetic, accounting, calculating, poetry, and cosmology. ",
  "dn4:23.4.21.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn4:23.4.21.4": "This pertains to their ethics. ",
  "dn4:23.4.22.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn4:23.4.22.2": "This includes making arrangements for giving and taking in marriage; for engagement and divorce; and for scattering rice inwards or outwards at the wedding ceremony. It also includes casting spells for good or bad luck, treating impacted fetuses, binding the tongue, or locking the jaws; charms for the hands and ears; questioning a mirror, a girl, or a god as an oracle; worshiping the sun, worshiping the Great One, breathing fire, and invoking Siri, the goddess of luck. ",
  "dn4:23.4.22.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn4:23.4.22.4": "This pertains to their ethics. ",
  "dn4:23.4.23.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn4:23.4.23.2": "This includes rites for propitiation, for granting wishes, for ghosts, for the earth, for rain, for property settlement, and for preparing and consecrating house sites, and rites involving rinsing and bathing, and oblations. It also includes administering emetics, purgatives, expectorants, and phlegmagogues; administering ear-oils, eye restoratives, nasal medicine, ointments, and counter-ointments; surgery with needle and scalpel, treating children, prescribing root medicines, and binding on herbs. ",
  "dn4:23.4.23.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn4:23.4.23.4": "This pertains to their ethics. ",
  "dn4:23.4.24.1": "A mendicant thus accomplished in ethics sees no danger in any quarter in regards to their ethical restraint. ",
  "dn4:23.4.24.2": "It’s like a king who has defeated his enemies. He sees no danger from his foes in any quarter. ",
  "dn4:23.4.24.3": "In the same way, a mendicant thus accomplished in ethics sees no danger in any quarter in regards to their ethical restraint. ",
  "dn4:23.4.24.4": "When they have this entire spectrum of noble ethics, they experience a blameless happiness inside themselves. ",
  "dn4:23.5": "That’s how a mendicant is accomplished in ethics. ",
  "dn4:23.6": "This, brahmin, is that ethical conduct. ",
  "dn4:23.6.1.6": "The longer section on ethics is finished. ",
  "dn4:23.6.2.0.1": "6.2. Immersion ",
  "dn4:23.6.2.0.2": "6.2.1. Sense Restraint ",
  "dn4:23.6.2.1": "And how does a mendicant guard the sense doors? ",
  "dn4:23.6.2.2": "When a mendicant sees a sight with their eyes, they don’t get caught up in the features and details. ",
  "dn4:23.6.2.3": "If the faculty of sight were left unrestrained, bad unskillful qualities of covetousness and displeasure would become overwhelming. For this reason, they practice restraint, protecting the faculty of sight, and achieving its restraint. ",
  "dn4:23.6.2.4": "When they hear a sound with their ears … ",
  "dn4:23.6.2.5": "When they smell an odor with their nose … ",
  "dn4:23.6.2.6": "When they taste a flavor with their tongue … ",
  "dn4:23.6.2.7": "When they feel a touch with their body … ",
  "dn4:23.6.2.8": "When they know an idea with their mind, they don’t get caught up in the features and details. ",
  "dn4:23.6.2.9": "If the faculty of mind were left unrestrained, bad unskillful qualities of covetousness and displeasure would become overwhelming. For this reason, they practice restraint, protecting the faculty of mind, and achieving its restraint. ",
  "dn4:23.6.2.10": "When they have this noble sense restraint, they experience an unsullied bliss inside themselves. ",
  "dn4:23.6.2.11": "That’s how a mendicant guards the sense doors. ",
  "dn4:23.6.3.0": "6.2.2. Mindfulness and Situational Awareness ",
  "dn4:23.6.3.1": "And how does a mendicant have mindfulness and situational awareness? ",
  "dn4:23.6.3.2": "It’s when a mendicant acts with situational awareness when going out and coming back; when looking ahead and aside; when bending and extending the limbs; when bearing the outer robe, bowl and robes; when eating, drinking, chewing, and tasting; when urinating and defecating; when walking, standing, sitting, sleeping, waking, speaking, and keeping silent. ",
  "dn4:23.6.3.3": "That’s how a mendicant has mindfulness and situational awareness. ",
  "dn4:23.6.4.0": "6.2.3. Contentment ",
  "dn4:23.6.4.1": "And how is a mendicant content? ",
  "dn4:23.6.4.2": "It’s when a mendicant is content with robes to look after the body and almsfood to look after the belly. Wherever they go, they set out taking only these things. ",
  "dn4:23.6.4.3": "They’re like a bird: wherever it flies, wings are its only burden. ",
  "dn4:23.6.4.4": "In the same way, a mendicant is content with robes to look after the body and almsfood to look after the belly. Wherever they go, they set out taking only these things. ",
  "dn4:23.6.4.5": "That’s how a mendicant is content. ",
  "dn4:23.6.5.0": "6.2.4. Giving Up the Hindrances ",
  "dn4:23.6.5.1": "When they have this entire spectrum of noble ethics, this noble sense restraint, this noble mindfulness and situational awareness, and this noble contentment, ",
  "dn4:23.6.5.2": "they frequent a secluded lodging—a wilderness, the root of a tree, a hill, a ravine, a mountain cave, a charnel ground, a forest, the open air, a heap of straw. ",
  "dn4:23.6.5.3": "After the meal, they return from almsround, sit down cross-legged, set their body straight, and establish mindfulness in their presence. ",
  "dn4:23.6.6.1": "Giving up covetousness for the world, they meditate with a heart rid of covetousness, cleansing the mind of covetousness. ",
  "dn4:23.6.6.2": "Giving up ill will and malevolence, they meditate with a mind rid of ill will, full of sympathy for all living beings, cleansing the mind of ill will. ",
  "dn4:23.6.6.3": "Giving up dullness and drowsiness, they meditate with a mind rid of dullness and drowsiness, perceiving light, mindful and aware, cleansing the mind of dullness and drowsiness. ",
  "dn4:23.6.6.4": "Giving up restlessness and remorse, they meditate without restlessness, their mind peaceful inside, cleansing the mind of restlessness and remorse. ",
  "dn4:23.6.6.5": "Giving up doubt, they meditate having gone beyond doubt, not undecided about skillful qualities, cleansing the mind of doubt. ",
  "dn4:23.6.7.1": "Suppose a man who has gotten into debt were to apply himself to work, ",
  "dn4:23.6.7.2": "and his efforts proved successful. ",
  "dn4:23.6.7.3": "He would pay off the original loan and have enough left over to support his partner. ",
  "dn4:23.6.7.4": "Thinking about this, ",
  "dn4:23.6.7.5": "",
  "dn4:23.6.7.6": "",
  "dn4:23.6.7.7": "",
  "dn4:23.6.7.8": "he’d be filled with joy and happiness. ",
  "dn4:23.6.8.1": "Suppose there was a person who was sick, suffering, gravely ill. They’d lose their appetite and get physically weak. ",
  "dn4:23.6.8.2": "But after some time they’d recover from that illness, and regain their appetite and their strength. ",
  "dn4:23.6.8.3": "Thinking about this, ",
  "dn4:23.6.8.4": "",
  "dn4:23.6.8.5": "",
  "dn4:23.6.8.6": "",
  "dn4:23.6.8.7": "",
  "dn4:23.6.8.8": "they’d be filled with joy and happiness. ",
  "dn4:23.6.9.1": "Suppose a person was imprisoned in a jail. ",
  "dn4:23.6.9.2": "But after some time they were released from jail, safe and sound, with no loss of wealth. ",
  "dn4:23.6.9.3": "Thinking about this, ",
  "dn4:23.6.9.4": "",
  "dn4:23.6.9.5": "",
  "dn4:23.6.9.6": "they’d be filled with joy and happiness. ",
  "dn4:23.6.10.1": "Suppose a person was a bondservant. They would not be their own master, but indentured to another, unable to go where they wish. ",
  "dn4:23.6.10.2": "But after some time they’d be freed from servitude. They would be their own master, not indentured to another, an emancipated individual able to go where they wish. ",
  "dn4:23.6.10.3": "Thinking about this, ",
  "dn4:23.6.10.4": "",
  "dn4:23.6.10.5": "",
  "dn4:23.6.10.6": "they’d be filled with joy and happiness. ",
  "dn4:23.6.11.1": "Suppose there was a person with wealth and property who was traveling along a desert road, which was perilous, with nothing to eat. ",
  "dn4:23.6.11.2": "But after some time they crossed over the desert safely, arriving within a village, a sanctuary free of peril. ",
  "dn4:23.6.11.3": "Thinking about this, ",
  "dn4:23.6.11.4": "",
  "dn4:23.6.11.5": "",
  "dn4:23.6.11.6": "they’d be filled with joy and happiness. ",
  "dn4:23.6.12.1": "In the same way, as long as these five hindrances are not given up inside themselves, a mendicant regards them thus as a debt, a disease, a prison, slavery, and a desert crossing. ",
  "dn4:23.6.12.2": "But when these five hindrances are given up inside themselves, a mendicant regards this as freedom from debt, good health, release from prison, emancipation, and a place of sanctuary at last. ",
  "dn4:23.6.12.3": "",
  "dn4:23.6.12.4": "Seeing that the hindrances have been given up in them, joy springs up. Being joyful, rapture springs up. When the mind is full of rapture, the body becomes tranquil. When the body is tranquil, they feel bliss. And when blissful, the mind becomes immersed. ",
  "dn4:23.6.13.0": "6.2.5. First Absorption ",
  "dn4:23.7": "Quite secluded from sensual pleasures, secluded from unskillful qualities, they enter and remain in the first absorption, which has the rapture and bliss born of seclusion, while placing the mind and keeping it connected. ",
  "dn4:23.7.1.2": "They drench, steep, fill, and spread their body with rapture and bliss born of seclusion. There’s no part of the body that’s not spread with rapture and bliss born of seclusion. ",
  "dn4:23.7.2.1": "It’s like when a deft bathroom attendant or their apprentice pours bath powder into a bronze dish, sprinkling it little by little with water. They knead it until the ball of bath powder is soaked and saturated with moisture, spread through inside and out; yet no moisture oozes out. ",
  "dn4:23.7.2.2": "In the same way, a mendicant drenches, steeps, fills, and spreads their body with rapture and bliss born of seclusion. There’s no part of the body that’s not spread with rapture and bliss born of seclusion. ",
  "dn4:23.7.2.3": "This pertains to their wisdom. ",
  "dn4:23.7.3.0": "6.2.6. Second Absorption ",
  "dn4:23.8": "Furthermore, as the placing of the mind and keeping it connected are stilled, a mendicant enters and remains in the second absorption, which has the rapture and bliss born of immersion, with internal clarity and mind at one, without applying the mind and keeping it connected. ",
  "dn4:23.8.1.2": "They drench, steep, fill, and spread their body with rapture and bliss born of immersion. There’s no part of the body that’s not spread with rapture and bliss born of immersion. ",
  "dn4:23.8.2.1": "It’s like a deep lake fed by spring water. There’s no inlet to the east, west, north, or south, and the heavens would not properly bestow showers from time to time. ",
  "dn4:23.8.2.2": "But the stream of cool water welling up in the lake drenches, steeps, fills, and spreads throughout the lake. There’s no part of the lake that’s not spread through with cool water. ",
  "dn4:23.8.2.3": "In the same way, a mendicant drenches, steeps, fills, and spreads their body with rapture and bliss born of immersion. There’s no part of the body that’s not spread with rapture and bliss born of immersion. ",
  "dn4:23.8.2.4": "This pertains to their wisdom. ",
  "dn4:23.8.3.0": "6.2.7. Third Absorption ",
  "dn4:23.9": "Furthermore, with the fading away of rapture, a mendicant enters and remains in the third absorption, where they meditate with equanimity, mindful and aware, personally experiencing the bliss of which the noble ones declare, ‘Equanimous and mindful, one meditates in bliss.’ ",
  "dn4:23.9.1.2": "They drench, steep, fill, and spread their body with bliss free of rapture. There’s no part of the body that’s not spread with bliss free of rapture. ",
  "dn4:23.9.2.1": "It’s like a pool with blue water lilies, or pink or white lotuses. Some of them sprout and grow in the water without rising above it, thriving underwater. From the tip to the root they’re drenched, steeped, filled, and soaked with cool water. There’s no part of them that’s not soaked with cool water. ",
  "dn4:23.9.2.2": "In the same way, a mendicant drenches, steeps, fills, and spreads their body with bliss free of rapture. There’s no part of the body that’s not spread with bliss free of rapture. ",
  "dn4:23.9.2.3": "This pertains to their wisdom. ",
  "dn4:23.9.3.0": "6.2.8. Fourth Absorption ",
  "dn4:23.10": "Furthermore, giving up pleasure and pain, and ending former happiness and sadness, a mendicant enters and remains in the fourth absorption, without pleasure or pain, with pure equanimity and mindfulness. ",
  "dn4:23.10.1.2": "They sit spreading their body through with pure bright mind. There’s no part of the body that’s not spread with pure bright mind. ",
  "dn4:23.10.2.1": "It’s like someone sitting wrapped from head to foot with white cloth. There’s no part of the body that’s not spread over with white cloth. ",
  "dn4:23.10.2.2": "In the same way, they sit spreading their body through with pure bright mind. There’s no part of the body that’s not spread with pure bright mind. ",
  "dn4:23.10.2.3": "This pertains to their wisdom. ",
  "dn4:23.10.3.0.1": "6.3. The Eight Knowledges ",
  "dn4:23.10.3.0.2": "6.3.1. Knowledge and Vision ",
  "dn4:23.11": "When their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward knowledge and vision. ",
  "dn4:23.11.1.2": "They understand: ",
  "dn4:23.11.1.3": "‘This body of mine is formed. It’s made up of the four principal states, produced by mother and father, built up from rice and porridge, liable to impermanence, to wearing away and erosion, to breaking up and destruction. ",
  "dn4:23.11.1.4": "And this consciousness of mine is attached to it, tied to it.’ ",
  "dn4:23.11.2.1": "Suppose there was a beryl gem that was naturally beautiful, eight-faceted, well-worked, transparent, clear, and unclouded, endowed with all good qualities. ",
  "dn4:23.11.2.2": "And it was strung with a thread of blue, yellow, red, white, or golden brown. ",
  "dn4:23.11.2.3": "And someone with clear eyes were to take it in their hand and check it: ",
  "dn4:23.11.2.4": "‘This beryl gem is naturally beautiful, eight-faceted, well-worked, transparent, clear, and unclouded, endowed with all good qualities. ",
  "dn4:23.11.2.5": "And it’s strung with a thread of blue, yellow, red, white, or golden brown.’ ",
  "dn4:23.11.2.6": "In the same way, when their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward knowledge and vision. ",
  "dn4:23.11.2.7": "",
  "dn4:23.11.2.8": "",
  "dn4:23.11.2.9": "",
  "dn4:23.11.2.10": "This pertains to their wisdom. ",
  "dn4:23.11.3.0": "6.3.2. Mind-Made Body ",
  "dn4:23.11.3.1": "When their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward the creation of a mind-made body. ",
  "dn4:23.11.3.2": "From this body they create another body—formed, mind-made, whole in its major and minor limbs, not deficient in any faculty. ",
  "dn4:23.11.4.1": "Suppose a person was to draw a reed out from its sheath. ",
  "dn4:23.11.4.2": "They’d think: ",
  "dn4:23.11.4.3": "‘This is the reed, this is the sheath. The reed and the sheath are different things. The reed has been drawn out from the sheath.’ ",
  "dn4:23.11.4.4": "Or suppose a person was to draw a sword out from its scabbard. ",
  "dn4:23.11.4.5": "They’d think: ",
  "dn4:23.11.4.6": "‘This is the sword, this is the scabbard. The sword and the scabbard are different things. The sword has been drawn out from the scabbard.’ ",
  "dn4:23.11.4.7": "Or suppose a person was to draw a snake out from its slough. ",
  "dn4:23.11.4.8": "They’d think: ",
  "dn4:23.11.4.9": "‘This is the snake, this is the slough. The snake and the slough are different things. The snake has been drawn out from the slough.’ ",
  "dn4:23.11.4.10": "In the same way, when their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward the creation of a mind-made body. ",
  "dn4:23.11.4.11": "From this body they create another body—formed, mind-made, whole in its major and minor limbs, not deficient in any faculty. ",
  "dn4:23.11.4.12": "This pertains to their wisdom. ",
  "dn4:23.11.5.0": "6.3.3. Psychic Powers ",
  "dn4:23.11.5.1": "When their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward psychic power. ",
  "dn4:23.11.5.2": "They wield the many kinds of psychic power: multiplying themselves and becoming one again; appearing and disappearing; going unobstructed through a wall, a rampart, or a mountain as if through space; diving in and out of the earth as if it were water; walking on water as if it were earth; flying cross-legged through the sky like a bird; touching and stroking with the hand the sun and moon, so mighty and powerful; controlling the body as far as the realm of divinity. ",
  "dn4:23.11.6.1": "Suppose a deft potter or their apprentice had some well-prepared clay. They could produce any kind of pot that they like. ",
  "dn4:23.11.6.2": "Or suppose a deft ivory-carver or their apprentice had some well-prepared ivory. They could produce any kind of ivory item that they like. ",
  "dn4:23.11.6.3": "Or suppose a deft goldsmith or their apprentice had some well-prepared gold. They could produce any kind of gold item that they like. ",
  "dn4:23.11.6.4": "In the same way, when their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward psychic power. ",
  "dn4:23.11.6.5": "",
  "dn4:23.11.6.6": "This pertains to their wisdom. ",
  "dn4:23.11.7.0": "6.3.4. Clairaudience ",
  "dn4:23.11.7.1": "When their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward clairaudience. ",
  "dn4:23.11.7.2": "With clairaudience that is purified and superhuman, they hear both kinds of sounds, human and heavenly, whether near or far. ",
  "dn4:23.11.8.1": "Suppose there was a person traveling along the road. They’d hear the sound of drums, clay drums, horns, kettledrums, and tom-toms. They’d think: ‘That’s the sound of drums,’ and ‘that’s the sound of clay drums,’ and ‘that’s the sound of horns, kettledrums, and tom-toms.’ ",
  "dn4:23.11.8.2": "In the same way, when their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward clairaudience. ",
  "dn4:23.11.8.3": "With clairaudience that is purified and superhuman, they hear both kinds of sounds, human and heavenly, whether near or far. ",
  "dn4:23.11.8.4": "This pertains to their wisdom. ",
  "dn4:23.11.9.0": "6.3.5. Comprehending the Minds of Others ",
  "dn4:23.11.9.1": "When their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward comprehending the minds of others. ",
  "dn4:23.11.9.2": "They understand the minds of other beings and individuals, having comprehended them with their own mind. ",
  "dn4:23.11.9.3": "They understand mind with greed as ‘mind with greed’, ",
  "dn4:23.11.9.4": "and mind without greed as ‘mind without greed’. ",
  "dn4:23.11.9.5": "They understand mind with hate … ",
  "dn4:23.11.9.6": "mind without hate … ",
  "dn4:23.11.9.7": "mind with delusion … ",
  "dn4:23.11.9.8": "mind without delusion … ",
  "dn4:23.11.9.9": "constricted mind … ",
  "dn4:23.11.9.10": "scattered mind … ",
  "dn4:23.11.9.11": "expansive mind … ",
  "dn4:23.11.9.12": "unexpansive mind … ",
  "dn4:23.11.9.13": "mind that is not supreme … ",
  "dn4:23.11.9.14": "mind that is supreme … ",
  "dn4:23.11.9.15": "immersed mind … ",
  "dn4:23.11.9.16": "unimmersed mind … ",
  "dn4:23.11.9.17": "freed mind … ",
  "dn4:23.11.9.18": "They understand unfreed mind as ‘unfreed mind’. ",
  "dn4:23.11.10.1": "Suppose there was a woman or man who was young, youthful, and fond of adornments, and they check their own reflection in a clean bright mirror or a clear bowl of water. If they had a spot they’d know ‘I have a spot,’ and if they had no spots they’d know ‘I have no spots.’ ",
  "dn4:23.11.10.2": "In the same way, when their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward comprehending the minds of others. ",
  "dn4:23.11.10.3": "They understand the minds of other beings and individuals, having comprehended them with their own mind. ",
  "dn4:23.11.10.20": "This pertains to their wisdom. ",
  "dn4:23.11.11.0": "6.3.6. Recollection of Past Lives ",
  "dn4:23.11.11.1": "When their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward recollection of past lives. ",
  "dn4:23.11.11.2": "They recollect many kinds of past lives, that is, one, two, three, four, five, ten, twenty, thirty, forty, fifty, a hundred, a thousand, a hundred thousand rebirths; many eons of the world contracting, many eons of the world expanding, many eons of the world contracting and expanding. They remember: ‘There, I was named this, my clan was that, I looked like this, and that was my food. This was how I felt pleasure and pain, and that was how my life ended. When I passed away from that place I was reborn somewhere else. There, too, I was named this, my clan was that, I looked like this, and that was my food. This was how I felt pleasure and pain, and that was how my life ended. When I passed away from that place I was reborn here.’ And so they recollect their many kinds of past lives, with features and details. ",
  "dn4:23.11.12.": "This pertains to their wisdom. ",
  "dn4:23.11.12.1": "Suppose a person was to leave their home village and go to another village. From that village they’d go to yet another village. And from that village they’d return to their home village. They’d think: ‘I went from my home village to another village. There I stood like this, sat like that, spoke like this, or kept silent like that. From that village I went to yet another village. There too I stood like this, sat like that, spoke like this, or kept silent like that. And from that village I returned to my home village.’ ",
  "dn4:23.11.12.2": "In the same way, when their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward recollection of past lives. ",
  "dn4:23.11.12.3": "",
  "dn4:23.11.13.0": "6.3.7. Clairvoyance ",
  "dn4:23.11.13.1": "When their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward knowledge of the death and rebirth of sentient beings. ",
  "dn4:23.11.13.2": "With clairvoyance that is purified and superhuman, they see sentient beings passing away and being reborn—inferior and superior, beautiful and ugly, in a good place or a bad place. They understand how sentient beings are reborn according to their deeds: ‘These dear beings did bad things by way of body, speech, and mind. They denounced the noble ones; they had wrong view; and they chose to act out of that wrong view. When their body breaks up, after death, they’re reborn in a place of loss, a bad place, the underworld, hell. These dear beings, however, did good things by way of body, speech, and mind. They never denounced the noble ones; they had right view; and they chose to act out of that right view. When their body breaks up, after death, they’re reborn in a good place, a heavenly realm.’ And so, with clairvoyance that is purified and superhuman, they see sentient beings passing away and being reborn—inferior and superior, beautiful and ugly, in a good place or a bad place. They understand how sentient beings are reborn according to their deeds. ",
  "dn4:23.11.14.1": "Suppose there was a stilt longhouse at the central square. A person with clear eyes standing there might see humans entering and leaving a house, walking along the streets and paths, and sitting at the central square. They’d think: ‘These are people entering and leaving a house, walking along the streets and paths, and sitting at the central square.’ ",
  "dn4:23.11.14.2": "In the same way, when their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward knowledge of the death and rebirth of sentient beings. ",
  "dn4:23.11.14.3": "",
  "dn4:23.11.14.4": "This pertains to their wisdom. ",
  "dn4:23.11.15.0": "6.3.8. Ending of Defilements ",
  "dn4:23.11.15.1": "When their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward knowledge of the ending of defilements. ",
  "dn4:23.11.15.2": "They truly understand: ‘This is suffering’ … ‘This is the origin of suffering’ … ‘This is the cessation of suffering’ … ‘This is the practice that leads to the cessation of suffering’. ",
  "dn4:23.11.15.3": "They truly understand: ‘These are defilements’ … ‘This is the origin of defilements’ … ‘This is the cessation of defilements’ … ‘This is the practice that leads to the cessation of defilements’. ",
  "dn4:23.11.15.4": "Knowing and seeing like this, their mind is freed from the defilements of sensuality, desire to be reborn, and ignorance. ",
  "dn4:23.11.15.5": "When they’re freed, they know they’re freed. ",
  "dn4:23.12": "This pertains to their wisdom. … ",
  "dn4:23.13": "They understand: ‘Rebirth is ended, the spiritual journey has been completed, what had to be done has been done, there is nothing further for this place.’ ",
  "dn4:23.13.1.1": "Suppose that in a mountain glen there was a lake that was transparent, clear, and unclouded. A person with clear eyes standing on the bank would see the clams and mussels, and pebbles and gravel, and schools of fish swimming about or staying still. They’d think: ‘This lake is transparent, clear, and unclouded. And here are the clams and mussels, and pebbles and gravel, and schools of fish swimming about or staying still.’ ",
  "dn4:23.13.1.2": "In the same way, when their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward knowledge of the ending of defilements. ",
  "dn4:23.14": "This pertains to their wisdom. ",
  "dn4:23.15": "This, brahmin, is that wisdom.” ",
  "dn4:24.0": "7. Soṇadaṇḍa Declares Himself a Lay Follower ",
  "dn4:24.1": "When he had spoken, Soṇadaṇḍa said to the Buddha, ",
  "dn4:24.2": "“Excellent, worthy Gotama! Excellent! ",
  "dn4:24.3": "As if he were righting the overturned, or revealing the hidden, or pointing out the path to the lost, or lighting a lamp in the dark so people with clear eyes can see what’s there, worthy Gotama has made the Teaching clear in many ways. ",
  "dn4:24.4": "I go for refuge to the worthy Gotama, to the teaching, and to the mendicant Saṅgha. ",
  "dn4:24.5": "From this day forth, may the worthy Gotama remember me as a lay follower who has gone for refuge for life. ",
  "dn4:24.6": "Would you and the mendicant Saṅgha please accept a meal from me tomorrow?” ",
  "dn4:24.7": "The Buddha consented with silence. ",
  "dn4:24.8": "Then, knowing that the Buddha had consented, Soṇadaṇḍa got up from his seat, bowed, and respectfully circled the Buddha, keeping him on his right, before leaving. ",
  "dn4:24.9": "And when the night had passed Soṇadaṇḍa had delicious fresh and cooked foods prepared in his own home. Then he had the Buddha informed of the time, saying, ",
  "dn4:24.10": "“It’s time, worthy Gotama, the meal is ready.” ",
  "dn4:25.1": "Then the Buddha robed up in the morning and, taking his bowl and robe, went to the home of Soṇadaṇḍa together with the mendicant Saṅgha, where he sat on the seat spread out. ",
  "dn4:25.2": "Then Soṇadaṇḍa served and satisfied the mendicant Saṅgha headed by the Buddha with his own hands with delicious fresh and cooked foods. ",
  "dn4:26.1": "When the Buddha had eaten and washed his hand and bowl, Soṇadaṇḍa took a low seat and sat to one side. ",
  "dn4:26.2": "Seated to one side he said to the Buddha: ",
  "dn4:26.3": "“Worthy Gotama, if, when I have gone to an assembly, I rise from my seat and bow to the Buddha, that assembly might disparage me for that. ",
  "dn4:26.4": "And when you’re disparaged by the assembly, your reputation diminishes. ",
  "dn4:26.5": "When your reputation diminishes, your wealth also diminishes. ",
  "dn4:26.6": "But my wealth relies on my reputation. ",
  "dn4:26.7": "If, when I have gone to an assembly, I raise my joined palms, please take it that I have risen from my seat. ",
  "dn4:26.8": "And if I undo my turban, please take it that I have bowed. ",
  "dn4:26.9": "And the worthy Gotama, if, when I am in a carriage, I get down from my carriage and bow to the Buddha, that assembly might disparage me for that. ",
  "dn4:26.10": "",
  "dn4:26.11": "",
  "dn4:26.12": "If, when I am in a carriage, I hold up my goad, please take it that I have got down from my carriage. ",
  "dn4:26.13": "And if I lower my sunshade, please take it that I have bowed.” ",
  "dn4:27.1": "Then the Buddha educated, encouraged, fired up, and inspired the brahmin Soṇadaṇḍa with a Dhamma talk, after which he got up from his seat and left. "
}