{
  "dn5:1.1": "When asked about sacrifice, the Buddha tells a story of how a king was persuaded to forgo cruelty and institute a constructive social policy of welfare instead. ",
  "dn5:1.2": "Khāṇumata is only mentioned here. It means “stumpy”, perhaps indicating that it was, or had recently been, a rough out-of-the-way place. ",
  "dn5:1.3": "The commentary says this was similar to the Ambalaṭṭhikā of <a href='https://suttacentral.net/dn1/en/sujato#1.2.1'>DN 1:1.2.1</a>. ",
  "dn5:1.4": "Like the town Khāṇumata, the brahmin Kūṭadanta appears only here. His name means “pointy teeth”, but there is no evidence that he was a vampire. ",
  "dn5:1.6": "At <a href='https://suttacentral.net/snp2.7/en/sujato#26.1'>Snp 2.7:26.1</a>, the sacrifice of cows in particular was said to be the nadir of decline for brahmins. When similar sacrifices are described elsewhere in the canon, the number is five hundred rather than seven hundred (<a href='https://suttacentral.net/sn3.9/en/sujato#1.2'>SN 3.9:1.2</a>, <a href='https://suttacentral.net/an7.47/en/sujato#1.2'>AN 7.47:1.2</a>). ",
  "dn5:4.3": "News of the Buddha had spread in Brahmanical circles. In <a href='https://suttacentral.net/dn3/en/sujato'>DN 3</a> we saw the Buddha use his rhetorical technique of adapting his teaching to reframe Brahmanical doctrines in order to establish a common ground. Here we see the downside to such techniques, as the details of the reframing have been lost. ",
  "dn5:4.6": "No such sacrifice has been identified in Brahmanical texts. ",
  "dn5:9.7": "Kūṭadanta’s proposal that the Buddha advise him on the sacrifice of 700 animals is outrageous. Nonetheless, the Buddha responds politely since Kūṭadanta is being polite. While it is tempting to see the sacrifice of animals by supposedly virtuous priests as sheer hypocrisy, the fact of sacrifice remains one of the most widespread and mysterious of human religious practices. In an empathetic work that addresses this squarely, Roberto Calasso’s <em>Ardor</em> sees the vast complex of Vedic ritual and theory as making plain the fact of killing so that the guilt may be contained, in contrast with our modern culture of killing on an industrial scale while hiding it out of sight. ",
  "dn5:10.1": "Mahāvijita means “Great Dominion”. He seems to be only known from this story. The idiom <i lang='pi' translate='no'>bhūtapubbaṁ</i> (literally “so it was in the past”) introduces legendary narratives of usually dubious historicity, like the English idiom “once upon a time”. ",
  "dn5:10.2": "In the Pali, meaningful thoughts often occur to people when withdrawn in seclusion. This doesn’t necessary mean they were in formal meditation. ",
  "dn5:10.3": "The great sacrifices, especially the horse sacrifice, ensured royal authority. Their very scale and wastefulness showed off the wealth of the king. ",
  "dn5:10.4": "“High priest” is <i lang='pi' translate='no'>purohita</i>. He was a family chaplain advising and consecrating the royal family. The closeness of the relationship is shown by the fact that the royal family would take the lineage name of the <i lang='pi' translate='no'>purohita</i>. ",
  "dn5:11.2": "Then, as today, government policy was driven by the perception of rising crime rate. This whole passage is one of the Buddha’s most important statements on public policy. It is expressed through storytelling, giving a good example of how myths were invoked—and subverted—as rationales for current policy. ",
  "dn5:11.3": "“Taxes” is <i lang='pi' translate='no'>bali</i>. He would have had to press his people for the extra funds to hold the sacrifice. ",
  "dn5:11.5": "“Plague of savages” (<i lang='pi' translate='no'>dassukhīla</i>) is the only occurrence of Sanskrit <i lang='pi' translate='no'>dasyu</i> in early Pali. The <i lang='pi' translate='no'>dasyu</i> were inveterate foes of the Aryans in the Vedic period. Bereft of civilizing rites, scriptures, and observances, they were no children of Manu (Rig Veda 10.22.8). Their wiles (<i lang='pi' translate='no'>māyā</i>) made them a potent threat (Rig Veda 4.16.9, 8.14.14, 10.73.5). Indra was invoked to ensure their destruction (Rig Veda <em>passim</em>; Atharva Veda 2.14.5, 4.32.3, 20.21.4, 20.37.5, 20.42.2). Legend has it that Agni and Soma first supported the <i lang='pi' translate='no'>dasyu</i> before being won over by Indra (Śatapatha Brāhmaṇa 1.6.3.13; see also 6.4.2.4). By the time of the Buddha the <i lang='pi' translate='no'>dasyu</i> have vanished except as a legendary foe of the past. Where the Brahmanical texts advocate the pitiless destruction of the <i lang='pi' translate='no'>dasyu</i>, the brahmin high priest in the Buddhist text advocates an inclusive policy of social welfare. ",
  "dn5:11.6": "The priest knows that the king will respond better to a pragmatic argument than a moral one. ",
  "dn5:11.7": "Effective social policy requires a forward-thinking plan, not just reacting to grievances. ",
  "dn5:11.8": "The king should spend his own resources to support his citizens in the various occupations. ",
  "dn5:11.11": "Here the priest identifies a fundamental cause of social unrest and disorder. ",
  "dn5:11.12": "The king spends out of pocket, but the economy flourishes, so tax revenues increase even though he has not raised taxes. This is the essence of Keynesian economic theory. ",
  "dn5:11.13": "<i lang='pi' translate='no'>Khema</i> means a place of safety and sanctuary, where both humans and animals have no fear. ",
  "dn5:11.14": "A good leader listens to advice. ",
  "dn5:12.1": "Here the phrase “of both town and country” qualifies each group. At <a href='https://suttacentral.net/an4.70/en/sujato#1.3'>AN 4.70:1.3</a>, however, “brahmins and householders” and “people of town and country” are separate groups of people. Elsewhere the context does not always decide between these two possibilities. Generally the idiom aims at inclusivity, as opposed to here where the king is consulting the rich and powerful, so I treat them as two separate groups, thus including the common folk. ",
  "dn5:12.9": "“Consenting factions” is <i lang='pi' translate='no'>anumatipakkhā</i>. The king governs with the consent of his people, although only the landowning classes are considered. ",
  "dn5:13.1": "Royal authority is not based just on birth, conquest, ritual, or power, but on quality of character. ",
  "dn5:13.5": "Read <i lang='pi' translate='no'>sahati</i> (“prevails”) over the several variants. ",
  "dn5:13.7": "Showing the importance of comprehension over blind adherence to tradition. ",
  "dn5:13.9": "Meditators focus on the present, but that does not mean they cannot think about the past or future; it just means they are not trapped in useless thoughts. ",
  "dn5:14.1": "These are four of the five qualities that Soṇadaṇḍa identifies as the qualities of a brahmin at <a href='https://suttacentral.net/dn4/en/sujato#13.2'>DN 4:13.2</a>. Missing is appearance, which is the first factor that Soṇadaṇḍa admits is unnecessary. ",
  "dn5:15.3": "Compare the three factors of a donor’s mind-state at <a href='https://suttacentral.net/an6.37/en/sujato#2.4'>AN 6.37:2.4</a>. ",
  "dn5:16.1": "What a recipient does with a gift is beyond the donor’s control. ",
  "dn5:16.4": "PTS edition acknowledges <i lang='pi' translate='no'>sajjata</i> only as a variant reading, but it is in the commentary, so should be accepted in the text. It is from √<i lang='pi' translate='no'>sajj</i> (relinquish). ",
  "dn5:17.3": "Another lesson in leadership: the importance of communication. ",
  "dn5:17.11": "Due to abbreviation, the text only mentions householders here, but clearly all are intended. ",
  "dn5:18.3": "A leader gets results through inspiration, not fear. ",
  "dn5:18.5": "These were regarded as valuable yet harmless products. ",
  "dn5:19.2": "The king’s generosity and sincerity brings out the best in the others. ",
  "dn5:21.1": "Here ends the Buddha’s legendary account of the past. ",
  "dn5:21.3": "The other brahmins are satisfied, but Kūṭadanta senses there is more to it. ",
  "dn5:21.10": "“So I have heard” (<i lang='pi' translate='no'>evaṁ me sutaṁ</i>) is the standard opening for Buddhist suttas. This tag was used to indicate that the speaker was not present at the events, but “heard” about them. This is in contrast with the phrase “I heard and learned this in the presence” (<i lang='pi' translate='no'>sammukhā sutaṁ, sammukhā paṭiggahitaṁ</i>), which is used when reporting a teaching heard directly from the Buddha, eg. <a href='https://suttacentral.net/sn55.52/en/sujato#5.1'>SN 55.52:5.1</a>, <a href='https://suttacentral.net/sn22.90/en/sujato#9.1'>SN 22.90:9.1</a>, <a href='https://suttacentral.net/mn47/en/sujato#10.7'>MN 47:10.7</a>, etc. ",
  "dn5:21.16": "This qualifies the story of Mahāvijita as an early canonical Jātaka. There are a small number of such stories in the early suttas, only some of which overlap with the later Jātaka collections, the story of Mahāvijita not being among them. ",
  "dn5:22.1": "Kūṭadanta is hoping for a better return on his investment. Throughout the suttas, we find a strain of what might be called “spiritual economics”. ",
  "dn5:22.4": "Mentioned in a similar context at <a href='https://suttacentral.net/an4.40/en/sujato#2.2'>AN 4.40:2.2</a>. ",
  "dn5:23.4": "This contradicts the description given above. ",
  "dn5:24.4": "This means that the dwelling could be used by any Saṅgha member, as opposed to being given to a particular monastic or group. The gift of a dwelling is regarded as the best kind of offering to the Saṅgha. ",
  "dn5:26.5": "Thus far the Buddha has described the regular practice of a Buddhist lay person. ",
  "dn5:27.4": "This is the start of the teaching on the Gradual Training, encompassing ethics (<i lang='pi' translate='no'>sīla</i>), meditation (<i lang='pi' translate='no'>samādhi</i>), and wisdom (<i lang='pi' translate='no'>paññā</i>). Only the ethics portion appeared in the Brahmajālasutta, while all three are restated in all the remaining suttas of this chapter, although in truncated form. | It is exceedingly rare for a Buddha to appear. ",
  "dn5:27.4.1.2": "The Buddha realizes the truth by his own understanding, not through divine intervention or other metaphysical means. ",
  "dn5:27.4.1.3": "It is good when first heard, when practicing, and when one has realized the fruits. ",
  "dn5:27.4.2.1": "The word “householder” (<i lang='pi' translate='no'>gahapati</i>) informally refers to any lay person, but more specifically indicates someone who owns a house, i.e. a person of standing. The renunciate life is not just for slaves or workers wishing to escape their station. ",
  "dn5:27.4.3.1": "This serves as a table of contents for the teachings to come. | Nowadays, the “monastic code” (<i lang='pi' translate='no'>pātimokkha</i>) means the list of rules for monks and nuns found in the Vinayapiṭaka. In the early texts, however, it has three main meanings. Sometimes it does refer to the list of rules, as at <a href='https://suttacentral.net/an10.36/en/sujato#1.6'>AN 10.36:1.6</a>. Here it refers to the code of conduct that follows, which is a non-legalistic set of guidelines that preceded the Vinayapiṭaka. At <a href='https://suttacentral.net/dn14/en/sujato#3.28.1'>DN 14:3.28.1</a> it refers to the verses summarizing monastic conduct known as the “Ovāda Pātimokkha”. ",
  "dn5:27.4.4.2": "While the precept includes any living creature, if a monastic murders a human being they are immediately and permanently expelled. ",
  "dn5:27.4.4.4": "To steal anything of substantial value is an expulsion offence. ",
  "dn5:27.4.4.6": "Buddhist monastics are forbidden from any form of sexual activity. To engage in penetrative intercourse is an expulsion offence. ",
  "dn5:27.4.5.1": "While any form of lying is forbidden, if a monastic falsely claims states of enlightenment or deep meditation they are expelled. ",
  "dn5:27.4.6.1": "",
  "dn5:27.4.6.2": "",
  "dn5:27.4.6.3": "",
  "dn5:27.4.6.4": "",
  "dn5:27.4.6.5": "To avoid sleeping too much. ",
  "dn5:27.4.6.6": "",
  "dn5:27.4.6.7": "",
  "dn5:27.4.6.11": "",
  "dn5:27.4.6.14": "",
  "dn5:27.4.6.15": "",
  "dn5:27.4.6.16": "",
  "dn5:27.4.7.1": "",
  "dn5:27.4.9.2": "",
  "dn5:27.4.14.2": "",
  "dn5:27.4.15.2": "",
  "dn5:27.4.16.1": "",
  "dn5:27.4.17.1": "",
  "dn5:27.4.17.2": "",
  "dn5:27.4.23.2": "",
  "dn5:27.4.24.4": "This is the first step in the Buddha’s answer to Ajātasattu. This is the sense of happiness and well-being that you have when you know you have done nothing wrong for which anyone might blame you. It is the psychological foundation for meditation. ",
  "dn5:27.5.2.1": "Here begins the series of practices that build on moral fundamentals to lay the groundwork for meditation. ",
  "dn5:27.5.2.3": "It is not that one cannot see things, but that, mindful of its effect, one avoids unnecessary stimulation. | “Covetousness and bitterness” (<i lang='pi' translate='no'>abhijjhā domanassā</i>) are the strong forms of desire and aversion caused by lack of restraint. ",
  "dn5:27.5.2.10": "Their happiness deepens, as they see that not only their actions but also their mind is becoming free of anything unwholesome. ",
  "dn5:27.5.3.1": "Situational awareness is a psychological term popularized in the 1990s. It has to do with the perception of environmental phenomena and the comprehension of their meaning, which is very close to the sense of the Pali term <i lang='pi' translate='no'>sampajañña</i>. ",
  "dn5:27.5.3.2": "These acts describe the daily life of  a mendicant: going into the village for alms, at which time there are many distracting sights. Then they return, eat their meal, and spend their day in meditation. ",
  "dn5:27.5.4.2": "A Buddhist monk has three robes: a lower robe (sabong or sarong), an upper robe, and an outer cloak. ",
  "dn5:27.5.5.1": "These are the prerequisite conditions for embarking on deep meditation. ",
  "dn5:27.5.5.3": "For <i lang='pi' translate='no'>parimukha</i> (“in their presence”) we find <i lang='pi' translate='no'>pratimukha</i> in Sanskrit, which can mean “presence” or the reflection of the face. Late canonical Pali explains <i lang='pi' translate='no'>parimukha</i> as “the tip of the nose or the reflection of the face (<i lang='pi' translate='no'>mukhanimitta</i>)”. <i lang='pi' translate='no'>Parimukha</i> in Sanskrit is rare, but it appears in Pāṇini 4.4.29, which the commentary illustrates with the example of a servant “in the presence” of their master (cp. <a href='https://suttacentral.net/sn47.8/en/sujato'>SN 47.8</a>). So it seems the sense is “before the face” or more generally “in the presence”. | To “establish mindfulness” (<i lang='pi' translate='no'>satiṁ upaṭṭhapetvā</i>) is literally to “do satipaṭṭhāna”. ",
  "dn5:27.5.6.1": "Covetousness (<i lang='pi' translate='no'>abhijjha</i>) has been curbed by sense restraint, and now is fully abandoned. ",
  "dn5:27.5.6.2": "Likewise ill will (<i lang='pi' translate='no'>byāpādapadosa</i>), which was called <i lang='pi' translate='no'>domanassa</i> in the formula for sense restraint. ",
  "dn5:27.5.6.3": "“Mindfulness and situational awareness” has a prominent role in abandoning dullness. ",
  "dn5:27.5.6.4": "Restlessness hankers for the future and is countered by contentment. Remorse digs up the past and is countered by ethical purity. ",
  "dn5:27.5.6.5": "The meditator set out on their path after gaining faith in the Buddha. ",
  "dn5:27.5.7.1": "The happiness of meditation is hard to understand without practicing, so the Buddha gives a series of five similes to illustrate in terms Ajātasattu would understand. ",
  "dn5:27.5.12.1": "The five hindrances remain a pillar of meditation teaching. The root sense means to “obstruct” but also to “obscure, darken, veil”. ",
  "dn5:27.5.12.2": "Each simile illustrates not the happiness of acquisition, but of letting go. ",
  "dn5:27.5.12.4": "The Buddha did not emphasize technical details of technique, but the emotional wholeness and joy that leads to deep meditation. ",
  "dn5:27.6": "<i lang='pi' translate='no'>Jhāna</i> is a state of “elevated consciousness” (<i lang='pi' translate='no'>adhicitta</i>), so all the terms have an elevated sense. | The plural form indicates that “sensual pleasures” includes sense experience, which the meditator can turn away from since they no longer have any desire for it. | The “unskillful qualities” are the five hindrances. | The “rapture and bliss born of seclusion” is the happiness of abandoning the hindrances and freedom from sense impingement. | “Placing the mind and keeping it connected” (<i lang='pi' translate='no'>vitakka</i>, <i lang='pi' translate='no'>vicāra</i>) uses terms that mean “thought” in coarse consciousness, but which in “elevated consciousness” refer to the subtle function of applying the mind to the meditation. ",
  "dn5:27.6.1.2": "As a meditator proceeds, their subjective experience of the “body” evolves from tactile sense impressions (<i lang='pi' translate='no'>phoṭṭhabba</i>), to the interior mental experience of bliss and light (<i lang='pi' translate='no'>manomayakāya</i>), to the direct personal realization of highest truth (<a href='https://suttacentral.net/mn70/en/sujato#23.2'>MN 70:23.2</a>: <i lang='pi' translate='no'>kāyena ceva paramasaccaṁ sacchikaroti</i>). ",
  "dn5:27.6.2.1": "The kneading is the “placing the mind and keeping it connected”, the water is bliss, while the lack of leaking speaks to the contained interiority of the experience. | Here as elsewhere, water is used as a metaphor for the mind in absorption. Compare Bṛhadāraṇyaka Upaniṣad 4.3.32: “He becomes like water, one, the seer without duality; this is the world of Brahmā.” ",
  "dn5:27.8": "Each <i lang='pi' translate='no'>jhāna</i> begins as the least refined aspect of the previous <i lang='pi' translate='no'>jhāna</i> ends. This is not consciously directed, but describes the natural process of settling. The meditator is now fully confident and no longer needs to apply their mind: it is simply still and fully unified. ",
  "dn5:27.8.2.1": "The simile emphasizes the water as bliss, while the lack of inflow expresses containment and unification. ",
  "dn5:27.8.2.2": "The water welling up is the rapture, which is the uplifting emotional response to the experience of bliss. ",
  "dn5:27.9": "The emotional response to bliss matures from the subtle thrill of rapture to the poise of equanimity. Mindfulness is present in all states of deep meditation, but with equanimity it becomes prominent. ",
  "dn5:27.9.2.1": "The meditator is utterly immersed in stillness and bliss. ",
  "dn5:27.10": "The emotional poise of equanimity leads to the feeling of pleasure settling into the more subtle neutral feeling. Pain and sadness have been abandoned long before, but are emphasized here as they are subtle counterpart of pleasure. ",
  "dn5:27.10.1.2": "The equanimity of the fourth <i lang='pi' translate='no'>jhāna</i> is not dullness and indifference, but a brilliant and radiant awareness. ",
  "dn5:27.10.2.1": "The white cloth is the purity and brightness of equanimity. The commentary explains this as a person who has just got out of a bath and sits perfectly dry and content. ",
  "dn5:27.12": "Of the eight kinds of knowledge and vision, only the last is considered indispensable. The fourth <i lang='pi' translate='no'>jhāna</i> is the ideal basis for developing higher knowledges, although elsewhere the canon shows that even the first <i lang='pi' translate='no'>jhāna</i> can be a basis for liberating insight. Without <i lang='pi' translate='no'>jhāna</i>, however, the eightfold path is incomplete and liberating insight is impossible. | The verb <i lang='pi' translate='no'>abhininnāmeti</i> (“extend”) indicates that the meditator comes out of full immersion like a tortoise sticking out its limbs (<a href='https://suttacentral.net/sn35.240/en/sujato#1.7'>SN 35.240:1.7</a>). ",
  "dn5:27.12.1.3": "This is the “coarse” (<i lang='pi' translate='no'>olārika</i>) body. Note that its generation by mother and father contradicts the doctrine of Ajita Kesakambala. The obvious impermanence of the body invites the tempting but fallacious notion that the mind or soul is permanent, which is dispelled by deeper insight. ",
  "dn5:27.12.1.4": "This distinction should not be mistaken for mind-body dualism. These are not fundamental substances but experiences of a meditator. ",
  "dn5:27.12.2.2": "Strung gems were loved in India from the time in the Harappan civilization, millennia before the Buddha. ",
  "dn5:27.12.2.6": "This form of “knowledge and vision” is rarely mentioned, being found only here, at <a href='https://suttacentral.net/dn10/en/sujato#2.21.3'>DN 10:2.21.3</a>, and at <a href='https://suttacentral.net/mn77/en/sujato#29.2'>MN 77:29.2</a>. The next realization, the “mind-made body” is also only found in these three suttas. | The Mahāsaṅgīti edition adds the spurious title <i lang='pi' translate='no'>vipassanāñāṇa</i> (“insight knowledge”) to this section. This term does not appear anywhere in the Pali canon. ",
  "dn5:27.13.1.1": "The “mind-made body” is the interior mental representation of the physical body. In ordinary consciousness it is proprioception, which here is enhanced by the power of meditation. The higher powers in Buddhism are regarded as extensions and evolutions of aspects of ordinary experience, not as metaphysical realities separate from the world of mundane experience. ",
  "dn5:27.13.1.2": "This is similar to the experience of the “astral body” described by modern spiritualists. Note that it is still “physical” (<i lang='pi' translate='no'>rūpī</i>) even though it is mind-made. This is the subtle (<i lang='pi' translate='no'>sukhuma</i>) body, which is an energetic experience of physical properties by the mind. ",
  "dn5:27.13.3.1": "Here begin the “six direct knowledges” (<i lang='pi' translate='no'>chaḷabhiññā</i>), which are found commonly throughout the early texts. | “Psychic powers” (<i lang='pi' translate='no'>iddhi</i>) were much cultivated in the Buddha’s day, but the means to acquire them varied: devotion to a god, brutal penances, or magic rituals. The Buddha taught that the mind developed in <i lang='pi' translate='no'>samādhi</i> was capable of things that are normally incomprehensible. ",
  "dn5:27.13.3.2": "Only a few of these are attested as events in the early texts. The most common is the ability to disappear and reappear, exhibited by the Buddha (<a href='https://suttacentral.net/an8.30/en/sujato#2.1'>AN 8.30:2.1</a>), some disciples (<a href='https://suttacentral.net/mn37/en/sujato#6.1'>MN 37:6.1</a>), and deities (<a href='https://suttacentral.net/mn67/en/sujato#8.1'>MN 67:8.1</a>). ",
  "dn5:27.13.4.1": "These similes hark back to the descriptions of the purified mind as pliable and workable. ",
  "dn5:27.13.4.3": "This simile is extended in detail at <a href='https://suttacentral.net/an3.101/en/sujato'>AN 3.101</a>. ",
  "dn5:27.13.5.1": "“Clairaudience” is a literal rendition of <i lang='pi' translate='no'>dibbasota</i>. The root sense of <i lang='pi' translate='no'>dibba</i> is to “shine” like the bright sky or a divine being. The senses of clarity and divinity are both present. ",
  "dn5:27.13.5.2": "The Buddha occasionally used this ability for teaching, as at <a href='https://suttacentral.net/mn75/en/sujato#6.1'>MN 75:6.1</a>. ",
  "dn5:27.13.6.1": "The simile emphasizes the clarity and distinctness of the sounds. Compare <a href='https://suttacentral.net/an4.114/en/sujato'>AN 4.114</a>: <i lang='pi' translate='no'>bheripaṇavasaṅkhatiṇavaninnādasaddānaṁ</i>. ",
  "dn5:27.13.7.1": "Note that the Indic idiom is not the “reading” of minds, which suggests hearing the words spoken in inner dialogue. While this is exhibited by the Buddha (eg. <a href='https://suttacentral.net/an8.30/en/sujato#2.1'>AN 8.30:2.1</a>), the main emphasis is on the comprehension of the overall state of mind. ",
  "dn5:27.13.8.1": "Again the simile emphasizes how clear and direct the experience is. Without deep meditation, we have some intuitive sense for the minds of others, but it is far from clear. ",
  "dn5:27.13.9.1": "Here begins the “three knowledges” (<i lang='pi' translate='no'>tevijjā</i>), a subset of the six direct knowledges. The first two of these play an important role in deepening understanding of the nature of suffering in <i lang='pi' translate='no'>saṁsāra</i>. While they are not necessary for those whose wisdom is keen, they are helpful. ",
  "dn5:27.13.9.2": "Empowered by the fourth <i lang='pi' translate='no'>jhāna</i>, memory breaks through the veil of birth and death, revealing the vast expanse of time and dispelling the illusion that there is any place of eternal rest or sanctuary in the cycle of transmigration. The knowledge of these events is not hazy or murky, but clear and precise, illuminated by the brilliance of purified consciousness. ",
  "dn5:27.13.10.1": "The word for “past life” is <i lang='pi' translate='no'>pubbanivāsa</i>, literally “former home”, and the imagery of houses is found in the second of the three knowledges as well. Recollection of past lives is as fresh and clear as the memory of a recent journey. ",
  "dn5:27.13.11.2": "Here knowledge extends to the rebirths of others as well as oneself. Even more significant, it brings in the understanding of cause and effect; <em>why</em> rebirth happens the way it does. Such knowledge, however, is not infallible, as the Buddha warns in <a href='https://suttacentral.net/dn1/en/sujato#2.5.3'>DN 1:2.5.3</a> and <a href='https://suttacentral.net/mn136/en/sujato'>MN 136</a>. The experience is one thing; the inferences drawn from it are another. One should draw conclusions only tentatively, after long experience. | “Clairvoyance” renders <i lang='pi' translate='no'>dibbacakkhu</i> (“celestial eye”), for which see Chāndogya Upaniṣad 8.12.5, “the mind is (the self’s) celestial eye” (<i lang='pi' translate='no'>mano’sya daivaṁ cakṣuḥ</i>). ",
  "dn5:27.13.12.1": "This simile is also found at <a href='https://suttacentral.net/dn10/en/sujato#2.33.1'>DN 10:2.33.1</a>. The Majjhima employs a slightly different simile (<a href='https://suttacentral.net/mn39/en/sujato#20.3'>MN 39:20.3</a>, <a href='https://suttacentral.net/mn77/en/sujato#35.2'>MN 77:35.2</a>, <a href='https://suttacentral.net/mn130/en/sujato#2.1'>MN 130:2.1</a>). | <i lang='pi' translate='no'>Pāsāda</i> is often translated as “palace” or “mansion”, but in early Pali it meant a “stilt longhouse”. As here, it is an elevated place from which one can observe the street below. ",
  "dn5:27.13.13.1": "This is the experience of awakening that is the true goal of the Buddhist path. The defilements—properties of the mind that create suffering—have been curbed by the practice of ethics and suppressed by the power of <i lang='pi' translate='no'>jhāna</i>. Here they are eliminated forever. ",
  "dn5:27.13.13.2": "These are the four noble truths, which form the main content of the Buddha’s first sermon. They are the overarching principle into which all other teachings fall. The initial realization of the four noble truths indicates the first stage of awakening, stream-entry. ",
  "dn5:27.13.13.3": "The application of the four noble truths to defilements indicates that this is the final stage of awakening, perfection (or “arahantship”, <i lang='pi' translate='no'>arahatta</i>). | Many translators use “defilement” to render <i lang='pi' translate='no'>kilesa</i>, but since <i lang='pi' translate='no'>kilesa</i> appears only rarely in the early texts, I use “defilement” for <i lang='pi' translate='no'>āsava</i>. Both terms refer to a stain, corruption, or pollution in the mind. ",
  "dn5:27.13.13.4": "<i lang='pi' translate='no'>Bhavāsava</i> is the defilement that craves to continue life in a new birth. ",
  "dn5:27.13.13.5": "This is a reflective awareness of the fact of awakening. The meditator reviews their mind and sees that it is free from all forces that lead to suffering. ",
  "dn5:27.14": "This is a standard declaration of full awakening in the suttas, said both of the Buddha and of any arahant (“perfected one”). Each of the four phrases illustrates a cardinal principle of awakening. (1) Further transmigration through rebirths has come to an end due to the exhaustion (<i lang='pi' translate='no'>khīṇa</i>) of that which propels rebirth, namely deeds motivated by craving. (2) The eightfold path has been developed fully in all respects. (3) All functions relating to the four noble truths have been completed, namely: understanding suffering, letting go craving, witnessing extinguishment, and developing the path. (4) Extinguishment is final, with no falling back to this or any other state of existence. | For “state of existence” (literally “thusness”, <i lang='pi' translate='no'>itthatta</i>), see <a href='https://suttacentral.net/dn15/en/sujato#21.4'>DN 15:21.4</a>. ",
  "dn5:27.14.1.1": "Once again the pool of water represents the mind, but now the meditator is not immersed in the experience, but looks back and reviews it objectively. ",
  "dn5:27.16": "The entire path may be described as a “sacrifice”. ",
  "dn5:28.6": "Releasing animals remains a Buddhist practice today. "
}