{
  "dn5:0.1": "Long Discourses 5 ",
  "dn5:0.2": "With Kūṭadanta ",
  "dn5:1.0": "1. The Brahmins and Householders of Khāṇumata ",
  "dn5:1.1": "So I have heard. ",
  "dn5:1.2": "At one time the Buddha was wandering in the land of the Magadhans together with a large Saṅgha of five hundred mendicants when he arrived at a village of the Magadhan brahmins named Khāṇumata. ",
  "dn5:1.3": "There he stayed nearby at Ambalaṭṭhikā. ",
  "dn5:1.4": "Now at that time the brahmin Kūṭadanta was living in Khāṇumata. It was a crown property given by King Seniya Bimbisāra of Magadha, teeming with living creatures, full of hay, wood, water, and grain, a royal park endowed to a brahmin. ",
  "dn5:1.5": "Now at that time Kūṭadanta had prepared a great sacrifice. ",
  "dn5:1.6": "Bulls, bullocks, heifers, goats and rams—seven hundred of each—had been led to the post for the sacrifice. ",
  "dn5:2.1": "The brahmins and householders of Khāṇumata heard: ",
  "dn5:2.2": "“It seems the ascetic Gotama—a Sakyan, gone forth from a Sakyan family—has arrived at Khāṇumata and is staying at Ambalaṭṭhikā. ",
  "dn5:2.3": "He has this good reputation: ",
  "dn5:2.4": "‘That Blessed One is perfected, a fully awakened Buddha, accomplished in knowledge and conduct, holy, knower of the world, supreme guide for those who wish to train, teacher of gods and humans, awakened, blessed.’ ",
  "dn5:2.5": "He has realized with his own insight this world—with its gods, Māras, and divinities, this population with its ascetics and brahmins, gods and humans—and he makes it known to others. ",
  "dn5:2.6": "He proclaims a teaching that is good in the beginning, good in the middle, and good in the end, meaningful and well-phrased. And he reveals a spiritual practice that’s entirely full and pure. ",
  "dn5:2.7": "It’s good to see such perfected ones.” ",
  "dn5:2.8": "Then, having departed Khāṇumata, they formed into companies and headed to Ambalaṭṭhikā. ",
  "dn5:3.1": "Now at that time the brahmin Kūṭadanta had retired to the upper floor of his stilt longhouse for his midday nap. ",
  "dn5:3.2": "He saw the brahmins and householders heading for Ambalaṭṭhikā, ",
  "dn5:3.3": "and addressed his butler, ",
  "dn5:3.4": "“My butler, why are the brahmins and householders headed for Ambalaṭṭhikā?” ",
  "dn5:3.5": "“The ascetic Gotama has arrived at Khāṇumata and is staying at Ambalaṭṭhikā. ",
  "dn5:3.6": "He has this good reputation: ",
  "dn5:3.7": "‘That Blessed One is perfected, a fully awakened Buddha, accomplished in knowledge and conduct, holy, knower of the world, supreme guide for those who wish to train, teacher of gods and humans, awakened, blessed.’ ",
  "dn5:3.8": "They’re going to see that worthy Gotama.” ",
  "dn5:4.1": "Then Kūṭadanta thought, ",
  "dn5:4.2": "“I’ve heard that ",
  "dn5:4.3": "the ascetic Gotama knows how to accomplish the sacrifice with three modes and sixteen accessories. ",
  "dn5:4.4": "I don’t know about that, ",
  "dn5:4.5": "but I wish to perform a great sacrifice. ",
  "dn5:4.6": "Why don’t I ask him how to accomplish the sacrifice with three modes and sixteen accessories?” ",
  "dn5:4.7": "Then Kūṭadanta addressed his butler, ",
  "dn5:4.8": "“Well then, go to the brahmins and householders and say to them: ",
  "dn5:4.9": "‘Sirs, the brahmin Kūṭadanta asks ",
  "dn5:4.10": "you to wait, as he will also go to see the ascetic Gotama.’” ",
  "dn5:4.11": "“Yes, worthy sir,” replied the butler, and did as he was asked. ",
  "dn5:4.12": "",
  "dn5:4.13": "",
  "dn5:5.0": "2. The Qualities of Kūṭadanta ",
  "dn5:5.1": "Now at that time several hundred brahmins were residing in Khāṇumata ",
  "dn5:5.2": "thinking to participate in Kūṭadanta’s sacrifice. ",
  "dn5:5.3": "They heard that ",
  "dn5:5.4": "Kūṭadanta was going to see the ascetic Gotama. ",
  "dn5:5.5": "They approached Kūṭadanta and said to him: ",
  "dn5:5.6": "“Is it really true that you are going to see the ascetic Gotama?” ",
  "dn5:5.7": "“Yes, gentlemen, it is true.” ",
  "dn5:5.8": "",
  "dn5:6.1": "“Please don’t! ",
  "dn5:6.2": "It’s not appropriate for you to go to see the ascetic Gotama. ",
  "dn5:6.3": "For if you do so, your reputation will diminish and his will increase. ",
  "dn5:6.4": "For this reason it’s not appropriate for you to go to see the ascetic Gotama; ",
  "dn5:6.5": "it’s appropriate that he comes to see you. ",
  "dn5:6.6": "You are well born on both your mother’s and father’s side, of pure descent, with irrefutable and impeccable genealogy back to the seventh paternal generation. ",
  "dn5:6.7": "For this reason it’s not appropriate for you to go to see the ascetic Gotama; ",
  "dn5:6.8": "it’s appropriate that he comes to see you. ",
  "dn5:6.9": "You’re rich, affluent, and wealthy, with lots of property and assets, and lots of money and grain … ",
  "dn5:6.10": "You recite and remember the hymns, and have mastered the three Vedas, together with their vocabularies and ritual performance, their phonology and word classification, and the testaments as fifth. You know them word-by-word, and their grammar. You are well versed in cosmology and the marks of a great man. … ",
  "dn5:6.11": "You are attractive, good-looking, lovely, of surpassing beauty. You are magnificent and splendid as the Divinity, remarkable to behold. … ",
  "dn5:6.12": "You are ethical, mature in ethical conduct. … ",
  "dn5:6.13": "You’re a good speaker who enunciates well, with a polished, clear, and articulate voice that expresses the meaning. … ",
  "dn5:6.14": "You teach the tutors of many, and teach three hundred young students to recite the hymns. Many students come from various districts and countries for the sake of the hymns, wishing to learn the hymns. … ",
  "dn5:6.15": "You’re old, elderly and senior, advanced in years, and have reached the final stage of life. ",
  "dn5:6.16": "The ascetic Gotama is young, and has newly gone forth. … ",
  "dn5:6.17": "You’re honored, respected, revered, venerated, and esteemed by King Bimbisāra of Magadha … ",
  "dn5:6.18": "and the brahmin Pokkharasāti. … ",
  "dn5:6.19": "You live in Khāṇumata, a crown property given by King Seniya Bimbisāra of Magadha, teeming with living creatures, full of hay, wood, water, and grain, a royal park endowed to a brahmin. ",
  "dn5:6.20": "For this reason it’s not appropriate for you to go to see the ascetic Gotama; ",
  "dn5:6.21": "it’s appropriate that he comes to see you.” ",
  "dn5:7.0": "3. The Qualities of the Buddha ",
  "dn5:7.1": "When they had spoken, Kūṭadanta said to those brahmins: ",
  "dn5:7.2": "“Well then, gentlemen, listen to why it’s appropriate for me to go to see the ascetic Gotama, ",
  "dn5:7.3": "and it’s not appropriate for him to come to see me. ",
  "dn5:7.4": "He is well born on both his mother’s and father’s side, of pure descent, with irrefutable and impeccable genealogy back to the seventh paternal generation. ",
  "dn5:7.5": "For this reason it’s not appropriate for the ascetic Gotama to come to see me; ",
  "dn5:7.6": "rather, it’s appropriate for me to go to see him. ",
  "dn5:7.7": "When he went forth he abandoned a large family circle. … ",
  "dn5:7.8": "When he went forth he abandoned abundant gold, both coined and uncoined, stored above and below ground. … ",
  "dn5:7.9": "He went forth from the lay life to homelessness while still a youth, young, with pristine black hair, blessed with youth, in the prime of life. … ",
  "dn5:7.10": "Though his mother and father wished otherwise, weeping with tearful faces, he shaved off his hair and beard, dressed in ocher robes, and went forth from the lay life to homelessness. … ",
  "dn5:7.11": "He is attractive, good-looking, lovely, of surpassing beauty. He is magnificent and splendid as the Divinity, remarkable to behold. … ",
  "dn5:7.12": "He is ethical, possessing ethical conduct that is noble and skillful. … ",
  "dn5:7.13": "He’s a good speaker who enunciates well, with a polished, clear, and articulate voice that expresses the meaning. … ",
  "dn5:7.14": "He’s a tutor of tutors. … ",
  "dn5:7.15": "He has ended sensual desire, and is rid of caprice. … ",
  "dn5:7.16": "He teaches the efficacy of deeds and action. He doesn’t wish any harm upon the community of brahmins. … ",
  "dn5:7.17": "He went forth from an eminent family of unbroken aristocratic lineage. … ",
  "dn5:7.18": "He went forth from a rich, affluent, and wealthy family. … ",
  "dn5:7.19": "People come from distant lands and distant countries to question him. … ",
  "dn5:7.20": "Many thousands of deities have gone for refuge for life to him. … ",
  "dn5:7.21": "He has this good reputation: ",
  "dn5:7.22": "‘That Blessed One is perfected, a fully awakened Buddha, accomplished in knowledge and conduct, holy, knower of the world, supreme guide for those who wish to train, teacher of gods and humans, awakened, blessed.’ … ",
  "dn5:7.23": "He has the thirty-two marks of a great man. … ",
  "dn5:7.24": "He is welcoming, congenial, polite, smiling, open, the first to speak. … ",
  "dn5:7.25": "He’s honored, respected, revered, venerated, and esteemed by the four assemblies. … ",
  "dn5:7.26": "Many gods and humans are devoted to him. … ",
  "dn5:7.27": "While he is residing in a village or town, non-human entities do not harass them. … ",
  "dn5:7.28": "He leads an order and a community, and tutors a community, and is said to be the best of the various religious founders. He didn’t come by his fame in the same ways as those other ascetics and brahmins. ",
  "dn5:7.29": "Rather, he came by his fame due to his supreme knowledge and conduct. … ",
  "dn5:7.30": "King Seniya Bimbisāra of Magadha and his wives and children have gone for refuge for life to the ascetic Gotama. … ",
  "dn5:7.31": "King Pasenadi of Kosala and his wives and children have gone for refuge for life to the ascetic Gotama. … ",
  "dn5:7.32": "The brahmin Pokkharasāti and his wives and children have gone for refuge for life to the ascetic Gotama. … ",
  "dn5:7.33": "He’s honored, respected, revered, venerated, and esteemed by King Bimbisāra of Magadha … ",
  "dn5:7.34": "King Pasenadi of Kosala … ",
  "dn5:7.35": "and the brahmin Pokkharasāti. ",
  "dn5:7.36": "The ascetic Gotama has arrived at Khāṇumata and is staying at Ambalaṭṭhikā. ",
  "dn5:7.37": "Any ascetic or brahmin who comes to stay in our village district is our guest, ",
  "dn5:7.38": "and should be honored and respected as such. ",
  "dn5:7.39": "",
  "dn5:7.40": "",
  "dn5:7.41": "For this reason, too, it’s not appropriate for the worthy Gotama to come to see me, ",
  "dn5:7.42": "rather, it’s appropriate for me to go to see him. ",
  "dn5:7.43": "This is the extent of the worthy Gotama’s praise that I have memorized. But his praises are not confined to this, ",
  "dn5:7.44": "for the praise of the worthy Gotama is limitless.” ",
  "dn5:7.45": "When he had spoken, those brahmins said to him, ",
  "dn5:7.46": "“According to Kūṭadanta’s praises, if the worthy Gotama were staying within a hundred leagues, it’d be worthwhile for a faithful gentleman to go to see him, even if he had to carry his own provisions in a knapsack.” ",
  "dn5:7.47": "“Well then, gentlemen, let’s all go to see the ascetic Gotama.” ",
  "dn5:8.0": "4. The Story of King Mahāvijita’s Sacrifice ",
  "dn5:8.1": "Then Kūṭadanta together with a large group of brahmins went to see the Buddha and exchanged greetings with him. ",
  "dn5:8.2": "When the greetings and polite conversation were over, he sat down to one side. ",
  "dn5:8.3": "Before sitting down to one side, some of the brahmins and householders of Khāṇumata bowed, some exchanged greetings and polite conversation, some held up their joined palms toward the Buddha, some announced their name and clan, while some kept silent. ",
  "dn5:9.1": "Kūṭadanta said to the Buddha, ",
  "dn5:9.2": "“Worthy Gotama, I’ve heard that ",
  "dn5:9.3": "you know how to accomplish the sacrifice with three modes and sixteen accessories. ",
  "dn5:9.4": "I don’t know about that, ",
  "dn5:9.5": "but I wish to perform a great sacrifice. ",
  "dn5:9.6": "Please teach me how to accomplish the sacrifice with three modes and sixteen accessories.” ",
  "dn5:9.7": "“Well then, brahmin, listen and apply your mind well, I will speak.” ",
  "dn5:9.8": "“Yes, worthy sir,” Kūṭadanta replied. ",
  "dn5:9.9": "The Buddha said this: ",
  "dn5:10.1": "“Once upon a time, brahmin, there was a king named Mahāvijita. He was rich, affluent, and wealthy, with lots of gold and silver, lots of property and assets, lots of money and grain, and a full treasury and storehouses. ",
  "dn5:10.2": "Then as King Mahāvijita was in private retreat this thought came to his mind: ",
  "dn5:10.3": "‘I have achieved human wealth, and reign after conquering this vast territory. Why don’t I hold a large sacrifice? That will be for my lasting welfare and happiness.’ ",
  "dn5:10.4": "Then he summoned the brahmin high priest and said to him: ",
  "dn5:10.5": "‘Just now, brahmin, as I was in private retreat this thought came to mind, ",
  "dn5:10.6": "“I have achieved human wealth, and reign after conquering this vast territory. Why don’t I perform a great sacrifice? That will be for my lasting welfare and happiness.” ",
  "dn5:10.7": "Brahmin, I wish to perform a great sacrifice. ",
  "dn5:10.8": "Please instruct me. It will be for my lasting welfare and happiness.’ ",
  "dn5:11.1": "When he had spoken, the brahmin high priest said to him: ",
  "dn5:11.2": "‘Sir, the king’s realm is harried and oppressed. Raiding of villages, towns, and cities has been seen, and infesting of highways. ",
  "dn5:11.3": "But if the king were to extract more taxes while his realm is thus harried and oppressed, he would not be doing his duty. ",
  "dn5:11.4": "Now the king might think, ",
  "dn5:11.5": "“I’ll eradicate this plague of savages by execution or imprisonment or confiscation or condemnation or banishment!” But that’s not the right way to eradicate this plague of savages. ",
  "dn5:11.6": "Those who remain after the killing will return to harass the king’s realm. ",
  "dn5:11.7": "Rather, here is a plan, relying on which the plague of savages will be properly uprooted. ",
  "dn5:11.8": "So let the king provide seed and fodder for those in the realm who work in growing crops and raising cattle. ",
  "dn5:11.9": "Let the king provide funding for those who work in trade. ",
  "dn5:11.10": "Let the king guarantee food and wages for those in government service. ",
  "dn5:11.11": "Then the people, occupied with their own work, will not harass the realm. ",
  "dn5:11.12": "The king’s revenues will be great. ",
  "dn5:11.13": "When the country is secured as a sanctuary, free of being harried and oppressed, the happy people, with joy in their hearts, dancing with children at their breast, will dwell as if their houses were wide open.’ ",
  "dn5:11.14": "The king agreed with the high priest’s advice and followed his recommendation. ",
  "dn5:11.15": "",
  "dn5:11.16": "",
  "dn5:11.17": "",
  "dn5:11.18": "",
  "dn5:11.19": "Then the king summoned the brahmin high priest and said to him: ",
  "dn5:11.20": "‘I have eradicated the plague of savages. And relying on your plan my revenue is now great. ",
  "dn5:11.21": "Since the country is secured as a sanctuary, free of being harried and oppressed, the happy people, with joy in their hearts, dancing with children at their breast, dwell as if their houses were wide open. ",
  "dn5:11.22": "Brahmin, I wish to perform a great sacrifice. ",
  "dn5:11.23": "Please instruct me. It will be for my lasting welfare and happiness.’ ",
  "dn5:12.0": "4.1. The Four Accessories ",
  "dn5:12.1": "‘In that case, let the king announce this throughout the realm to the aristocrat vassals of both town and country; the ministers and councillors of both town and country; the well-to-do brahmins of both town and country; and the well-off householders of both town and country. ",
  "dn5:12.2": "“I wish to perform a great sacrifice. Please grant your approval, good fellows; it will be for my lasting welfare and happiness.” ",
  "dn5:12.3": "The king agreed with the high priest’s advice and followed his recommendation. ",
  "dn5:12.4": "And all of the people who were thus informed responded by saying: ",
  "dn5:12.5": "‘May the king perform a sacrifice! It is time for a sacrifice, great king.’ ",
  "dn5:12.6": "",
  "dn5:12.7": "",
  "dn5:12.8": "",
  "dn5:12.9": "And so these four consenting factions became accessories to the sacrifice. ",
  "dn5:13.0": "4.2. The Eight Accessories ",
  "dn5:13.1": "King Mahāvijita possessed eight factors. ",
  "dn5:13.2": "He was well born on both his mother’s and father’s side, of pure descent, with irrefutable and impeccable genealogy back to the seventh paternal generation. ",
  "dn5:13.3": "He was attractive, good-looking, lovely, of surpassing beauty. He was magnificent and splendid as the Divinity, remarkable to behold. ",
  "dn5:13.4": "He was rich, affluent, and wealthy, with lots of gold and silver, lots of property and assets, lots of money and grain, and a full treasury and storehouses. ",
  "dn5:13.5": "He was powerful, having an army of four divisions that was obedient and carried out instructions. He’d probably prevail over his enemies just with his reputation. ",
  "dn5:13.6": "He was faithful, generous, a donor, his door always open. He was a well-spring of support, making merit with ascetics and brahmins, for paupers, vagrants, supplicants, and beggars. ",
  "dn5:13.7": "He was very learned in diverse fields of learning. He understood the meaning of diverse statements, saying: ",
  "dn5:13.8": "‘This is what that statement means; that is what this statement means.’ ",
  "dn5:13.9": "He was astute, competent, and intelligent, able to think issues through as they bear upon the past, future, and present. ",
  "dn5:13.10": "These are the eight factors that King Mahāvijita possessed. ",
  "dn5:13.11": "And so these eight factors also became accessories to the sacrifice. ",
  "dn5:14.0": "4.3. Four More Accessories ",
  "dn5:14.1": "And the brahmin high priest had four factors. ",
  "dn5:14.2": "He was well born on both his mother’s and father’s side, of pure descent, with irrefutable and impeccable genealogy back to the seventh paternal generation. ",
  "dn5:14.3": "He recited and remembered the hymns, and had mastered the three Vedas, together with their vocabularies and ritual performance, their phonology and word classification, and the testaments as fifth. He knew them word-by-word, and their grammar. He was well versed in cosmology and the marks of a great man. ",
  "dn5:14.4": "He was ethical, mature in ethical conduct. ",
  "dn5:14.5": "He was astute and clever, being the first or second to hold the sacrificial ladle. ",
  "dn5:14.6": "These are the four factors that the brahmin high priest possessed. ",
  "dn5:14.7": "And so these four factors also became accessories to the sacrifice. ",
  "dn5:15.0": "4.4. The Three Modes ",
  "dn5:15.1": "Next, before the sacrifice, the brahmin high priest taught the three modes to the king. ",
  "dn5:15.2": "‘Now, though the king wants to perform a great sacrifice, he might have certain regrets, thinking: ",
  "dn5:15.3": "“I shall lose a great fortune,” or ",
  "dn5:15.4": "",
  "dn5:15.5": "“I am losing a great fortune,” or ",
  "dn5:15.6": "",
  "dn5:15.7": "“I have lost a great fortune.” But the king should not harbor such regrets.’ ",
  "dn5:15.8": "These are the three modes that the brahmin high priest taught to the king before the sacrifice. ",
  "dn5:16.0": "4.5. The Ten Respects ",
  "dn5:16.1": "Next, before the sacrifice, the brahmin high priest dispelled the king’s regret regarding the recipients in ten respects: ",
  "dn5:16.2": "‘There will come to the sacrifice those who kill living creatures and those who refrain from killing living creatures. ",
  "dn5:16.3": "As to those who kill living creatures, the outcome of that is theirs alone. ",
  "dn5:16.4": "But as to those who refrain from killing living creatures, it is for their sakes that the king should sacrifice, relinquish, rejoice, and gain confidence in his heart. ",
  "dn5:16.5": "There will come to the sacrifice those who steal … ",
  "dn5:16.6": "commit sexual misconduct … ",
  "dn5:16.7": "lie … ",
  "dn5:16.8": "use divisive speech … ",
  "dn5:16.9": "use harsh speech … ",
  "dn5:16.10": "talk nonsense … ",
  "dn5:16.11": "are covetous … ",
  "dn5:16.12": "have ill will … ",
  "dn5:16.13": "have wrong view and those who have right view. ",
  "dn5:16.14": "As to those who have wrong view, the outcome of that is theirs alone. ",
  "dn5:16.15": "But as to those who have right view, it is for their sakes that the king should sacrifice, relinquish, rejoice, and gain confidence in his heart.’ ",
  "dn5:16.16": "These are the ten respects in which the high priest dispelled the king’s regret regarding the recipients before the sacrifice. ",
  "dn5:17.0": "4.6. The Sixteen Respects ",
  "dn5:17.1": "Next, while the king was performing the great sacrifice, the brahmin high priest educated, encouraged, fired up, and inspired the king’s mind in sixteen respects: ",
  "dn5:17.2": "‘Now, while the king is performing the great sacrifice, someone might say, ",
  "dn5:17.3": "“King Mahāvijita performs a great sacrifice, but he did not announce it to the aristocrat vassals of town and country. ",
  "dn5:17.4": "That’s the kind of great sacrifice that this king performs.” ",
  "dn5:17.5": "Those who speak against the king in this way have no legitimacy. ",
  "dn5:17.6": "For the king did indeed announce it to the aristocrat vassals of town and country. ",
  "dn5:17.7": "Let the king know this as a reason to sacrifice, relinquish, rejoice, and gain confidence in his heart. ",
  "dn5:17.8": "While the king is performing the great sacrifice, someone might say, ",
  "dn5:17.9": "“King Mahāvijita performs a great sacrifice, but he did not announce it to the aristocrat vassals; the ministers and councillors; the well-to-do brahmins; and the well-off householders. That’s the kind of great sacrifice that this king performs.” ",
  "dn5:17.10": "Those who speak against the king in this way have no legitimacy. ",
  "dn5:17.11": "For the king did indeed announce it to all these people. ",
  "dn5:17.12": "Let the king know this too as a reason to sacrifice, relinquish, rejoice, and gain confidence in his heart. ",
  "dn5:17.13": "While the king is performing the great sacrifice, someone might say ",
  "dn5:17.14": "that he does not possess the eight factors. ",
  "dn5:17.15": "",
  "dn5:17.16": "",
  "dn5:17.17": "",
  "dn5:17.18": "",
  "dn5:17.19": "",
  "dn5:17.20": "",
  "dn5:17.21": "",
  "dn5:17.22": "",
  "dn5:17.23": "",
  "dn5:17.24": "",
  "dn5:17.25": "",
  "dn5:17.26": "",
  "dn5:17.27": "Those who speak against the king in this way have no legitimacy. ",
  "dn5:17.28": "For the king does indeed possess the eight factors. ",
  "dn5:17.29": "Let the king know this too as a reason to sacrifice, relinquish, rejoice, and gain confidence in his heart. ",
  "dn5:17.30": "While the king is performing the great sacrifice, someone might say ",
  "dn5:17.31": "that the high priest does not possess the four factors. ",
  "dn5:17.32": "",
  "dn5:17.33": "",
  "dn5:17.34": "",
  "dn5:17.35": "",
  "dn5:17.36": "",
  "dn5:17.37": "",
  "dn5:17.38": "",
  "dn5:17.39": "",
  "dn5:17.40": "",
  "dn5:17.41": "",
  "dn5:17.42": "Those who speak against the king in this way have no legitimacy. ",
  "dn5:17.43": "For the high priest does indeed possess the four factors. ",
  "dn5:17.44": "Let the king know this too as a reason to sacrifice, relinquish, rejoice, and gain confidence in his heart.’ ",
  "dn5:17.45": "These are the sixteen respects in which the high priest educated, encouraged, fired up, and inspired the king’s mind while he was performing the sacrifice. ",
  "dn5:18.1": "And brahmin, in that sacrifice no cattle were killed, no goats or sheep were killed, and no chickens or pigs were killed. There was no slaughter of various kinds of creatures. No trees were felled for the sacrificial post. No grass was reaped to strew over the place of sacrifice. ",
  "dn5:18.2": "No bondservants, servants, or workers did their jobs under threat of punishment and danger, weeping with tearful faces. ",
  "dn5:18.3": "Those who wished to work did so, while those who did not wish to did not. ",
  "dn5:18.4": "They did the work they wanted to, and did not do what they didn’t want to. ",
  "dn5:18.5": "The sacrifice was completed with just ghee, oil, butter, curds, honey, and molasses. ",
  "dn5:19.1": "Then the aristocrat vassals, ministers and councillors, well-to-do brahmins, and well-off householders came to the king bringing abundant wealth and said, ",
  "dn5:19.2": "‘Sire, this abundant wealth is specially for you alone; may Your Highness accept it!’ ",
  "dn5:19.3": "‘There’s enough raised for me through regular taxes. Let this be for you; and here, take even more!’ ",
  "dn5:19.4": "",
  "dn5:19.5": "When the king turned them down, they withdrew to one side to think up a plan, ",
  "dn5:19.6": "‘It wouldn’t be proper for us to take this abundant wealth back to our own homes. ",
  "dn5:19.7": "King Mahāvijita is performing a great sacrifice. Let us make an offering as an auxiliary sacrifice.’ ",
  "dn5:20.1": "Then the aristocrat vassals of town and country set up gifts to the east of the sacrificial enclosure. ",
  "dn5:20.2": "The ministers and councillors of town and country set up gifts to the south of the sacrificial enclosure. ",
  "dn5:20.3": "The well-to-do brahmins of town and country set up gifts to the west of the sacrificial enclosure. ",
  "dn5:20.4": "The well-off householders of town and country set up gifts to the north of the sacrificial enclosure. ",
  "dn5:20.5": "And brahmin, in that sacrifice too no cattle were killed, no goats were killed, and no chickens or pigs were killed. There was no slaughter of various kinds of creatures. No trees were felled for the sacrificial post. No grass was reaped to strew over the place of sacrifice. ",
  "dn5:20.6": "No bondservants, servants, or workers did their jobs under threat of punishment and danger, weeping with tearful faces. ",
  "dn5:20.7": "Those who wished to work did so, while those who did not wish to did not. ",
  "dn5:20.8": "They did the work they wanted to, and did not do what they didn’t want to. ",
  "dn5:20.9": "The sacrifice was completed with just ghee, oil, butter, curds, honey, and molasses. ",
  "dn5:20.10": "And so there were four consenting factions, eight factors possessed by King Mahāvijita, four factors possessed by the high priest, ",
  "dn5:20.11": "and three modes. ",
  "dn5:20.12": "Brahmin, this is called the sacrifice accomplished with three modes and sixteen accessories.” ",
  "dn5:21.1": "When he said this, those brahmins made an uproar, ",
  "dn5:21.2": "“Hooray for such sacrifice! Hooray for the accomplishment of such sacrifice!” ",
  "dn5:21.3": "But the brahmin Kūṭadanta sat in silence. ",
  "dn5:21.4": "So those brahmins said to him, ",
  "dn5:21.5": "“How can you not applaud the ascetic Gotama’s fine words?” ",
  "dn5:21.6": "“It’s not that I don’t applaud what he said. ",
  "dn5:21.7": "If anyone didn’t applaud such fine words, their head would explode! ",
  "dn5:21.8": "But, gentlemen, it occurs to me that ",
  "dn5:21.9": "the ascetic Gotama does not say: ",
  "dn5:21.10": "‘So I have heard’ or ‘It ought to be like this.’ ",
  "dn5:21.11": "Rather, he just says: ",
  "dn5:21.12": "‘So it was then, this is how it was then.’ ",
  "dn5:21.13": "It occurs to me that ",
  "dn5:21.14": "the ascetic Gotama at that time must have been King Mahāvijita, the owner of the sacrifice, or else the brahmin high priest who facilitated the sacrifice for him. ",
  "dn5:21.15": "Does the worthy Gotama recall having performed such a sacrifice, or having facilitated it, and then, when his body broke up, after death, being reborn in a good place, a heavenly realm?” ",
  "dn5:21.16": "“I do recall that, brahmin. For I myself was the brahmin high priest at that time who facilitated the sacrifice.” ",
  "dn5:22.0": "5. A Regular Gift as an Propitious Sacrifice. ",
  "dn5:22.1": "“But worthy Gotama, apart from that sacrifice accomplished with three modes and sixteen accessories, is there any other sacrifice that has fewer requirements and undertakings, yet is more fruitful and beneficial?” ",
  "dn5:22.2": "“There is, brahmin.” ",
  "dn5:22.3": "“But what is it?” ",
  "dn5:22.4": "“The regular gifts as propitious sacrifice given specially to ethical renunciates; ",
  "dn5:22.5": "this sacrifice, brahmin, has fewer requirements and undertakings, yet is more fruitful and beneficial.” ",
  "dn5:23.1": "“What is the cause, Mister Gotama, what is the reason why those regular gifts as propitious sacrifice have fewer requirements and undertakings, yet are more fruitful and beneficial, compared with the sacrifice accomplished with three modes and sixteen accessories?” ",
  "dn5:23.2": "“Because neither perfected ones nor those who are on the path to perfection will attend such a sacrifice. ",
  "dn5:23.3": "Why is that? ",
  "dn5:23.4": "Because beatings and throttlings are seen there. ",
  "dn5:23.5": "But the regular gifts as propitious sacrifice given specially to ethical renunciates; ",
  "dn5:23.6": "perfected ones and those who are on the path to perfection will attend such a sacrifice. ",
  "dn5:23.7": "Why is that? ",
  "dn5:23.8": "Because no beatings and throttlings are seen there. ",
  "dn5:23.9": "This is the cause, brahmin, this is the reason why those regular gifts as propitious sacrifice have fewer requirements and undertakings, yet are more fruitful and beneficial, compared with the sacrifice accomplished with three modes and sixteen accessories.” ",
  "dn5:24.1": "“But Mister Gotama, apart from that sacrifice accomplished with three modes and sixteen accessories and those regular gifts as propitious sacrifice, is there any other sacrifice that has fewer requirements and undertakings, yet is more fruitful and beneficial?” ",
  "dn5:24.2": "“There is, brahmin.” ",
  "dn5:24.3": "“But what is it?” ",
  "dn5:24.4": "“When someone gives a dwelling specially for the Saṅgha of the four quarters.” ",
  "dn5:25.1": "“But is there any other sacrifice that has fewer requirements and undertakings, yet is more fruitful and beneficial?” ",
  "dn5:25.2": "",
  "dn5:25.3": "",
  "dn5:25.4": "“When someone with confident heart goes for refuge to the Buddha, the teaching, and the Saṅgha.” ",
  "dn5:25.5": "",
  "dn5:26.1": "“But is there any other sacrifice that has fewer requirements and undertakings, yet is more fruitful and beneficial?” ",
  "dn5:26.2": "",
  "dn5:26.3": "",
  "dn5:26.4": "“When someone with a confident heart undertakes the training rules ",
  "dn5:26.5": "to refrain from killing living creatures, stealing, sexual misconduct, lying, and beer, wine, and liquor intoxicants.” ",
  "dn5:26.6": "",
  "dn5:27.1": "“But is there any other sacrifice that has fewer requirements and undertakings, yet is more fruitful and beneficial?” ",
  "dn5:27.2": "“There is, brahmin. ",
  "dn5:27.3": "",
  "dn5:27.4": "“It’s when a Realized One arises in the world, perfected, a fully awakened Buddha, accomplished in knowledge and conduct, holy, knower of the world, supreme guide for those who wish to train, teacher of gods and humans, awakened, blessed. ",
  "dn5:27.4.1.2": "He has realized with his own insight this world—with its gods, Māras, and divinities, this population with its ascetics and brahmins, gods and humans—and he makes it known to others. ",
  "dn5:27.4.1.3": "He proclaims a teaching that is good in the beginning, good in the middle, and good in the end, meaningful and well-phrased. And he reveals a spiritual practice that’s entirely full and pure. ",
  "dn5:27.4.2.1": "A householder hears that teaching, or a householder’s child, or someone reborn in a good family. ",
  "dn5:27.4.2.2": "They gain faith in the Realized One ",
  "dn5:27.4.2.3": "and reflect: ",
  "dn5:27.4.2.4": "‘Life at home is cramped and dirty, life gone forth is wide open. ",
  "dn5:27.4.2.5": "It’s not easy for someone living at home to lead the spiritual life utterly full and pure, like a polished shell. ",
  "dn5:27.4.2.6": "Why don’t I shave off my hair and beard, dress in ocher robes, and go forth from the lay life to homelessness?’ ",
  "dn5:27.4.2.7": "After some time they give up a large or small fortune, and a large or small family circle. They shave off hair and beard, dress in ocher robes, and go forth from the lay life to homelessness. ",
  "dn5:27.4.3.1": "Once they’ve gone forth, they live restrained in the monastic code, conducting themselves well and resorting for alms in suitable places. Seeing danger in the slightest fault, they keep the rules they’ve undertaken. They act skillfully by body and speech. They’re purified in livelihood and accomplished in ethical conduct. They guard the sense doors, have mindfulness and situational awareness, and are content. ",
  "dn5:27.4.4.0.1": "5.1. Ethics ",
  "dn5:27.4.4.0.2": "5.1.1. The Shorter Section on Ethics ",
  "dn5:27.4.4.1": "And how, brahmin, is a mendicant accomplished in ethics? ",
  "dn5:27.4.4.2": "It’s when a mendicant gives up killing living creatures, renouncing the rod and the sword. They’re scrupulous and kind, living full of sympathy for all living beings. ",
  "dn5:27.4.4.3": "This pertains to their ethics. ",
  "dn5:27.4.4.4": "They give up stealing. They take only what’s given, and expect only what’s given. They keep themselves clean by not thieving. ",
  "dn5:27.4.4.5": "This pertains to their ethics. ",
  "dn5:27.4.4.6": "They give up unchastity. They are chaste, set apart, avoiding the vulgar act of sex. ",
  "dn5:27.4.4.7": "This pertains to their ethics. ",
  "dn5:27.4.5.1": "They give up lying. They speak the truth and stick to the truth. They’re honest and dependable, and don’t trick the world with their words. ",
  "dn5:27.4.5.2": "This pertains to their ethics. ",
  "dn5:27.4.5.3": "They give up divisive speech. They don’t repeat in one place what they heard in another so as to divide people against each other. Instead, they reconcile those who are divided, supporting unity, delighting in harmony, loving harmony, speaking words that promote harmony. ",
  "dn5:27.4.5.4": "This pertains to their ethics. ",
  "dn5:27.4.5.5": "They give up harsh speech. They speak in a way that’s mellow, pleasing to the ear, lovely, going to the heart, polite, likable and agreeable to the people. ",
  "dn5:27.4.5.6": "This pertains to their ethics. ",
  "dn5:27.4.5.7": "They give up talking nonsense. Their words are timely, true, and meaningful, in line with the teaching and training. They say things at the right time which are valuable, reasonable, succinct, and beneficial. ",
  "dn5:27.4.5.8": "This pertains to their ethics. ",
  "dn5:27.4.6.1": "They refrain from injuring plants and seeds. ",
  "dn5:27.4.6.2": "They eat in one part of the day, abstaining from eating at night and food at the wrong time. ",
  "dn5:27.4.6.3": "They refrain from seeing shows of dancing, singing, and music . ",
  "dn5:27.4.6.4": "They refrain from beautifying and adorning themselves with garlands, fragrance, and makeup. ",
  "dn5:27.4.6.5": "They refrain from high and luxurious beds. ",
  "dn5:27.4.6.6": "They refrain from receiving gold and currency, ",
  "dn5:27.4.6.7": "raw grains, ",
  "dn5:27.4.6.8": "raw meat, ",
  "dn5:27.4.6.9": "women and girls, ",
  "dn5:27.4.6.10": "male and female bondservants, ",
  "dn5:27.4.6.11": "goats and sheep, ",
  "dn5:27.4.6.12": "chickens and pigs, ",
  "dn5:27.4.6.13": "elephants, cows, horses, and mares, ",
  "dn5:27.4.6.14": "and fields and land. ",
  "dn5:27.4.6.15": "They refrain from running errands and messages; ",
  "dn5:27.4.6.16": "buying and selling; ",
  "dn5:27.4.6.17": "falsifying weights, metals, or measures; ",
  "dn5:27.4.6.18": "bribery, fraud, cheating, and duplicity; ",
  "dn5:27.4.6.19": "mutilation, murder, abduction, banditry, plunder, and violence. ",
  "dn5:27.4.6.20": "This pertains to their ethics. ",
  "dn5:27.4.6.21": "The shorter section on ethics is finished. ",
  "dn5:27.4.7.0": "5.1.2. The Middle Section on Ethics ",
  "dn5:27.4.7.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in injuring plants and seeds. ",
  "dn5:27.4.7.2": "These include plants propagated from roots, stems, cuttings, or joints; and those from regular seeds as the fifth. They refrain from such injury to plants and seeds. ",
  "dn5:27.4.7.3": "This pertains to their ethics. ",
  "dn5:27.4.8.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in storing up goods for their own use. ",
  "dn5:27.4.8.2": "This includes such things as food, drink, clothes, vehicles, bedding, fragrance, and things of the flesh. ",
  "dn5:27.4.8.3": "They refrain from storing up such goods. ",
  "dn5:27.4.8.4": "This pertains to their ethics. ",
  "dn5:27.4.9.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in seeing shows. ",
  "dn5:27.4.9.2": "This includes such things as dancing, singing, music, performances, and storytelling; clapping, gongs, and kettledrums; beauty pageants; pole-acrobatics and bone-washing displays of the corpse-workers; battles of elephants, horses, buffaloes, bulls, goats, rams, chickens, and quails; staff-fights, boxing, and wrestling; combat, roll calls of the armed forces, battle-formations, and regimental reviews. ",
  "dn5:27.4.9.3": "They refrain from such shows. ",
  "dn5:27.4.9.4": "This pertains to their ethics. ",
  "dn5:27.4.10.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in gambling that causes negligence. ",
  "dn5:27.4.10.2": "This includes such things as checkers with eight or ten rows, checkers in the air, hopscotch, spillikins, board-games, tip-cat, drawing straws, dice, leaf-flutes, toy plows, somersaults, pinwheels, toy measures, toy carts, toy bows, guessing words from syllables, guessing another’s thoughts, and imitating musical instruments. ",
  "dn5:27.4.10.3": "They refrain from such gambling. ",
  "dn5:27.4.10.4": "This pertains to their ethics. ",
  "dn5:27.4.11.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still make use of high and luxurious bedding. ",
  "dn5:27.4.11.2": "This includes such things as sofas, couches, woolen covers—shag-piled, colorful, white, embroidered with flowers, quilted, embroidered with animals, double-or single-fringed—and silk covers studded with gems, as well as silken sheets, woven carpets, rugs for elephants, horses, or chariots, antelope hide rugs, and spreads of fine deer hide, with a canopy above and red cushions at both ends. ",
  "dn5:27.4.11.3": "They refrain from such bedding. ",
  "dn5:27.4.11.4": "This pertains to their ethics. ",
  "dn5:27.4.12.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in beautifying and adorning themselves with garlands, fragrance, and makeup. ",
  "dn5:27.4.12.2": "This includes such things as applying beauty products by anointing, massaging, bathing, and rubbing; mirrors, ointments, garlands, fragrances, and makeup; face-powder, foundation, bracelets, headbands, fancy walking-sticks or containers, rapiers, parasols, fancy sandals, turbans, jewelry, chowries, and long-fringed white robes. ",
  "dn5:27.4.12.3": "They refrain from such beautification and adornment. ",
  "dn5:27.4.12.4": "This pertains to their ethics. ",
  "dn5:27.4.13.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in low talk. ",
  "dn5:27.4.13.2": "This includes such topics as talk about kings, bandits, and ministers; talk about armies, threats, and wars; talk about food, drink, clothes, and beds; talk about garlands and fragrances; talk about family, vehicles, villages, towns, cities, and countries; talk about women and heroes; street talk and well talk; talk about the departed; motley talk; tales of land and sea; and talk about being reborn in this or that place. ",
  "dn5:27.4.13.3": "They refrain from such low talk. ",
  "dn5:27.4.13.4": "This pertains to their ethics. ",
  "dn5:27.4.14.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in arguments. ",
  "dn5:27.4.14.2": "They say such things as: ‘You don’t understand this teaching and training. I understand this teaching and training. What, you understand this teaching and training? You’re practicing wrong. I’m practicing right. I stay on topic, you don’t. You said last what you should have said first. You said first what you should have said last. What you’ve thought so much about has been disproved. Your doctrine is refuted. Go on, save your doctrine! You’re trapped; get yourself out of this—if you can!’ ",
  "dn5:27.4.14.3": "They refrain from such argumentative talk. ",
  "dn5:27.4.14.4": "This pertains to their ethics. ",
  "dn5:27.4.15.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in running errands and messages. ",
  "dn5:27.4.15.2": "This includes running errands for rulers, ministers, aristocrats, brahmins, householders, or princes who say: ‘Go here, go there. Take this, bring that from there.’ ",
  "dn5:27.4.15.3": "They refrain from such errands. ",
  "dn5:27.4.15.4": "This pertains to their ethics. ",
  "dn5:27.4.16.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still engage in deceit, flattery, hinting, and belittling, and using material things to chase after other material things. They refrain from such deceit and flattery. ",
  "dn5:27.4.16.2": "This pertains to their ethics. ",
  "dn5:27.4.16.3": "The middle section on ethics is finished. ",
  "dn5:27.4.17.0": "5.1.3. The Long Section on Ethics ",
  "dn5:27.4.17.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn5:27.4.17.2": "This includes such fields as limb-reading, omenology, divining celestial portents, interpreting dreams, divining bodily marks, divining holes in cloth gnawed by mice, fire offerings, ladle offerings, offerings of husks, rice powder, rice, ghee, or oil; offerings from the mouth, blood sacrifices, palmistry; geomancy for building sites, fields, and cemeteries; exorcisms, earth magic, snake charming, poisons; the lore of the scorpion, the rat, the bird, and the crow; prophesying lifespan, chanting for protection, and divining omens from wild animals. ",
  "dn5:27.4.17.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn5:27.4.17.4": "This pertains to their ethics. ",
  "dn5:27.4.18.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn5:27.4.18.2": "This includes reading the marks of gems, cloth, clubs, swords, spears, arrows, bows, weapons, women, men, boys, girls, male and female bondservants, elephants, horses, buffaloes, bulls, cows, goats, rams, chickens, quails, monitor lizards, rabbits, tortoises, or deer. ",
  "dn5:27.4.18.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn5:27.4.18.4": "This pertains to their ethics. ",
  "dn5:27.4.19.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn5:27.4.19.2": "This includes making predictions that the king will march forth or march back; or that our king will attack and the enemy king will retreat, or vice versa; or that our king will triumph and the enemy king will be defeated, or vice versa; and so there will be victory for one and defeat for the other. ",
  "dn5:27.4.19.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn5:27.4.19.4": "This pertains to their ethics. ",
  "dn5:27.4.20.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn5:27.4.20.2": "This includes making predictions that there will be an eclipse of the moon, or sun, or stars; that the sun, moon, and stars will be in conjunction or in opposition; that there will be a meteor shower, a fiery sky, an earthquake, or thunder in the heavens; that there will be a rising, a setting, a darkening, a brightening of the moon, sun, and stars. And it also includes making predictions about the results of all such phenomena. ",
  "dn5:27.4.20.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn5:27.4.20.4": "This pertains to their ethics. ",
  "dn5:27.4.21.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn5:27.4.21.2": "This includes predicting whether there will be plenty of rain or drought; plenty to eat or famine; an abundant harvest or a bad harvest; security or peril; sickness or health. It also includes such occupations as arithmetic, accounting, calculating, poetry, and cosmology. ",
  "dn5:27.4.21.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn5:27.4.21.4": "This pertains to their ethics. ",
  "dn5:27.4.22.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn5:27.4.22.2": "This includes making arrangements for giving and taking in marriage; for engagement and divorce; and for scattering rice inwards or outwards at the wedding ceremony. It also includes casting spells for good or bad luck, treating impacted fetuses, binding the tongue, or locking the jaws; charms for the hands and ears; questioning a mirror, a girl, or a god as an oracle; worshiping the sun, worshiping the Great One, breathing fire, and invoking Siri, the goddess of luck. ",
  "dn5:27.4.22.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn5:27.4.22.4": "This pertains to their ethics. ",
  "dn5:27.4.23.1": "There are some ascetics and brahmins who, while enjoying food given in faith, still earn a living by low lore, by wrong livelihood. ",
  "dn5:27.4.23.2": "This includes rites for propitiation, for granting wishes, for ghosts, for the earth, for rain, for property settlement, and for preparing and consecrating house sites, and rites involving rinsing and bathing, and oblations. It also includes administering emetics, purgatives, expectorants, and phlegmagogues; administering ear-oils, eye restoratives, nasal medicine, ointments, and counter-ointments; surgery with needle and scalpel, treating children, prescribing root medicines, and binding on herbs. ",
  "dn5:27.4.23.3": "They refrain from such low lore, such wrong livelihood. ",
  "dn5:27.4.23.4": "This pertains to their ethics. ",
  "dn5:27.4.24.1": "A mendicant thus accomplished in ethics sees no danger in any quarter in regards to their ethical restraint. ",
  "dn5:27.4.24.2": "It’s like a king who has defeated his enemies. He sees no danger from his foes in any quarter. ",
  "dn5:27.4.24.3": "In the same way, a mendicant thus accomplished in ethics sees no danger in any quarter in regards to their ethical restraint. ",
  "dn5:27.4.24.4": "When they have this entire spectrum of noble ethics, they experience a blameless happiness inside themselves. ",
  "dn5:27.5": "That’s how a mendicant is accomplished in ethics. ",
  "dn5:27.5.1.6": "The longer section on ethics is finished. ",
  "dn5:27.5.2.0.1": "5.2. Immersion ",
  "dn5:27.5.2.0.2": "5.2.1. Sense Restraint ",
  "dn5:27.5.2.1": "And how does a mendicant guard the sense doors? ",
  "dn5:27.5.2.2": "When a mendicant sees a sight with their eyes, they don’t get caught up in the features and details. ",
  "dn5:27.5.2.3": "If the faculty of sight were left unrestrained, bad unskillful qualities of covetousness and displeasure would become overwhelming. For this reason, they practice restraint, protecting the faculty of sight, and achieving its restraint. ",
  "dn5:27.5.2.4": "When they hear a sound with their ears … ",
  "dn5:27.5.2.5": "When they smell an odor with their nose … ",
  "dn5:27.5.2.6": "When they taste a flavor with their tongue … ",
  "dn5:27.5.2.7": "When they feel a touch with their body … ",
  "dn5:27.5.2.8": "When they know an idea with their mind, they don’t get caught up in the features and details. ",
  "dn5:27.5.2.9": "If the faculty of mind were left unrestrained, bad unskillful qualities of covetousness and displeasure would become overwhelming. For this reason, they practice restraint, protecting the faculty of mind, and achieving its restraint. ",
  "dn5:27.5.2.10": "When they have this noble sense restraint, they experience an unsullied bliss inside themselves. ",
  "dn5:27.5.2.11": "That’s how a mendicant guards the sense doors. ",
  "dn5:27.5.3.0": "5.2.2. Mindfulness and Situational Awareness ",
  "dn5:27.5.3.1": "And how does a mendicant have mindfulness and situational awareness? ",
  "dn5:27.5.3.2": "It’s when a mendicant acts with situational awareness when going out and coming back; when looking ahead and aside; when bending and extending the limbs; when bearing the outer robe, bowl and robes; when eating, drinking, chewing, and tasting; when urinating and defecating; when walking, standing, sitting, sleeping, waking, speaking, and keeping silent. ",
  "dn5:27.5.3.3": "That’s how a mendicant has mindfulness and situational awareness. ",
  "dn5:27.5.4.0": "5.2.3. Contentment ",
  "dn5:27.5.4.1": "And how is a mendicant content? ",
  "dn5:27.5.4.2": "It’s when a mendicant is content with robes to look after the body and almsfood to look after the belly. Wherever they go, they set out taking only these things. ",
  "dn5:27.5.4.3": "They’re like a bird: wherever it flies, wings are its only burden. ",
  "dn5:27.5.4.4": "In the same way, a mendicant is content with robes to look after the body and almsfood to look after the belly. Wherever they go, they set out taking only these things. ",
  "dn5:27.5.4.5": "That’s how a mendicant is content. ",
  "dn5:27.5.5.0": "5.2.4. Giving Up the Hindrances ",
  "dn5:27.5.5.1": "When they have this entire spectrum of noble ethics, this noble sense restraint, this noble mindfulness and situational awareness, and this noble contentment, ",
  "dn5:27.5.5.2": "they frequent a secluded lodging—a wilderness, the root of a tree, a hill, a ravine, a mountain cave, a charnel ground, a forest, the open air, a heap of straw. ",
  "dn5:27.5.5.3": "After the meal, they return from almsround, sit down cross-legged, set their body straight, and establish mindfulness in their presence. ",
  "dn5:27.5.6.1": "Giving up covetousness for the world, they meditate with a heart rid of covetousness, cleansing the mind of covetousness. ",
  "dn5:27.5.6.2": "Giving up ill will and malevolence, they meditate with a mind rid of ill will, full of sympathy for all living beings, cleansing the mind of ill will. ",
  "dn5:27.5.6.3": "Giving up dullness and drowsiness, they meditate with a mind rid of dullness and drowsiness, perceiving light, mindful and aware, cleansing the mind of dullness and drowsiness. ",
  "dn5:27.5.6.4": "Giving up restlessness and remorse, they meditate without restlessness, their mind peaceful inside, cleansing the mind of restlessness and remorse. ",
  "dn5:27.5.6.5": "Giving up doubt, they meditate having gone beyond doubt, not undecided about skillful qualities, cleansing the mind of doubt. ",
  "dn5:27.5.7.1": "Suppose a man who has gotten into debt were to apply himself to work, ",
  "dn5:27.5.7.2": "and his efforts proved successful. ",
  "dn5:27.5.7.3": "He would pay off the original loan and have enough left over to support his partner. ",
  "dn5:27.5.7.4": "Thinking about this, ",
  "dn5:27.5.7.5": "",
  "dn5:27.5.7.6": "",
  "dn5:27.5.7.7": "",
  "dn5:27.5.7.8": "he’d be filled with joy and happiness. ",
  "dn5:27.5.8.1": "Suppose there was a person who was sick, suffering, gravely ill. They’d lose their appetite and get physically weak. ",
  "dn5:27.5.8.2": "But after some time they’d recover from that illness, and regain their appetite and their strength. ",
  "dn5:27.5.8.3": "Thinking about this, ",
  "dn5:27.5.8.4": "",
  "dn5:27.5.8.5": "",
  "dn5:27.5.8.6": "",
  "dn5:27.5.8.7": "",
  "dn5:27.5.8.8": "they’d be filled with joy and happiness. ",
  "dn5:27.5.9.1": "Suppose a person was imprisoned in a jail. ",
  "dn5:27.5.9.2": "But after some time they were released from jail, safe and sound, with no loss of wealth. ",
  "dn5:27.5.9.3": "Thinking about this, ",
  "dn5:27.5.9.4": "",
  "dn5:27.5.9.5": "",
  "dn5:27.5.9.6": "they’d be filled with joy and happiness. ",
  "dn5:27.5.10.1": "Suppose a person was a bondservant. They would not be their own master, but indentured to another, unable to go where they wish. ",
  "dn5:27.5.10.2": "But after some time they’d be freed from servitude. They would be their own master, not indentured to another, an emancipated individual able to go where they wish. ",
  "dn5:27.5.10.3": "Thinking about this, ",
  "dn5:27.5.10.4": "",
  "dn5:27.5.10.5": "",
  "dn5:27.5.10.6": "they’d be filled with joy and happiness. ",
  "dn5:27.5.11.1": "Suppose there was a person with wealth and property who was traveling along a desert road, which was perilous, with nothing to eat. ",
  "dn5:27.5.11.2": "But after some time they crossed over the desert safely, arriving within a village, a sanctuary free of peril. ",
  "dn5:27.5.11.3": "Thinking about this, ",
  "dn5:27.5.11.4": "",
  "dn5:27.5.11.5": "",
  "dn5:27.5.11.6": "they’d be filled with joy and happiness. ",
  "dn5:27.5.12.1": "In the same way, as long as these five hindrances are not given up inside themselves, a mendicant regards them thus as a debt, a disease, a prison, slavery, and a desert crossing. ",
  "dn5:27.5.12.2": "But when these five hindrances are given up inside themselves, a mendicant regards this as freedom from debt, good health, release from prison, emancipation, and a place of sanctuary at last. ",
  "dn5:27.5.12.3": "",
  "dn5:27.5.12.4": "Seeing that the hindrances have been given up in them, joy springs up. Being joyful, rapture springs up. When the mind is full of rapture, the body becomes tranquil. When the body is tranquil, they feel bliss. And when blissful, the mind becomes immersed. ",
  "dn5:27.5.13.0": "5.2.5. First Absorption ",
  "dn5:27.6": "Quite secluded from sensual pleasures, secluded from unskillful qualities, they enter and remain in the first absorption, which has the rapture and bliss born of seclusion, while placing the mind and keeping it connected. ",
  "dn5:27.6.1.2": "They drench, steep, fill, and spread their body with rapture and bliss born of seclusion. There’s no part of the body that’s not spread with rapture and bliss born of seclusion. ",
  "dn5:27.6.2.1": "It’s like when a deft bathroom attendant or their apprentice pours bath powder into a bronze dish, sprinkling it little by little with water. They knead it until the ball of bath powder is soaked and saturated with moisture, spread through inside and out; yet no moisture oozes out. ",
  "dn5:27.6.2.2": "In the same way, a mendicant drenches, steeps, fills, and spreads their body with rapture and bliss born of seclusion. There’s no part of the body that’s not spread with rapture and bliss born of seclusion. ",
  "dn5:27.7": "This sacrifice has fewer requirements and undertakings than the former, yet is more fruitful and beneficial. ",
  "dn5:27.7.1.0": "5.2.6. Second Absorption ",
  "dn5:27.8": "Furthermore, as the placing of the mind and keeping it connected are stilled, a mendicant enters and remains in the second absorption, which has the rapture and bliss born of immersion, with internal clarity and mind at one, without applying the mind and keeping it connected. ",
  "dn5:27.8.1.2": "They drench, steep, fill, and spread their body with rapture and bliss born of immersion. There’s no part of the body that’s not spread with rapture and bliss born of immersion. ",
  "dn5:27.8.2.1": "It’s like a deep lake fed by spring water. There’s no inlet to the east, west, north, or south, and the heavens would not properly bestow showers from time to time. ",
  "dn5:27.8.2.2": "But the stream of cool water welling up in the lake drenches, steeps, fills, and spreads throughout the lake. There’s no part of the lake that’s not spread through with cool water. ",
  "dn5:27.8.2.3": "In the same way, a mendicant drenches, steeps, fills, and spreads their body with rapture and bliss born of immersion. There’s no part of the body that’s not spread with rapture and bliss born of immersion. ",
  "dn5:27.8.2.4": "This sacrifice has fewer requirements and undertakings than the former, yet is more fruitful and beneficial. ",
  "dn5:27.8.3.0": "5.2.7. Third Absorption ",
  "dn5:27.9": "Furthermore, with the fading away of rapture, a mendicant enters and remains in the third absorption, where they meditate with equanimity, mindful and aware, personally experiencing the bliss of which the noble ones declare, ‘Equanimous and mindful, one meditates in bliss.’ ",
  "dn5:27.9.1.2": "They drench, steep, fill, and spread their body with bliss free of rapture. There’s no part of the body that’s not spread with bliss free of rapture. ",
  "dn5:27.9.2.1": "It’s like a pool with blue water lilies, or pink or white lotuses. Some of them sprout and grow in the water without rising above it, thriving underwater. From the tip to the root they’re drenched, steeped, filled, and soaked with cool water. There’s no part of them that’s not soaked with cool water. ",
  "dn5:27.9.2.2": "In the same way, a mendicant drenches, steeps, fills, and spreads their body with bliss free of rapture. There’s no part of the body that’s not spread with bliss free of rapture. ",
  "dn5:27.9.2.3": "This sacrifice has fewer requirements and undertakings than the former, yet is more fruitful and beneficial. ",
  "dn5:27.9.3.0": "5.2.8. Fourth Absorption ",
  "dn5:27.10": "Furthermore, giving up pleasure and pain, and ending former happiness and sadness, a mendicant enters and remains in the fourth absorption, without pleasure or pain, with pure equanimity and mindfulness. ",
  "dn5:27.10.1.2": "They sit spreading their body through with pure bright mind. There’s no part of the body that’s not spread with pure bright mind. ",
  "dn5:27.10.2.1": "It’s like someone sitting wrapped from head to foot with white cloth. There’s no part of the body that’s not spread over with white cloth. ",
  "dn5:27.10.2.2": "In the same way, they sit spreading their body through with pure bright mind. There’s no part of the body that’s not spread with pure bright mind. ",
  "dn5:27.11": "This sacrifice has fewer requirements and undertakings than the former, yet is more fruitful and beneficial. ",
  "dn5:27.11.1.0.1": "5.3. The Eight Knowledges ",
  "dn5:27.11.1.0.2": "5.3.1. Knowledge and Vision ",
  "dn5:27.12": "When their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward knowledge and vision. ",
  "dn5:27.12.1.2": "They understand: ",
  "dn5:27.12.1.3": "‘This body of mine is formed. It’s made up of the four principal states, produced by mother and father, built up from rice and porridge, liable to impermanence, to wearing away and erosion, to breaking up and destruction. ",
  "dn5:27.12.1.4": "And this consciousness of mine is attached to it, tied to it.’ ",
  "dn5:27.12.2.1": "Suppose there was a beryl gem that was naturally beautiful, eight-faceted, well-worked, transparent, clear, and unclouded, endowed with all good qualities. ",
  "dn5:27.12.2.2": "And it was strung with a thread of blue, yellow, red, white, or golden brown. ",
  "dn5:27.12.2.3": "And someone with clear eyes were to take it in their hand and check it: ",
  "dn5:27.12.2.4": "‘This beryl gem is naturally beautiful, eight-faceted, well-worked, transparent, clear, and unclouded, endowed with all good qualities. ",
  "dn5:27.12.2.5": "And it’s strung with a thread of blue, yellow, red, white, or golden brown.’ ",
  "dn5:27.12.2.6": "In the same way, when their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward knowledge and vision. ",
  "dn5:27.12.2.7": "",
  "dn5:27.12.2.8": "",
  "dn5:27.12.2.9": "",
  "dn5:27.13": "This sacrifice has fewer requirements and undertakings than the former, yet is more fruitful and beneficial. ",
  "dn5:27.13.1.0": "5.3.2. Mind-Made Body ",
  "dn5:27.13.1.1": "When their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward the creation of a mind-made body. ",
  "dn5:27.13.1.2": "From this body they create another body—formed, mind-made, whole in its major and minor limbs, not deficient in any faculty. ",
  "dn5:27.13.2.1": "Suppose a person was to draw a reed out from its sheath. ",
  "dn5:27.13.2.2": "They’d think: ",
  "dn5:27.13.2.3": "‘This is the reed, this is the sheath. The reed and the sheath are different things. The reed has been drawn out from the sheath.’ ",
  "dn5:27.13.2.4": "Or suppose a person was to draw a sword out from its scabbard. ",
  "dn5:27.13.2.5": "They’d think: ",
  "dn5:27.13.2.6": "‘This is the sword, this is the scabbard. The sword and the scabbard are different things. The sword has been drawn out from the scabbard.’ ",
  "dn5:27.13.2.7": "Or suppose a person was to draw a snake out from its slough. ",
  "dn5:27.13.2.8": "They’d think: ",
  "dn5:27.13.2.9": "‘This is the snake, this is the slough. The snake and the slough are different things. The snake has been drawn out from the slough.’ ",
  "dn5:27.13.2.10": "In the same way, when their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward the creation of a mind-made body. ",
  "dn5:27.13.2.11": "From this body they create another body—formed, mind-made, whole in its major and minor limbs, not deficient in any faculty. ",
  "dn5:27.13.2.12": "This sacrifice has fewer requirements and undertakings than the former, yet is more fruitful and beneficial. ",
  "dn5:27.13.3.0": "5.3.3. Psychic Powers ",
  "dn5:27.13.3.1": "When their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward psychic power. ",
  "dn5:27.13.3.2": "They wield the many kinds of psychic power: multiplying themselves and becoming one again; appearing and disappearing; going unobstructed through a wall, a rampart, or a mountain as if through space; diving in and out of the earth as if it were water; walking on water as if it were earth; flying cross-legged through the sky like a bird; touching and stroking with the hand the sun and moon, so mighty and powerful; controlling the body as far as the realm of divinity. ",
  "dn5:27.13.4.1": "Suppose a deft potter or their apprentice had some well-prepared clay. They could produce any kind of pot that they like. ",
  "dn5:27.13.4.2": "Or suppose a deft ivory-carver or their apprentice had some well-prepared ivory. They could produce any kind of ivory item that they like. ",
  "dn5:27.13.4.3": "Or suppose a deft goldsmith or their apprentice had some well-prepared gold. They could produce any kind of gold item that they like. ",
  "dn5:27.13.4.4": "In the same way, when their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward psychic power. ",
  "dn5:27.13.4.5": "",
  "dn5:27.13.4.6": "This sacrifice has fewer requirements and undertakings than the former, yet is more fruitful and beneficial. ",
  "dn5:27.13.5.0": "5.3.4. Clairaudience ",
  "dn5:27.13.5.1": "When their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward clairaudience. ",
  "dn5:27.13.5.2": "With clairaudience that is purified and superhuman, they hear both kinds of sounds, human and heavenly, whether near or far. ",
  "dn5:27.13.6.1": "Suppose there was a person traveling along the road. They’d hear the sound of drums, clay drums, horns, kettledrums, and tom-toms. They’d think: ‘That’s the sound of drums,’ and ‘that’s the sound of clay drums,’ and ‘that’s the sound of horns, kettledrums, and tom-toms.’ ",
  "dn5:27.13.6.2": "In the same way, when their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward clairaudience. ",
  "dn5:27.13.6.3": "With clairaudience that is purified and superhuman, they hear both kinds of sounds, human and heavenly, whether near or far. ",
  "dn5:27.13.6.4": "This sacrifice has fewer requirements and undertakings than the former, yet is more fruitful and beneficial. ",
  "dn5:27.13.7.0": "5.3.5. Comprehending the Minds of Others ",
  "dn5:27.13.7.1": "When their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward comprehending the minds of others. ",
  "dn5:27.13.7.2": "They understand the minds of other beings and individuals, having comprehended them with their own mind. ",
  "dn5:27.13.7.3": "They understand mind with greed as ‘mind with greed’, ",
  "dn5:27.13.7.4": "and mind without greed as ‘mind without greed’. ",
  "dn5:27.13.7.5": "They understand mind with hate … ",
  "dn5:27.13.7.6": "mind without hate … ",
  "dn5:27.13.7.7": "mind with delusion … ",
  "dn5:27.13.7.8": "mind without delusion … ",
  "dn5:27.13.7.9": "constricted mind … ",
  "dn5:27.13.7.10": "scattered mind … ",
  "dn5:27.13.7.11": "expansive mind … ",
  "dn5:27.13.7.12": "unexpansive mind … ",
  "dn5:27.13.7.13": "mind that is not supreme … ",
  "dn5:27.13.7.14": "mind that is supreme … ",
  "dn5:27.13.7.15": "immersed mind … ",
  "dn5:27.13.7.16": "unimmersed mind … ",
  "dn5:27.13.7.17": "freed mind … ",
  "dn5:27.13.7.18": "They understand unfreed mind as ‘unfreed mind’. ",
  "dn5:27.13.8.1": "Suppose there was a woman or man who was young, youthful, and fond of adornments, and they check their own reflection in a clean bright mirror or a clear bowl of water. If they had a spot they’d know ‘I have a spot,’ and if they had no spots they’d know ‘I have no spots.’ ",
  "dn5:27.13.8.2": "In the same way, when their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward comprehending the minds of others. ",
  "dn5:27.13.8.3": "They understand the minds of other beings and individuals, having comprehended them with their own mind. ",
  "dn5:27.13.8.4": "This sacrifice has fewer requirements and undertakings than the former, yet is more fruitful and beneficial. ",
  "dn5:27.13.9.0": "5.3.6. Recollection of Past Lives ",
  "dn5:27.13.9.1": "When their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward recollection of past lives. ",
  "dn5:27.13.9.2": "They recollect many kinds of past lives, that is, one, two, three, four, five, ten, twenty, thirty, forty, fifty, a hundred, a thousand, a hundred thousand rebirths; many eons of the world contracting, many eons of the world expanding, many eons of the world contracting and expanding. They remember: ‘There, I was named this, my clan was that, I looked like this, and that was my food. This was how I felt pleasure and pain, and that was how my life ended. When I passed away from that place I was reborn somewhere else. There, too, I was named this, my clan was that, I looked like this, and that was my food. This was how I felt pleasure and pain, and that was how my life ended. When I passed away from that place I was reborn here.’ And so they recollect their many kinds of past lives, with features and details. ",
  "dn5:27.13.10.1": "Suppose a person was to leave their home village and go to another village. From that village they’d go to yet another village. And from that village they’d return to their home village. They’d think: ‘I went from my home village to another village. There I stood like this, sat like that, spoke like this, or kept silent like that. From that village I went to yet another village. There too I stood like this, sat like that, spoke like this, or kept silent like that. And from that village I returned to my home village.’ ",
  "dn5:27.13.10.2": "In the same way, when their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward recollection of past lives. ",
  "dn5:27.13.10.3": "",
  "dn5:27.13.10.4": "This sacrifice has fewer requirements and undertakings than the former, yet is more fruitful and beneficial. ",
  "dn5:27.13.11.0": "5.3.7. Clairvoyance ",
  "dn5:27.13.11.1": "When their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward knowledge of the death and rebirth of sentient beings. ",
  "dn5:27.13.11.2": "With clairvoyance that is purified and superhuman, they see sentient beings passing away and being reborn—inferior and superior, beautiful and ugly, in a good place or a bad place. They understand how sentient beings are reborn according to their deeds: ‘These dear beings did bad things by way of body, speech, and mind. They denounced the noble ones; they had wrong view; and they chose to act out of that wrong view. When their body breaks up, after death, they’re reborn in a place of loss, a bad place, the underworld, hell. These dear beings, however, did good things by way of body, speech, and mind. They never denounced the noble ones; they had right view; and they chose to act out of that right view. When their body breaks up, after death, they’re reborn in a good place, a heavenly realm.’ And so, with clairvoyance that is purified and superhuman, they see sentient beings passing away and being reborn—inferior and superior, beautiful and ugly, in a good place or a bad place. They understand how sentient beings are reborn according to their deeds. ",
  "dn5:27.13.12.1": "Suppose there was a stilt longhouse at the central square. A person with clear eyes standing there might see humans entering and leaving a house, walking along the streets and paths, and sitting at the central square. They’d think: ‘These are people entering and leaving a house, walking along the streets and paths, and sitting at the central square.’ ",
  "dn5:27.13.12.2": "In the same way, when their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward knowledge of the death and rebirth of sentient beings. ",
  "dn5:27.13.12.3": "",
  "dn5:27.13.12.4": "This sacrifice has fewer requirements and undertakings than the former, yet is more fruitful and beneficial. ",
  "dn5:27.13.13.0": "5.3.8. Ending of Defilements ",
  "dn5:27.13.13.1": "When their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward knowledge of the ending of defilements. ",
  "dn5:27.13.13.2": "They truly understand: ‘This is suffering’ … ‘This is the origin of suffering’ … ‘This is the cessation of suffering’ … ‘This is the practice that leads to the cessation of suffering’. ",
  "dn5:27.13.13.3": "They truly understand: ‘These are defilements’ … ‘This is the origin of defilements’ … ‘This is the cessation of defilements’ … ‘This is the practice that leads to the cessation of defilements’. ",
  "dn5:27.13.13.4": "Knowing and seeing like this, their mind is freed from the defilements of sensuality, desire to be reborn, and ignorance. ",
  "dn5:27.13.13.5": "When they’re freed, they know they’re freed. ",
  "dn5:27.14": "They understand: ‘Rebirth is ended, the spiritual journey has been completed, what had to be done has been done, there is nothing further for this place.’ ",
  "dn5:27.14.1.1": "Suppose that in a mountain glen there was a lake that was transparent, clear, and unclouded. A person with clear eyes standing on the bank would see the clams and mussels, and pebbles and gravel, and schools of fish swimming about or staying still. They’d think: ‘This lake is transparent, clear, and unclouded. And here are the clams and mussels, and pebbles and gravel, and schools of fish swimming about or staying still.’ ",
  "dn5:27.14.1.2": "In the same way, when their mind has become immersed in samādhi like this—purified, bright, flawless, rid of corruptions, pliable, workable, steady, and imperturbable—they project it and extend it toward knowledge of the ending of defilements. ",
  "dn5:27.15": "This sacrifice has fewer requirements and undertakings than the former, yet is more fruitful and beneficial. ",
  "dn5:27.16": "And, brahmin, there is no other accomplishment of sacrifice which is better and finer than this.” ",
  "dn5:28.0": "6. Kūṭadanta Declares Himself a Lay Follower ",
  "dn5:28.1": "When he had spoken, Kūṭadanta said to the Buddha, ",
  "dn5:28.2": "“Excellent, worthy Gotama! Excellent! ",
  "dn5:28.3": "As if he were righting the overturned, or revealing the hidden, or pointing out the path to the lost, or lighting a lamp in the dark so people with clear eyes can see what’s there, worthy Gotama has made the Teaching clear in many ways. ",
  "dn5:28.4": "I go for refuge to the worthy Gotama, to the teaching, and to the mendicant Saṅgha. ",
  "dn5:28.5": "From this day forth, may the worthy Gotama remember me as a lay follower who has gone for refuge for life. ",
  "dn5:28.6": "And these bulls, bullocks, heifers, goats, and rams—seven hundred of each—I release them, I grant them life! Let them eat green grass and drink cool water, and may a cool breeze blow upon them!” ",
  "dn5:29.0": "7. The Realization of the Fruit of Stream-Entry ",
  "dn5:29.1": "Then the Buddha taught Kūṭadanta step by step, with ",
  "dn5:29.2": "a talk on giving, ethical conduct, and heaven. He explained the drawbacks of sensual pleasures, so sordid and corrupt, and the benefit of renunciation. ",
  "dn5:29.3": "And when he knew that Kūṭadanta’s mind was ready, pliable, rid of hindrances, elated, and confident he explained the special teaching of the Buddhas: ",
  "dn5:29.4": "suffering, its origin, its cessation, and the path. ",
  "dn5:29.5": "Just as a clean cloth rid of stains would properly absorb dye, ",
  "dn5:29.6": "in that very seat the stainless, immaculate vision of the Dhamma arose in the brahmin Kūṭadanta: ",
  "dn5:29.7": "“Everything that has a beginning has an end.” ",
  "dn5:30.1": "Then Kūṭadanta saw, attained, understood, and fathomed the Dhamma. He went beyond doubt, got rid of indecision, and became self-assured and independent of others regarding the Teacher’s instructions. He said to the Buddha, ",
  "dn5:30.2": "“Would the worthy Gotama together with the mendicant Saṅgha please accept tomorrow’s meal from me?” ",
  "dn5:30.3": "The Buddha consented with silence. ",
  "dn5:30.4": "Then, knowing that the Buddha had consented, Kūṭadanta got up from his seat, bowed, and respectfully circled the Buddha, keeping him on his right, before leaving. ",
  "dn5:30.5": "And when the night had passed Kūṭadanta had delicious fresh and cooked foods prepared in his own sacrificial enclosure. Then he had the Buddha informed of the time, saying, ",
  "dn5:30.6": "“It’s time, worthy Gotama, the meal is ready.” ",
  "dn5:30.7": "Then the Buddha robed up in the morning and, taking his bowl and robe, went to the sacrificial enclosure of Kūṭadanta together with the mendicant Saṅgha, where he sat on the seat spread out. ",
  "dn5:30.8": "Then Kūṭadanta served and satisfied the mendicant Saṅgha headed by the Buddha with his own hands with delicious fresh and cooked foods. ",
  "dn5:30.9": "When the Buddha had eaten and washed his hand and bowl, Kūṭadanta took a low seat and sat to one side. ",
  "dn5:30.10": "Then the Buddha educated, encouraged, fired up, and inspired him with a Dhamma talk, after which he got up from his seat and left. "
}