{
  "dn5:0.1": "Dīgha Nikāya 5 ",
  "dn5:0.2": "Kūṭadantasutta ",
  "dn5:1.0": "1. Khāṇumatakabrāhmaṇagahapatikā ",
  "dn5:1.1": "Evaṁ me sutaṁ—",
  "dn5:1.2": "ekaṁ samayaṁ bhagavā magadhesu cārikaṁ caramāno mahatā bhikkhusaṅghena saddhiṁ pañcamattehi bhikkhusatehi yena khāṇumataṁ nāma magadhānaṁ brāhmaṇagāmo tadavasari. ",
  "dn5:1.3": "Tatra sudaṁ bhagavā khāṇumate viharati ambalaṭṭhikāyaṁ. ",
  "dn5:1.4": "Tena kho pana samayena kūṭadanto brāhmaṇo khāṇumataṁ ajjhāvasati sattussadaṁ satiṇakaṭṭhodakaṁ sadhaññaṁ rājabhoggaṁ raññā māgadhena seniyena bimbisārena dinnaṁ rājadāyaṁ brahmadeyyaṁ. ",
  "dn5:1.5": "Tena kho pana samayena kūṭadantassa brāhmaṇassa mahāyañño upakkhaṭo hoti. ",
  "dn5:1.6": "Satta ca usabhasatāni satta ca vacchatarasatāni satta ca vacchatarīsatāni satta ca ajasatāni satta ca urabbhasatāni thūṇūpanītāni honti yaññatthāya. ",
  "dn5:2.1": "Assosuṁ kho khāṇumatakā brāhmaṇagahapatikā: ",
  "dn5:2.2": "“samaṇo khalu, bho, gotamo sakyaputto sakyakulā pabbajito magadhesu cārikaṁ caramāno mahatā bhikkhusaṅghena saddhiṁ pañcamattehi bhikkhusatehi khāṇumataṁ anuppatto khāṇumate viharati ambalaṭṭhikāyaṁ. ",
  "dn5:2.3": "Taṁ kho pana bhavantaṁ gotamaṁ evaṁ kalyāṇo kittisaddo abbhuggato: ",
  "dn5:2.4": "‘itipi so bhagavā arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā’ti. ",
  "dn5:2.5": "So imaṁ lokaṁ sadevakaṁ samārakaṁ sabrahmakaṁ sassamaṇabrāhmaṇiṁ pajaṁ sadevamanussaṁ sayaṁ abhiññā sacchikatvā pavedeti. ",
  "dn5:2.6": "So dhammaṁ deseti ādikalyāṇaṁ majjhekalyāṇaṁ pariyosānakalyāṇaṁ sātthaṁ sabyañjanaṁ kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ pakāseti. ",
  "dn5:2.7": "Sādhu kho pana tathārūpānaṁ arahataṁ dassanaṁ hotī”ti. ",
  "dn5:2.8": "Atha kho khāṇumatakā brāhmaṇagahapatikā khāṇumatā nikkhamitvā saṅghasaṅghī gaṇībhūtā yena ambalaṭṭhikā tenupasaṅkamanti. ",
  "dn5:3.1": "Tena kho pana samayena kūṭadanto brāhmaṇo uparipāsāde divāseyyaṁ upagato hoti. ",
  "dn5:3.2": "Addasā kho kūṭadanto brāhmaṇo khāṇumatake brāhmaṇagahapatike khāṇumatā nikkhamitvā saṅghasaṅghī gaṇībhūte yena ambalaṭṭhikā tenupasaṅkamante. ",
  "dn5:3.3": "Disvā khattaṁ āmantesi: ",
  "dn5:3.4": "“kiṁ nu kho, bho khatte, khāṇumatakā brāhmaṇagahapatikā khāṇumatā nikkhamitvā saṅghasaṅghī gaṇībhūtā yena ambalaṭṭhikā tenupasaṅkamantī”ti? ",
  "dn5:3.5": "“Atthi kho, bho, samaṇo gotamo sakyaputto sakyakulā pabbajito magadhesu cārikaṁ caramāno mahatā bhikkhusaṅghena saddhiṁ pañcamattehi bhikkhusatehi khāṇumataṁ anuppatto, khāṇumate viharati ambalaṭṭhikāyaṁ. ",
  "dn5:3.6": "Taṁ kho pana bhavantaṁ gotamaṁ evaṁ kalyāṇo kittisaddo abbhuggato: ",
  "dn5:3.7": "‘itipi so bhagavā arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā’ti. ",
  "dn5:3.8": "Tamete bhavantaṁ gotamaṁ dassanāya upasaṅkamantī”ti. ",
  "dn5:4.1": "Atha kho kūṭadantassa brāhmaṇassa etadahosi: ",
  "dn5:4.2": "“sutaṁ kho pana metaṁ: ",
  "dn5:4.3": "‘samaṇo gotamo tividhaṁ yaññasampadaṁ soḷasaparikkhāraṁ jānātī’ti. ",
  "dn5:4.4": "Na kho panāhaṁ jānāmi tividhaṁ yaññasampadaṁ soḷasaparikkhāraṁ. ",
  "dn5:4.5": "Icchāmi cāhaṁ mahāyaññaṁ yajituṁ. ",
  "dn5:4.6": "Yannūnāhaṁ samaṇaṁ gotamaṁ upasaṅkamitvā tividhaṁ yaññasampadaṁ soḷasaparikkhāraṁ puccheyyan”ti. ",
  "dn5:4.7": "Atha kho kūṭadanto brāhmaṇo khattaṁ āmantesi: ",
  "dn5:4.8": "“tena hi, bho khatte, yena khāṇumatakā brāhmaṇagahapatikā tenupasaṅkama. upasaṅkamitvā khāṇumatake brāhmaṇagahapatike evaṁ vadehi: ",
  "dn5:4.9": "‘kūṭadanto, bho, brāhmaṇo evamāha—",
  "dn5:4.10": "āgamentu kira bhavanto, kūṭadantopi brāhmaṇo samaṇaṁ gotamaṁ dassanāya upasaṅkamissatī’”ti. ",
  "dn5:4.11": "“Evaṁ, bho”ti kho so khattā kūṭadantassa brāhmaṇassa paṭissutvā yena khāṇumatakā brāhmaṇagahapatikā tenupasaṅkami. upasaṅkamitvā khāṇumatake brāhmaṇagahapatike etadavoca: ",
  "dn5:4.12": "“kūṭadanto, bho, brāhmaṇo evamāha: ",
  "dn5:4.13": "‘āgamentu kira bhonto, kūṭadantopi brāhmaṇo samaṇaṁ gotamaṁ dassanāya upasaṅkamissatī’”ti. ",
  "dn5:5.0": "2. Kūṭadantaguṇakathā ",
  "dn5:5.1": "Tena kho pana samayena anekāni brāhmaṇasatāni khāṇumate paṭivasanti: ",
  "dn5:5.2": "“kūṭadantassa brāhmaṇassa mahāyaññaṁ anubhavissāmā”ti. ",
  "dn5:5.3": "Assosuṁ kho te brāhmaṇā: ",
  "dn5:5.4": "“kūṭadanto kira brāhmaṇo samaṇaṁ gotamaṁ dassanāya upasaṅkamissatī”ti. ",
  "dn5:5.5": "Atha kho te brāhmaṇā yena kūṭadanto brāhmaṇo tenupasaṅkamiṁsu. upasaṅkamitvā kūṭadantaṁ brāhmaṇaṁ etadavocuṁ: ",
  "dn5:5.6": "“saccaṁ kira bhavaṁ kūṭadanto samaṇaṁ gotamaṁ dassanāya upasaṅkamissatī”ti? ",
  "dn5:5.7": "“Evaṁ kho me, bho, hoti: ",
  "dn5:5.8": "‘ahampi samaṇaṁ gotamaṁ dassanāya upasaṅkamissāmī’”ti. ",
  "dn5:6.1": "“Mā bhavaṁ kūṭadanto samaṇaṁ gotamaṁ dassanāya upasaṅkami. ",
  "dn5:6.2": "Na arahati bhavaṁ kūṭadanto samaṇaṁ gotamaṁ dassanāya upasaṅkamituṁ. ",
  "dn5:6.3": "Sace bhavaṁ kūṭadanto samaṇaṁ gotamaṁ dassanāya upasaṅkamissati, bhoto kūṭadantassa yaso hāyissati, samaṇassa gotamassa yaso abhivaḍḍhissati. ",
  "dn5:6.4": "Yampi bhoto kūṭadantassa yaso hāyissati, samaṇassa gotamassa yaso abhivaḍḍhissati, imināpaṅgena na arahati bhavaṁ kūṭadanto samaṇaṁ gotamaṁ dassanāya upasaṅkamituṁ. ",
  "dn5:6.5": "Samaṇo tveva gotamo arahati bhavantaṁ kūṭadantaṁ dassanāya upasaṅkamituṁ. ",
  "dn5:6.6": "Bhavañhi kūṭadanto ubhato sujāto mātito ca pitito ca saṁsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena. ",
  "dn5:6.7": "Yampi bhavaṁ kūṭadanto ubhato sujāto mātito ca pitito ca saṁsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena, imināpaṅgena na arahati bhavaṁ kūṭadanto samaṇaṁ gotamaṁ dassanāya upasaṅkamituṁ. ",
  "dn5:6.8": "Samaṇo tveva gotamo arahati bhavantaṁ kūṭadantaṁ dassanāya upasaṅkamituṁ. ",
  "dn5:6.9": "Bhavañhi kūṭadanto aḍḍho mahaddhano mahābhogo pahūtavittūpakaraṇo pahūtajātarūparajato …pe… ",
  "dn5:6.10": "Bhavañhi kūṭadanto ajjhāyako mantadharo tiṇṇaṁ vedānaṁ pāragū sanighaṇḍukeṭubhānaṁ sākkharappabhedānaṁ itihāsapañcamānaṁ padako veyyākaraṇo lokāyatamahāpurisalakkhaṇesu anavayo …pe… ",
  "dn5:6.11": "Bhavañhi kūṭadanto abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato brahmavaṇṇī brahmavacchasī akhuddāvakāso dassanāya …pe… ",
  "dn5:6.12": "Bhavañhi kūṭadanto sīlavā vuddhasīlī vuddhasīlena samannāgato …pe… ",
  "dn5:6.13": "Bhavañhi kūṭadanto kalyāṇavāco kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā …pe… ",
  "dn5:6.14": "Bhavañhi kūṭadanto bahūnaṁ ācariyapācariyo tīṇi māṇavakasatāni mante vāceti, bahū kho pana nānādisā nānājanapadā māṇavakā āgacchanti bhoto kūṭadantassa santike mantatthikā mante adhiyitukāmā …pe… ",
  "dn5:6.15": "Bhavañhi kūṭadanto jiṇṇo vuddho mahallako addhagato vayoanuppatto. ",
  "dn5:6.16": "Samaṇo gotamo taruṇo ceva taruṇapabbajito ca …pe… ",
  "dn5:6.17": "Bhavañhi kūṭadanto rañño māgadhassa seniyassa bimbisārassa sakkato garukato mānito pūjito apacito …pe… ",
  "dn5:6.18": "Bhavañhi kūṭadanto brāhmaṇassa pokkharasātissa sakkato garukato mānito pūjito apacito …pe… ",
  "dn5:6.19": "Bhavañhi kūṭadanto khāṇumataṁ ajjhāvasati sattussadaṁ satiṇakaṭṭhodakaṁ sadhaññaṁ rājabhoggaṁ raññā māgadhena seniyena bimbisārena dinnaṁ rājadāyaṁ brahmadeyyaṁ. ",
  "dn5:6.20": "Yampi bhavaṁ kūṭadanto khāṇumataṁ ajjhāvasati sattussadaṁ satiṇakaṭṭhodakaṁ sadhaññaṁ rājabhoggaṁ, raññā māgadhena seniyena bimbisārena dinnaṁ rājadāyaṁ brahmadeyyaṁ, imināpaṅgena na arahati bhavaṁ kūṭadanto samaṇaṁ gotamaṁ dassanāya upasaṅkamituṁ. ",
  "dn5:6.21": "Samaṇo tveva gotamo arahati bhavantaṁ kūṭadantaṁ dassanāya upasaṅkamitun”ti. ",
  "dn5:7.0": "3. Buddhaguṇakathā ",
  "dn5:7.1": "Evaṁ vutte, kūṭadanto brāhmaṇo te brāhmaṇe etadavoca: ",
  "dn5:7.2": "“Tena hi, bho, mamapi suṇātha, yathā mayameva arahāma taṁ bhavantaṁ gotamaṁ dassanāya upasaṅkamituṁ, ",
  "dn5:7.3": "na tveva arahati so bhavaṁ gotamo amhākaṁ dassanāya upasaṅkamituṁ. ",
  "dn5:7.4": "Samaṇo khalu, bho, gotamo ubhato sujāto mātito ca pitito ca saṁsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena. ",
  "dn5:7.5": "Yampi, bho, samaṇo gotamo ubhato sujāto mātito ca pitito ca saṁsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena, imināpaṅgena na arahati so bhavaṁ gotamo amhākaṁ dassanāya upasaṅkamituṁ. ",
  "dn5:7.6": "Atha kho mayameva arahāma taṁ bhavantaṁ gotamaṁ dassanāya upasaṅkamituṁ. ",
  "dn5:7.7": "Samaṇo khalu, bho, gotamo mahantaṁ ñātisaṅghaṁ ohāya pabbajito …pe… ",
  "dn5:7.8": "Samaṇo khalu, bho, gotamo pahūtaṁ hiraññasuvaṇṇaṁ ohāya pabbajito bhūmigatañca vehāsaṭṭhaṁ ca …pe… ",
  "dn5:7.9": "Samaṇo khalu, bho, gotamo daharova samāno yuvā susukāḷakeso bhadrena yobbanena samannāgato paṭhamena vayasā agārasmā anagāriyaṁ pabbajito …pe… ",
  "dn5:7.10": "Samaṇo khalu, bho, gotamo akāmakānaṁ mātāpitūnaṁ assumukhānaṁ rudantānaṁ kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajito …pe… ",
  "dn5:7.11": "Samaṇo khalu, bho, gotamo abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato brahmavaṇṇī brahmavacchasī akhuddāvakāso dassanāya …pe… ",
  "dn5:7.12": "Samaṇo khalu, bho, gotamo sīlavā ariyasīlī kusalasīlī kusalasīlena samannāgato …pe… ",
  "dn5:7.13": "Samaṇo khalu, bho, gotamo kalyāṇavāco kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā …pe… ",
  "dn5:7.14": "Samaṇo khalu, bho, gotamo bahūnaṁ ācariyapācariyo …pe… ",
  "dn5:7.15": "Samaṇo khalu, bho, gotamo khīṇakāmarāgo vigatacāpallo …pe… ",
  "dn5:7.16": "Samaṇo khalu, bho, gotamo kammavādī kiriyavādī apāpapurekkhāro brahmaññāya pajāya …pe… ",
  "dn5:7.17": "Samaṇo khalu, bho, gotamo uccā kulā pabbajito asambhinnakhattiyakulā …pe… ",
  "dn5:7.18": "Samaṇo khalu, bho, gotamo aḍḍhā kulā pabbajito mahaddhanā mahābhogā …pe… ",
  "dn5:7.19": "Samaṇaṁ khalu, bho, gotamaṁ tiroraṭṭhā tirojanapadā pañhaṁ pucchituṁ āgacchanti …pe… ",
  "dn5:7.20": "Samaṇaṁ khalu, bho, gotamaṁ anekāni devatāsahassāni pāṇehi saraṇaṁ gatāni …pe… ",
  "dn5:7.21": "Samaṇaṁ khalu, bho, gotamaṁ evaṁ kalyāṇo kittisaddo abbhuggato: ",
  "dn5:7.22": "‘itipi so bhagavā arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā’ti …pe… ",
  "dn5:7.23": "Samaṇo khalu, bho, gotamo dvattiṁsamahāpurisalakkhaṇehi samannāgato …pe… ",
  "dn5:7.24": "Samaṇo khalu, bho, gotamo ehisvāgatavādī sakhilo sammodako abbhākuṭiko uttānamukho pubbabhāsī …pe… ",
  "dn5:7.25": "Samaṇo khalu, bho, gotamo catunnaṁ parisānaṁ sakkato garukato mānito pūjito apacito …pe… ",
  "dn5:7.26": "Samaṇe khalu, bho, gotame bahū devā ca manussā ca abhippasannā …pe… ",
  "dn5:7.27": "Samaṇo khalu, bho, gotamo yasmiṁ gāme vā nigame vā paṭivasati na tasmiṁ gāme vā nigame vā amanussā manusse viheṭhenti …pe… ",
  "dn5:7.28": "Samaṇo khalu, bho, gotamo saṅghī gaṇī gaṇācariyo puthutitthakarānaṁ aggamakkhāyati, yathā kho pana, bho, etesaṁ samaṇabrāhmaṇānaṁ yathā vā tathā vā yaso samudāgacchati, na hevaṁ samaṇassa gotamassa yaso samudāgato. ",
  "dn5:7.29": "Atha kho anuttarāya vijjācaraṇasampadāya samaṇassa gotamassa yaso samudāgato …pe… ",
  "dn5:7.30": "Samaṇaṁ khalu, bho, gotamaṁ rājā māgadho seniyo bimbisāro saputto sabhariyo sapariso sāmacco pāṇehi saraṇaṁ gato …pe… ",
  "dn5:7.31": "Samaṇaṁ khalu, bho, gotamaṁ rājā pasenadi kosalo saputto sabhariyo sapariso sāmacco pāṇehi saraṇaṁ gato …pe… ",
  "dn5:7.32": "Samaṇaṁ khalu, bho, gotamaṁ brāhmaṇo pokkharasāti saputto sabhariyo sapariso sāmacco pāṇehi saraṇaṁ gato …pe… ",
  "dn5:7.33": "Samaṇo khalu, bho, gotamo rañño māgadhassa seniyassa bimbisārassa sakkato garukato mānito pūjito apacito …pe… ",
  "dn5:7.34": "Samaṇo khalu, bho, gotamo rañño pasenadissa kosalassa sakkato garukato mānito pūjito apacito …pe… ",
  "dn5:7.35": "Samaṇo khalu, bho, gotamo brāhmaṇassa pokkharasātissa sakkato garukato mānito pūjito apacito …pe… ",
  "dn5:7.36": "Samaṇo khalu, bho, gotamo khāṇumataṁ anuppatto khāṇumate viharati ambalaṭṭhikāyaṁ. ",
  "dn5:7.37": "Ye kho pana, bho, keci samaṇā vā brāhmaṇā vā amhākaṁ gāmakhettaṁ āgacchanti, atithī no te honti. ",
  "dn5:7.38": "Atithī kho panamhehi sakkātabbā garukātabbā mānetabbā pūjetabbā apacetabbā. ",
  "dn5:7.39": "Yampi, bho, samaṇo gotamo khāṇumataṁ anuppatto khāṇumate viharati ambalaṭṭhikāyaṁ, atithimhākaṁ samaṇo gotamo. ",
  "dn5:7.40": "Atithi kho panamhehi sakkātabbo garukātabbo mānetabbo pūjetabbo apacetabbo. ",
  "dn5:7.41": "Imināpaṅgena nārahati so bhavaṁ gotamo amhākaṁ dassanāya upasaṅkamituṁ. ",
  "dn5:7.42": "Atha kho mayameva arahāma taṁ bhavantaṁ gotamaṁ dassanāya upasaṅkamituṁ. ",
  "dn5:7.43": "Ettake kho ahaṁ, bho, tassa bhoto gotamassa vaṇṇe pariyāpuṇāmi, no ca kho so bhavaṁ gotamo ettakavaṇṇo. ",
  "dn5:7.44": "Aparimāṇavaṇṇo hi so bhavaṁ gotamo”ti. ",
  "dn5:7.45": "Evaṁ vutte, te brāhmaṇā kūṭadantaṁ brāhmaṇaṁ etadavocuṁ: ",
  "dn5:7.46": "“yathā kho bhavaṁ kūṭadanto samaṇassa gotamassa vaṇṇe bhāsati, ito cepi so bhavaṁ gotamo yojanasate viharati, alameva saddhena kulaputtena dassanāya upasaṅkamituṁ api puṭosenā”ti. ",
  "dn5:7.47": "“Tena hi, bho, sabbeva mayaṁ samaṇaṁ gotamaṁ dassanāya upasaṅkamissāmā”ti. ",
  "dn5:8.0": "4. Mahāvijitarājayaññakathā ",
  "dn5:8.1": "Atha kho kūṭadanto brāhmaṇo mahatā brāhmaṇagaṇena saddhiṁ yena ambalaṭṭhikā yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavatā saddhiṁ sammodi. ",
  "dn5:8.2": "Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdi. ",
  "dn5:8.3": "Khāṇumatakāpi kho brāhmaṇagahapatikā appekacce bhagavantaṁ abhivādetvā ekamantaṁ nisīdiṁsu; appekacce bhagavatā saddhiṁ sammodiṁsu, sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdiṁsu; appekacce yena bhagavā tenañjaliṁ paṇāmetvā ekamantaṁ nisīdiṁsu; appekacce nāmagottaṁ sāvetvā ekamantaṁ nisīdiṁsu; appekacce tuṇhībhūtā ekamantaṁ nisīdiṁsu. ",
  "dn5:9.1": "Ekamantaṁ nisinno kho kūṭadanto brāhmaṇo bhagavantaṁ etadavoca: ",
  "dn5:9.2": "“sutaṁ metaṁ, bho gotama: ",
  "dn5:9.3": "‘samaṇo gotamo tividhaṁ yaññasampadaṁ soḷasaparikkhāraṁ jānātī’ti. ",
  "dn5:9.4": "Na kho panāhaṁ jānāmi tividhaṁ yaññasampadaṁ soḷasaparikkhāraṁ. ",
  "dn5:9.5": "Icchāmi cāhaṁ mahāyaññaṁ yajituṁ. ",
  "dn5:9.6": "Sādhu me bhavaṁ gotamo tividhaṁ yaññasampadaṁ soḷasaparikkhāraṁ desetū”ti. ",
  "dn5:9.7": "“Tena hi, brāhmaṇa, suṇāhi sādhukaṁ manasikarohi, bhāsissāmī”ti. ",
  "dn5:9.8": "“Evaṁ, bho”ti kho kūṭadanto brāhmaṇo bhagavato paccassosi. ",
  "dn5:9.9": "Bhagavā etadavoca: ",
  "dn5:10.1": "“bhūtapubbaṁ, brāhmaṇa, rājā mahāvijito nāma ahosi aḍḍho mahaddhano mahābhogo pahūtajātarūparajato pahūtavittūpakaraṇo pahūtadhanadhañño paripuṇṇakosakoṭṭhāgāro. ",
  "dn5:10.2": "Atha kho, brāhmaṇa, rañño mahāvijitassa rahogatassa paṭisallīnassa evaṁ cetaso parivitakko udapādi: ",
  "dn5:10.3": "‘adhigatā kho me vipulā mānusakā bhogā, mahantaṁ pathavimaṇḍalaṁ abhivijiya ajjhāvasāmi, yannūnāhaṁ mahāyaññaṁ yajeyyaṁ, yaṁ mama assa dīgharattaṁ hitāya sukhāyā’ti. ",
  "dn5:10.4": "Atha kho, brāhmaṇa, rājā mahāvijito purohitaṁ brāhmaṇaṁ āmantetvā etadavoca: ",
  "dn5:10.5": "‘idha mayhaṁ, brāhmaṇa, rahogatassa paṭisallīnassa evaṁ cetaso parivitakko udapādi: ",
  "dn5:10.6": "“adhigatā kho me vipulā mānusakā bhogā, mahantaṁ pathavimaṇḍalaṁ abhivijiya ajjhāvasāmi. Yannūnāhaṁ mahāyaññaṁ yajeyyaṁ yaṁ mama assa dīgharattaṁ hitāya sukhāyā”ti. ",
  "dn5:10.7": "Icchāmahaṁ, brāhmaṇa, mahāyaññaṁ yajituṁ. ",
  "dn5:10.8": "Anusāsatu maṁ bhavaṁ yaṁ mama assa dīgharattaṁ hitāya sukhāyā’ti. ",
  "dn5:11.1": "Evaṁ vutte, brāhmaṇa, purohito brāhmaṇo rājānaṁ mahāvijitaṁ etadavoca: ",
  "dn5:11.2": "‘bhoto kho rañño janapado sakaṇṭako sauppīḷo, gāmaghātāpi dissanti, nigamaghātāpi dissanti, nagaraghātāpi dissanti, panthaduhanāpi dissanti. ",
  "dn5:11.3": "Bhavaṁ kho pana rājā evaṁ sakaṇṭake janapade sauppīḷe balimuddhareyya, akiccakārī assa tena bhavaṁ rājā. ",
  "dn5:11.4": "Siyā kho pana bhoto rañño evamassa: ",
  "dn5:11.5": "“ahametaṁ dassukhīlaṁ vadhena vā bandhena vā jāniyā vā garahāya vā pabbājanāya vā samūhanissāmī”ti, na kho panetassa dassukhīlassa evaṁ sammā samugghāto hoti. ",
  "dn5:11.6": "Ye te hatāvasesakā bhavissanti, te pacchā rañño janapadaṁ viheṭhessanti. ",
  "dn5:11.7": "Api ca kho idaṁ saṁvidhānaṁ āgamma evametassa dassukhīlassa sammā samugghāto hoti. ",
  "dn5:11.8": "Tena hi bhavaṁ rājā ye bhoto rañño janapade ussahanti kasigorakkhe, tesaṁ bhavaṁ rājā bījabhattaṁ anuppadetu. ",
  "dn5:11.9": "Ye bhoto rañño janapade ussahanti vāṇijjāya, tesaṁ bhavaṁ rājā pābhataṁ anuppadetu. ",
  "dn5:11.10": "Ye bhoto rañño janapade ussahanti rājaporise, tesaṁ bhavaṁ rājā bhattavetanaṁ pakappetu. ",
  "dn5:11.11": "Te ca manussā sakammapasutā rañño janapadaṁ na viheṭhessanti; ",
  "dn5:11.12": "mahā ca rañño rāsiko bhavissati. ",
  "dn5:11.13": "Khemaṭṭhitā janapadā akaṇṭakā anuppīḷā. Manussā mudā modamānā ure putte naccentā apārutagharā maññe viharissantī’ti. ",
  "dn5:11.14": "‘Evaṁ, bho’ti kho, brāhmaṇa, rājā mahāvijito purohitassa brāhmaṇassa paṭissutvā ye rañño janapade ussahiṁsu kasigorakkhe, tesaṁ rājā mahāvijito bījabhattaṁ anuppadāsi. ",
  "dn5:11.15": "Ye ca rañño janapade ussahiṁsu vāṇijjāya, tesaṁ rājā mahāvijito pābhataṁ anuppadāsi. ",
  "dn5:11.16": "Ye ca rañño janapade ussahiṁsu rājaporise, tesaṁ rājā mahāvijito bhattavetanaṁ pakappesi. ",
  "dn5:11.17": "Te ca manussā sakammapasutā rañño janapadaṁ na viheṭhiṁsu, mahā ca rañño rāsiko ahosi. ",
  "dn5:11.18": "Khemaṭṭhitā janapadā akaṇṭakā anuppīḷā manussā mudā modamānā ure putte naccentā apārutagharā maññe vihariṁsu. ",
  "dn5:11.19": "Atha kho, brāhmaṇa, rājā mahāvijito purohitaṁ brāhmaṇaṁ āmantetvā etadavoca: ",
  "dn5:11.20": "‘samūhato kho me bhoto dassukhīlo, bhoto saṁvidhānaṁ āgamma mahā ca me rāsiko. ",
  "dn5:11.21": "Khemaṭṭhitā janapadā akaṇṭakā anuppīḷā manussā mudā modamānā ure putte naccentā apārutagharā maññe viharanti. ",
  "dn5:11.22": "Icchāmahaṁ brāhmaṇa mahāyaññaṁ yajituṁ. ",
  "dn5:11.23": "Anusāsatu maṁ bhavaṁ yaṁ mama assa dīgharattaṁ hitāya sukhāyā’ti. ",
  "dn5:12.0": "4.1. Catuparikkhāra ",
  "dn5:12.1": "Tena hi bhavaṁ rājā ye bhoto rañño janapade khattiyā ānuyantā negamā ceva jānapadā ca te bhavaṁ rājā āmantayataṁ: ‘icchāmahaṁ, bho, mahāyaññaṁ yajituṁ, anujānantu me bhavanto yaṁ mama assa dīgharattaṁ hitāya sukhāyā’ti. Ye bhoto rañño janapade amaccā pārisajjā negamā ceva jānapadā ca …pe… brāhmaṇamahāsālā negamā ceva jānapadā ca …pe… gahapatinecayikā negamā ceva jānapadā ca, te bhavaṁ rājā āmantayataṁ: ",
  "dn5:12.2": "‘icchāmahaṁ, bho, mahāyaññaṁ yajituṁ, anujānantu me bhavanto yaṁ mama assa dīgharattaṁ hitāya sukhāyā’ti. ",
  "dn5:12.3": "‘Evaṁ, bho’ti kho, brāhmaṇa, rājā mahāvijito purohitassa brāhmaṇassa paṭissutvā ye rañño janapade khattiyā ānuyantā negamā ceva jānapadā ca, te rājā mahāvijito āmantesi: ",
  "dn5:12.4": "‘icchāmahaṁ, bho, mahāyaññaṁ yajituṁ, anujānantu me bhavanto yaṁ mama assa dīgharattaṁ hitāya sukhāyā’ti. ",
  "dn5:12.5": "‘Yajataṁ bhavaṁ rājā yaññaṁ, yaññakālo, mahārājā’ti. ",
  "dn5:12.6": "Ye rañño janapade amaccā pārisajjā negamā ceva jānapadā ca …pe… brāhmaṇamahāsālā negamā ceva jānapadā ca …pe… gahapatinecayikā negamā ceva jānapadā ca, te rājā mahāvijito āmantesi: ",
  "dn5:12.7": "‘icchāmahaṁ, bho, mahāyaññaṁ yajituṁ. Anujānantu me bhavanto yaṁ mama assa dīgharattaṁ hitāya sukhāyā’ti. ",
  "dn5:12.8": "‘Yajataṁ bhavaṁ rājā yaññaṁ, yaññakālo, mahārājā’ti. ",
  "dn5:12.9": "Itime cattāro anumatipakkhā tasseva yaññassa parikkhārā bhavanti. ",
  "dn5:13.0": "4.2. Aṭṭhaparikkhāra ",
  "dn5:13.1": "Rājā mahāvijito aṭṭhahaṅgehi samannāgato—",
  "dn5:13.2": "ubhato sujāto mātito ca pitito ca saṁsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena; ",
  "dn5:13.3": "abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato brahmavaṇṇī brahmavacchasī akhuddāvakāso dassanāya; ",
  "dn5:13.4": "aḍḍho mahaddhano mahābhogo pahūtajātarūparajato pahūtavittūpakaraṇo pahūtadhanadhañño paripuṇṇakosakoṭṭhāgāro; ",
  "dn5:13.5": "balavā caturaṅginiyā senāya samannāgato assavāya ovādapaṭikarāya sahati maññe paccatthike yasasā; ",
  "dn5:13.6": "saddho dāyako dānapati anāvaṭadvāro samaṇabrāhmaṇakapaṇaddhikavaṇibbakayācakānaṁ opānabhūto puññāni karoti; ",
  "dn5:13.7": "bahussuto tassa tassa sutajātassa, tassa tasseva kho pana bhāsitassa atthaṁ jānāti: ",
  "dn5:13.8": "‘ayaṁ imassa bhāsitassa attho ayaṁ imassa bhāsitassa attho’ti; ",
  "dn5:13.9": "paṇḍito, viyatto, medhāvī, paṭibalo, atītānāgatapaccuppanne atthe cintetuṁ. ",
  "dn5:13.10": "Rājā mahāvijito imehi aṭṭhahaṅgehi samannāgato. ",
  "dn5:13.11": "Iti imānipi aṭṭhaṅgāni tasseva yaññassa parikkhārā bhavanti. ",
  "dn5:14.0": "4.3. Catuparikkhāra ",
  "dn5:14.1": "Purohito brāhmaṇo catūhaṅgehi samannāgato, ",
  "dn5:14.2": "ubhato sujāto mātito ca pitito ca saṁsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena; ",
  "dn5:14.3": "ajjhāyako mantadharo tiṇṇaṁ vedānaṁ pāragū sanighaṇḍukeṭubhānaṁ sākkharappabhedānaṁ itihāsapañcamānaṁ padako veyyākaraṇo lokāyatamahāpurisalakkhaṇesu anavayo; ",
  "dn5:14.4": "sīlavā vuddhasīlī vuddhasīlena samannāgato; ",
  "dn5:14.5": "paṇḍito viyatto medhāvī paṭhamo vā dutiyo vā sujaṁ paggaṇhantānaṁ. ",
  "dn5:14.6": "Purohito brāhmaṇo imehi catūhaṅgehi samannāgato. ",
  "dn5:14.7": "Iti imānipi cattāri aṅgāni tasseva yaññassa parikkhārā bhavanti. ",
  "dn5:15.0": "4.4. Tissovidhā ",
  "dn5:15.1": "Atha kho, brāhmaṇa, purohito brāhmaṇo rañño mahāvijitassa pubbeva yaññā tisso vidhā desesi. ",
  "dn5:15.2": "Siyā kho pana bhoto rañño mahāyaññaṁ yiṭṭhukāmassa kocideva vippaṭisāro: ",
  "dn5:15.3": "‘“mahā vata me bhogakkhandho vigacchissatī”ti, so bhotā raññā vippaṭisāro na karaṇīyo. ",
  "dn5:15.4": "Siyā kho pana bhoto rañño mahāyaññaṁ yajamānassa kocideva vippaṭisāro: ",
  "dn5:15.5": "“mahā vata me bhogakkhandho vigacchatī”ti, so bhotā raññā vippaṭisāro na karaṇīyo. ",
  "dn5:15.6": "Siyā kho pana bhoto rañño mahāyaññaṁ yiṭṭhassa kocideva vippaṭisāro: ",
  "dn5:15.7": "“mahā vata me bhogakkhandho vigato”ti, so bhotā raññā vippaṭisāro na karaṇīyo’ti. ",
  "dn5:15.8": "Imā kho, brāhmaṇa, purohito brāhmaṇo rañño mahāvijitassa pubbeva yaññā tisso vidhā desesi. ",
  "dn5:16.0": "4.5. Dasaākāra ",
  "dn5:16.1": "Atha kho, brāhmaṇa, purohito brāhmaṇo rañño mahāvijitassa pubbeva yaññā dasahākārehi paṭiggāhakesu vippaṭisāraṁ paṭivinesi. ",
  "dn5:16.2": "‘Āgamissanti kho bhoto yaññaṁ pāṇātipātinopi pāṇātipātā paṭiviratāpi. ",
  "dn5:16.3": "Ye tattha pāṇātipātino, tesaññeva tena. ",
  "dn5:16.4": "Ye tattha pāṇātipātā paṭiviratā, te ārabbha yajataṁ bhavaṁ, sajjataṁ bhavaṁ, modataṁ bhavaṁ, cittameva bhavaṁ antaraṁ pasādetu. ",
  "dn5:16.5": "Āgamissanti kho bhoto yaññaṁ adinnādāyinopi adinnādānā paṭiviratāpi …pe… ",
  "dn5:16.6": "kāmesu micchācārinopi kāmesumicchācārā paṭiviratāpi … ",
  "dn5:16.7": "musāvādinopi musāvādā paṭiviratāpi … ",
  "dn5:16.8": "pisuṇavācinopi pisuṇāya vācāya paṭiviratāpi … ",
  "dn5:16.9": "pharusavācinopi pharusāya vācāya paṭiviratāpi … ",
  "dn5:16.10": "samphappalāpinopi samphappalāpā paṭiviratāpi … ",
  "dn5:16.11": "abhijjhālunopi anabhijjhālunopi … ",
  "dn5:16.12": "byāpannacittāpi abyāpannacittāpi … ",
  "dn5:16.13": "micchādiṭṭhikāpi sammādiṭṭhikāpi …. ",
  "dn5:16.14": "Ye tattha micchādiṭṭhikā, tesaññeva tena. ",
  "dn5:16.15": "Ye tattha sammādiṭṭhikā, te ārabbha yajataṁ bhavaṁ, sajjataṁ bhavaṁ, modataṁ bhavaṁ, cittameva bhavaṁ antaraṁ pasādetū’ti. ",
  "dn5:16.16": "Imehi kho, brāhmaṇa, purohito brāhmaṇo rañño mahāvijitassa pubbeva yaññā dasahākārehi paṭiggāhakesu vippaṭisāraṁ paṭivinesi. ",
  "dn5:17.0": "4.6. Soḷasākāra ",
  "dn5:17.1": "Atha kho, brāhmaṇa, purohito brāhmaṇo rañño mahāvijitassa mahāyaññaṁ yajamānassa soḷasahākārehi cittaṁ sandassesi samādapesi samuttejesi sampahaṁsesi ",
  "dn5:17.2": "siyā kho pana bhoto rañño mahāyaññaṁ yajamānassa kocideva vattā: ",
  "dn5:17.3": "‘rājā kho mahāvijito mahāyaññaṁ yajati, no ca kho tassa āmantitā khattiyā ānuyantā negamā ceva jānapadā ca; ",
  "dn5:17.4": "atha ca pana bhavaṁ rājā evarūpaṁ mahāyaññaṁ yajatī’ti. ",
  "dn5:17.5": "Evampi bhoto rañño vattā dhammato natthi. ",
  "dn5:17.6": "Bhotā kho pana raññā āmantitā khattiyā ānuyantā negamā ceva jānapadā ca. ",
  "dn5:17.7": "Imināpetaṁ bhavaṁ rājā jānātu, yajataṁ bhavaṁ, sajjataṁ bhavaṁ, modataṁ bhavaṁ, cittameva bhavaṁ antaraṁ pasādetu. ",
  "dn5:17.8": "Siyā kho pana bhoto rañño mahāyaññaṁ yajamānassa kocideva vattā: ",
  "dn5:17.9": "‘rājā kho mahāvijito mahāyaññaṁ yajati, no ca kho tassa āmantitā amaccā pārisajjā negamā ceva jānapadā ca …pe… brāhmaṇamahāsālā negamā ceva jānapadā ca …pe… gahapatinecayikā negamā ceva jānapadā ca, atha ca pana bhavaṁ rājā evarūpaṁ mahāyaññaṁ yajatī’ti. ",
  "dn5:17.10": "Evampi bhoto rañño vattā dhammato natthi. ",
  "dn5:17.11": "Bhotā kho pana raññā āmantitā gahapatinecayikā negamā ceva jānapadā ca. ",
  "dn5:17.12": "Imināpetaṁ bhavaṁ rājā jānātu, yajataṁ bhavaṁ, sajjataṁ bhavaṁ, modataṁ bhavaṁ, cittameva bhavaṁ antaraṁ pasādetu. ",
  "dn5:17.13": "Siyā kho pana bhoto rañño mahāyaññaṁ yajamānassa kocideva vattā: ",
  "dn5:17.14": "‘rājā kho mahāvijito mahāyaññaṁ yajati, no ca kho ubhato sujāto mātito ca pitito ca saṁsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena, atha ca pana bhavaṁ rājā evarūpaṁ mahāyaññaṁ yajatī’ti. ",
  "dn5:17.15": "Evampi bhoto rañño vattā dhammato natthi. ",
  "dn5:17.16": "Bhavaṁ kho pana rājā ubhato sujāto mātito ca pitito ca saṁsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena. ",
  "dn5:17.17": "Imināpetaṁ bhavaṁ rājā jānātu, yajataṁ bhavaṁ, sajjataṁ bhavaṁ, modataṁ bhavaṁ, cittameva bhavaṁ antaraṁ pasādetu. ",
  "dn5:17.18": "Siyā kho pana bhoto rañño mahāyaññaṁ yajamānassa kocideva vattā: ",
  "dn5:17.19": "‘rājā kho mahāvijito mahāyaññaṁ yajati no ca kho abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato brahmavaṇṇī brahmavacchasī akhuddāvakāso dassanāya …pe… ",
  "dn5:17.20": "no ca kho aḍḍho mahaddhano mahābhogo pahūtajātarūparajato pahūtavittūpakaraṇo pahūtadhanadhañño paripuṇṇakosakoṭṭhāgāro …pe… ",
  "dn5:17.21": "no ca kho balavā caturaṅginiyā senāya samannāgato assavāya ovādapaṭikarāya sahati maññe paccatthike yasasā …pe… ",
  "dn5:17.22": "no ca kho saddho dāyako dānapati anāvaṭadvāro samaṇabrāhmaṇakapaṇaddhikavaṇibbakayācakānaṁ opānabhūto puññāni karoti …pe… ",
  "dn5:17.23": "no ca kho bahussuto tassa tassa sutajātassa …pe… ",
  "dn5:17.24": "no ca kho tassa tasseva kho pana bhāsitassa atthaṁ jānāti: ",
  "dn5:17.25": "“ayaṁ imassa bhāsitassa attho, ayaṁ imassa bhāsitassa attho”ti …pe… ",
  "dn5:17.26": "no ca kho paṇḍito viyatto medhāvī paṭibalo atītānāgatapaccuppanne atthe cintetuṁ, atha ca pana bhavaṁ rājā evarūpaṁ mahāyaññaṁ yajatī’ti. ",
  "dn5:17.27": "Evampi bhoto rañño vattā dhammato natthi. ",
  "dn5:17.28": "Bhavaṁ kho pana rājā paṇḍito viyatto medhāvī paṭibalo atītānāgatapaccuppanne atthe cintetuṁ. ",
  "dn5:17.29": "Imināpetaṁ bhavaṁ rājā jānātu, yajataṁ bhavaṁ, sajjataṁ bhavaṁ, modataṁ bhavaṁ, cittameva bhavaṁ antaraṁ pasādetu. ",
  "dn5:17.30": "Siyā kho pana bhoto rañño mahāyaññaṁ yajamānassa kocideva vattā: ",
  "dn5:17.31": "‘rājā kho mahāvijito mahāyaññaṁ yajati. ",
  "dn5:17.32": "No ca khvassa purohito brāhmaṇo ubhato sujāto mātito ca pitito ca saṁsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena; ",
  "dn5:17.33": "atha ca pana bhavaṁ rājā evarūpaṁ mahāyaññaṁ yajatī’ti. ",
  "dn5:17.34": "Evampi bhoto rañño vattā dhammato natthi. ",
  "dn5:17.35": "Bhoto kho pana rañño purohito brāhmaṇo ubhato sujāto mātito ca pitito ca saṁsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena. ",
  "dn5:17.36": "Imināpetaṁ bhavaṁ rājā jānātu, yajataṁ bhavaṁ, sajjataṁ bhavaṁ, modataṁ bhavaṁ, cittameva bhavaṁ antaraṁ pasādetu. ",
  "dn5:17.37": "Siyā kho pana bhoto rañño mahāyaññaṁ yajamānassa kocideva vattā: ",
  "dn5:17.38": "‘rājā kho mahāvijito mahāyaññaṁ yajati. ",
  "dn5:17.39": "No ca khvassa purohito brāhmaṇo ajjhāyako mantadharo tiṇṇaṁ vedānaṁ pāragū sanighaṇḍukeṭubhānaṁ sākkharappabhedānaṁ itihāsapañcamānaṁ padako veyyākaraṇo lokāyatamahāpurisalakkhaṇesu anavayo …pe… ",
  "dn5:17.40": "no ca khvassa purohito brāhmaṇo sīlavā vuddhasīlī vuddhasīlena samannāgato …pe… ",
  "dn5:17.41": "no ca khvassa purohito brāhmaṇo paṇḍito viyatto medhāvī paṭhamo vā dutiyo vā sujaṁ paggaṇhantānaṁ, atha ca pana bhavaṁ rājā evarūpaṁ mahāyaññaṁ yajatī’ti. ",
  "dn5:17.42": "Evampi bhoto rañño vattā dhammato natthi. ",
  "dn5:17.43": "Bhoto kho pana rañño purohito brāhmaṇo paṇḍito viyatto medhāvī paṭhamo vā dutiyo vā sujaṁ paggaṇhantānaṁ. ",
  "dn5:17.44": "Imināpetaṁ bhavaṁ rājā jānātu, yajataṁ bhavaṁ, sajjataṁ bhavaṁ, modataṁ bhavaṁ, cittameva bhavaṁ antaraṁ pasādetūti. ",
  "dn5:17.45": "Imehi kho, brāhmaṇa, purohito brāhmaṇo rañño mahāvijitassa mahāyaññaṁ yajamānassa soḷasahi ākārehi cittaṁ sandassesi samādapesi samuttejesi sampahaṁsesi. ",
  "dn5:18.1": "Tasmiṁ kho, brāhmaṇa, yaññe neva gāvo haññiṁsu, na ajeḷakā haññiṁsu, na kukkuṭasūkarā haññiṁsu, na vividhā pāṇā saṅghātaṁ āpajjiṁsu, na rukkhā chijjiṁsu yūpatthāya, na dabbhā lūyiṁsu barihisatthāya. ",
  "dn5:18.2": "Yepissa ahesuṁ dāsāti vā pessāti vā kammakarāti vā, tepi na daṇḍatajjitā na bhayatajjitā na assumukhā rudamānā parikammāni akaṁsu. ",
  "dn5:18.3": "Atha kho ye icchiṁsu, te akaṁsu, ye na icchiṁsu, na te akaṁsu; ",
  "dn5:18.4": "yaṁ icchiṁsu, taṁ akaṁsu, yaṁ na icchiṁsu, na taṁ akaṁsu. ",
  "dn5:18.5": "Sappitelanavanītadadhimadhuphāṇitena ceva so yañño niṭṭhānamagamāsi. ",
  "dn5:19.1": "Atha kho, brāhmaṇa, khattiyā ānuyantā negamā ceva jānapadā ca, amaccā pārisajjā negamā ceva jānapadā ca, brāhmaṇamahāsālā negamā ceva jānapadā ca, gahapatinecayikā negamā ceva jānapadā ca pahūtaṁ sāpateyyaṁ ādāya rājānaṁ mahāvijitaṁ upasaṅkamitvā evamāhaṁsu: ",
  "dn5:19.2": "‘idaṁ, deva, pahūtaṁ sāpateyyaṁ devaññeva uddissābhataṁ, taṁ devo paṭiggaṇhātū’ti. ",
  "dn5:19.3": "‘Alaṁ, bho, mamāpidaṁ pahūtaṁ sāpateyyaṁ dhammikena balinā abhisaṅkhataṁ; ",
  "dn5:19.4": "tañca vo hotu, ito ca bhiyyo harathā’ti. ",
  "dn5:19.5": "Te raññā paṭikkhittā ekamantaṁ apakkamma evaṁ samacintesuṁ: ",
  "dn5:19.6": "‘na kho etaṁ amhākaṁ patirūpaṁ, yaṁ mayaṁ imāni sāpateyyāni punadeva sakāni gharāni paṭihareyyāma. ",
  "dn5:19.7": "Rājā kho mahāvijito mahāyaññaṁ yajati, handassa mayaṁ anuyāgino homā’ti. ",
  "dn5:20.1": "Atha kho, brāhmaṇa, puratthimena yaññavāṭassa khattiyā ānuyantā negamā ceva jānapadā ca dānāni paṭṭhapesuṁ. ",
  "dn5:20.2": "Dakkhiṇena yaññavāṭassa amaccā pārisajjā negamā ceva jānapadā ca dānāni paṭṭhapesuṁ. ",
  "dn5:20.3": "Pacchimena yaññavāṭassa brāhmaṇamahāsālā negamā ceva jānapadā ca dānāni paṭṭhapesuṁ. ",
  "dn5:20.4": "Uttarena yaññavāṭassa gahapatinecayikā negamā ceva jānapadā ca dānāni paṭṭhapesuṁ. ",
  "dn5:20.5": "Tesupi kho, brāhmaṇa, yaññesu neva gāvo haññiṁsu, na ajeḷakā haññiṁsu, na kukkuṭasūkarā haññiṁsu, na vividhā pāṇā saṅghātaṁ āpajjiṁsu, na rukkhā chijjiṁsu yūpatthāya, na dabbhā lūyiṁsu barihisatthāya. ",
  "dn5:20.6": "Yepi nesaṁ ahesuṁ dāsāti vā pessāti vā kammakarāti vā, tepi na daṇḍatajjitā na bhayatajjitā na assumukhā rudamānā parikammāni akaṁsu. ",
  "dn5:20.7": "Atha kho ye icchiṁsu, te akaṁsu, ye na icchiṁsu, na te akaṁsu; ",
  "dn5:20.8": "yaṁ icchiṁsu, taṁ akaṁsu, yaṁ na icchiṁsu na taṁ akaṁsu. ",
  "dn5:20.9": "Sappitelanavanītadadhimadhuphāṇitena ceva te yaññā niṭṭhānamagamaṁsu. ",
  "dn5:20.10": "Iti cattāro ca anumatipakkhā, rājā mahāvijito aṭṭhahaṅgehi samannāgato, purohito brāhmaṇo catūhaṅgehi samannāgato; ",
  "dn5:20.11": "tisso ca vidhā. ",
  "dn5:20.12": "Ayaṁ vuccati, brāhmaṇa, tividhā yaññasampadā soḷasaparikkhārā”ti. ",
  "dn5:21.1": "Evaṁ vutte, te brāhmaṇā unnādino uccāsaddamahāsaddā ahesuṁ: ",
  "dn5:21.2": "“aho yañño, aho yaññasampadā”ti. ",
  "dn5:21.3": "Kūṭadanto pana brāhmaṇo tūṇhībhūtova nisinno hoti. ",
  "dn5:21.4": "Atha kho te brāhmaṇā kūṭadantaṁ brāhmaṇaṁ etadavocuṁ: ",
  "dn5:21.5": "“kasmā pana bhavaṁ kūṭadanto samaṇassa gotamassa subhāsitaṁ subhāsitato nābbhanumodatī”ti? ",
  "dn5:21.6": "“Nāhaṁ, bho, samaṇassa gotamassa subhāsitaṁ subhāsitato nābbhanumodāmi. ",
  "dn5:21.7": "Muddhāpi tassa vipateyya, yo samaṇassa gotamassa subhāsitaṁ subhāsitato nābbhanumodeyya. ",
  "dn5:21.8": "Api ca me, bho, evaṁ hoti—",
  "dn5:21.9": "samaṇo gotamo na evamāha: ",
  "dn5:21.10": "‘evaṁ me sutan’ti vā ‘evaṁ arahati bhavitun’ti vā; ",
  "dn5:21.11": "api ca samaṇo gotamo: ",
  "dn5:21.12": "‘evaṁ tadā āsi, itthaṁ tadā āsi’ tveva bhāsati. ",
  "dn5:21.13": "Tassa mayhaṁ bho evaṁ hoti: ",
  "dn5:21.14": "‘addhā samaṇo gotamo tena samayena rājā vā ahosi mahāvijito yaññassāmi purohito vā brāhmaṇo tassa yaññassa yājetā’ti. ",
  "dn5:21.15": "Abhijānāti pana bhavaṁ gotamo evarūpaṁ yaññaṁ yajitvā vā yājetvā vā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjitā”ti? ",
  "dn5:21.16": "“Abhijānāmahaṁ, brāhmaṇa, evarūpaṁ yaññaṁ yajitvā vā yājetvā vā kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapajjitā, ahaṁ tena samayena purohito brāhmaṇo ahosiṁ tassa yaññassa yājetā”ti. ",
  "dn5:22.0": "5. Niccadānaanukulayañña ",
  "dn5:22.1": "“Atthi pana, bho gotama, añño yañño imāya tividhāya yaññasampadāya soḷasaparikkhārāya appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro cā”ti? ",
  "dn5:22.2": "“Atthi kho, brāhmaṇa, añño yañño imāya tividhāya yaññasampadāya soḷasaparikkhārāya appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro cā”ti. ",
  "dn5:22.3": "“Katamo pana so, bho gotama, yañño imāya tividhāya yaññasampadāya soḷasaparikkhārāya appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro cā”ti? ",
  "dn5:22.4": "“Yāni kho pana tāni, brāhmaṇa, niccadānāni anukulayaññāni sīlavante pabbajite uddissa diyyanti; ",
  "dn5:22.5": "ayaṁ kho, brāhmaṇa, yañño imāya tividhāya yaññasampadāya soḷasaparikkhārāya appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro cā”ti. ",
  "dn5:23.1": "“Ko nu kho, bho gotama, hetu ko paccayo, yena taṁ niccadānaṁ anukulayaññaṁ imāya tividhāya yaññasampadāya soḷasaparikkhārāya appaṭṭhatarañca appasamārambhatarañca mahapphalatarañca mahānisaṁsatarañcā”ti? ",
  "dn5:23.2": "“Na kho, brāhmaṇa, evarūpaṁ yaññaṁ upasaṅkamanti arahanto vā arahattamaggaṁ vā samāpannā. ",
  "dn5:23.3": "Taṁ kissa hetu? ",
  "dn5:23.4": "Dissanti hettha, brāhmaṇa, daṇḍappahārāpi galaggahāpi, tasmā evarūpaṁ yaññaṁ na upasaṅkamanti arahanto vā arahattamaggaṁ vā samāpannā. ",
  "dn5:23.5": "Yāni kho pana tāni, brāhmaṇa, niccadānāni anukulayaññāni sīlavante pabbajite uddissa diyyanti; ",
  "dn5:23.6": "evarūpaṁ kho, brāhmaṇa, yaññaṁ upasaṅkamanti arahanto vā arahattamaggaṁ vā samāpannā. ",
  "dn5:23.7": "Taṁ kissa hetu? ",
  "dn5:23.8": "Na hettha, brāhmaṇa, dissanti daṇḍappahārāpi galaggahāpi, tasmā evarūpaṁ yaññaṁ upasaṅkamanti arahanto vā arahattamaggaṁ vā samāpannā. ",
  "dn5:23.9": "Ayaṁ kho, brāhmaṇa, hetu ayaṁ paccayo, yena taṁ niccadānaṁ anukulayaññaṁ imāya tividhāya yaññasampadāya soḷasaparikkhārāya appaṭṭhatarañca appasamārambhatarañca mahapphalatarañca mahānisaṁsatarañcā”ti. ",
  "dn5:24.1": "“Atthi pana, bho gotama, añño yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro cā”ti? ",
  "dn5:24.2": "“Atthi kho, brāhmaṇa, añño yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro cā”ti. ",
  "dn5:24.3": "“Katamo pana so, bho gotama, yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro cā”ti? ",
  "dn5:24.4": "“Yo kho, brāhmaṇa, cātuddisaṁ saṅghaṁ uddissa vihāraṁ karoti, ayaṁ kho, brāhmaṇa, yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro cā”ti. ",
  "dn5:25.1": "“Atthi pana, bho gotama, añño yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena iminā ca vihāradānena appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro cā”ti? ",
  "dn5:25.2": "“Atthi kho, brāhmaṇa, añño yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena iminā ca vihāradānena appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro cā”ti. ",
  "dn5:25.3": "“Katamo pana so, bho gotama, yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena iminā ca vihāradānena appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro cā”ti? ",
  "dn5:25.4": "“Yo kho, brāhmaṇa, pasannacitto buddhaṁ saraṇaṁ gacchati, dhammaṁ saraṇaṁ gacchati, saṅghaṁ saraṇaṁ gacchati; ",
  "dn5:25.5": "ayaṁ kho, brāhmaṇa, yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena iminā ca vihāradānena appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro cā”ti. ",
  "dn5:26.1": "“Atthi pana, bho gotama, añño yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena iminā ca vihāradānena imehi ca saraṇagamanehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro cā”ti? ",
  "dn5:26.2": "“Atthi kho, brāhmaṇa, añño yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena iminā ca vihāradānena imehi ca saraṇagamanehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro cā”ti. ",
  "dn5:26.3": "“Katamo pana so, bho gotama, yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena iminā ca vihāradānena imehi ca saraṇagamanehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro cā”ti? ",
  "dn5:26.4": "“Yo kho, brāhmaṇa, pasannacitto sikkhāpadāni samādiyati—",
  "dn5:26.5": "pāṇātipātā veramaṇiṁ, adinnādānā veramaṇiṁ, kāmesumicchācārā veramaṇiṁ, musāvādā veramaṇiṁ, surāmerayamajjapamādaṭṭhānā veramaṇiṁ. ",
  "dn5:26.6": "Ayaṁ kho, brāhmaṇa, yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena iminā ca vihāradānena imehi ca saraṇagamanehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro cā”ti. ",
  "dn5:27.1": "“Atthi pana, bho gotama, añño yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena iminā ca vihāradānena imehi ca saraṇagamanehi imehi ca sikkhāpadehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro cā”ti? ",
  "dn5:27.2": "“Atthi kho, brāhmaṇa, añño yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena iminā ca vihāradānena imehi ca saraṇagamanehi imehi ca sikkhāpadehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro cā”ti. ",
  "dn5:27.3": "“Katamo pana so, bho gotama, yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena iminā ca vihāradānena imehi ca saraṇagamanehi imehi ca sikkhāpadehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro cā”ti? ",
  "dn5:27.4": "“idha, brāhmaṇa, tathāgato loke uppajjati arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā. ",
  "dn5:27.4.1.2": "So imaṁ lokaṁ sadevakaṁ samārakaṁ sabrahmakaṁ sassamaṇabrāhmaṇiṁ pajaṁ sadevamanussaṁ sayaṁ abhiññā sacchikatvā pavedeti. ",
  "dn5:27.4.1.3": "So dhammaṁ deseti ādikalyāṇaṁ majjhekalyāṇaṁ pariyosānakalyāṇaṁ sātthaṁ sabyañjanaṁ, kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ pakāseti. ",
  "dn5:27.4.2.1": "Taṁ dhammaṁ suṇāti gahapati vā gahapatiputto vā aññatarasmiṁ vā kule paccājāto. ",
  "dn5:27.4.2.2": "So taṁ dhammaṁ sutvā tathāgate saddhaṁ paṭilabhati. ",
  "dn5:27.4.2.3": "So tena saddhāpaṭilābhena samannāgato iti paṭisañcikkhati: ",
  "dn5:27.4.2.4": "‘sambādho gharāvāso rajopatho, abbhokāso pabbajjā. ",
  "dn5:27.4.2.5": "Nayidaṁ sukaraṁ agāraṁ ajjhāvasatā ekantaparipuṇṇaṁ ekantaparisuddhaṁ saṅkhalikhitaṁ brahmacariyaṁ carituṁ. ",
  "dn5:27.4.2.6": "Yannūnāhaṁ kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajeyyan’ti. ",
  "dn5:27.4.2.7": "So aparena samayena appaṁ vā bhogakkhandhaṁ pahāya mahantaṁ vā bhogakkhandhaṁ pahāya appaṁ vā ñātiparivaṭṭaṁ pahāya mahantaṁ vā ñātiparivaṭṭaṁ pahāya kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajati. ",
  "dn5:27.4.3.1": "So evaṁ pabbajito samāno pātimokkhasaṁvarasaṁvuto viharati ācāragocarasampanno, aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu, kāyakammavacīkammena samannāgato kusalena, parisuddhājīvo sīlasampanno, indriyesu guttadvāro, satisampajaññena samannāgato, santuṭṭho. ",
  "dn5:27.4.4.0.1": "5.1. Sīla ",
  "dn5:27.4.4.0.2": "5.1.1. Cūḷasīla ",
  "dn5:27.4.4.1": "Kathañca, brāhmaṇa, bhikkhu sīlasampanno hoti? ",
  "dn5:27.4.4.2": "Idha, brāhmaṇa, bhikkhu pāṇātipātaṁ pahāya pāṇātipātā paṭivirato hoti. Nihitadaṇḍo nihitasattho lajjī dayāpanno sabbapāṇabhūtahitānukampī viharati. ",
  "dn5:27.4.4.3": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.4.4": "Adinnādānaṁ pahāya adinnādānā paṭivirato hoti dinnādāyī dinnapāṭikaṅkhī, athenena sucibhūtena attanā viharati. ",
  "dn5:27.4.4.5": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.4.6": "Abrahmacariyaṁ pahāya brahmacārī hoti ārācārī virato methunā gāmadhammā. ",
  "dn5:27.4.4.7": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.5.1": "Musāvādaṁ pahāya musāvādā paṭivirato hoti saccavādī saccasandho theto paccayiko avisaṁvādako lokassa. ",
  "dn5:27.4.5.2": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.5.3": "Pisuṇaṁ vācaṁ pahāya pisuṇāya vācāya paṭivirato hoti; ito sutvā na amutra akkhātā imesaṁ bhedāya; amutra vā sutvā na imesaṁ akkhātā, amūsaṁ bhedāya. Iti bhinnānaṁ vā sandhātā, sahitānaṁ vā anuppadātā, samaggārāmo samaggarato samagganandī samaggakaraṇiṁ vācaṁ bhāsitā hoti. ",
  "dn5:27.4.5.4": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.5.5": "Pharusaṁ vācaṁ pahāya pharusāya vācāya paṭivirato hoti; yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā tathārūpiṁ vācaṁ bhāsitā hoti. ",
  "dn5:27.4.5.6": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.5.7": "Samphappalāpaṁ pahāya samphappalāpā paṭivirato hoti kālavādī bhūtavādī atthavādī dhammavādī vinayavādī, nidhānavatiṁ vācaṁ bhāsitā hoti kālena sāpadesaṁ pariyantavatiṁ atthasaṁhitaṁ. ",
  "dn5:27.4.5.8": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.6.1": "Bījagāmabhūtagāmasamārambhā paṭivirato hoti …pe… ",
  "dn5:27.4.6.2": "ekabhattiko hoti rattūparato virato vikālabhojanā. ",
  "dn5:27.4.6.3": "Naccagītavāditavisūkadassanā paṭivirato hoti. ",
  "dn5:27.4.6.4": "Mālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānā paṭivirato hoti. ",
  "dn5:27.4.6.5": "Uccāsayanamahāsayanā paṭivirato hoti. ",
  "dn5:27.4.6.6": "Jātarūparajatapaṭiggahaṇā paṭivirato hoti. ",
  "dn5:27.4.6.7": "Āmakadhaññapaṭiggahaṇā paṭivirato hoti. ",
  "dn5:27.4.6.8": "Āmakamaṁsapaṭiggahaṇā paṭivirato hoti. ",
  "dn5:27.4.6.9": "Itthikumārikapaṭiggahaṇā paṭivirato hoti. ",
  "dn5:27.4.6.10": "Dāsidāsapaṭiggahaṇā paṭivirato hoti. ",
  "dn5:27.4.6.11": "Ajeḷakapaṭiggahaṇā paṭivirato hoti. ",
  "dn5:27.4.6.12": "Kukkuṭasūkarapaṭiggahaṇā paṭivirato hoti. ",
  "dn5:27.4.6.13": "Hatthigavassavaḷavapaṭiggahaṇā paṭivirato hoti. ",
  "dn5:27.4.6.14": "Khettavatthupaṭiggahaṇā paṭivirato hoti. ",
  "dn5:27.4.6.15": "Dūteyyapahiṇagamanānuyogā paṭivirato hoti. ",
  "dn5:27.4.6.16": "Kayavikkayā paṭivirato hoti. ",
  "dn5:27.4.6.17": "Tulākūṭakaṁsakūṭamānakūṭā paṭivirato hoti. ",
  "dn5:27.4.6.18": "Ukkoṭanavañcananikatisāciyogā paṭivirato hoti. ",
  "dn5:27.4.6.19": "Chedanavadhabandhanaviparāmosaālopasahasākārā paṭivirato hoti. ",
  "dn5:27.4.6.20": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.6.21": "Cūḷasīlaṁ niṭṭhitaṁ. ",
  "dn5:27.4.7.0": "5.1.2. Majjhimasīla ",
  "dn5:27.4.7.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ bījagāmabhūtagāmasamārambhaṁ anuyuttā viharanti. ",
  "dn5:27.4.7.2": "Seyyathidaṁ—mūlabījaṁ khandhabījaṁ phaḷubījaṁ aggabījaṁ bījabījameva pañcamaṁ, iti evarūpā bījagāmabhūtagāmasamārambhā paṭivirato hoti. ",
  "dn5:27.4.7.3": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.8.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ sannidhikāraparibhogaṁ anuyuttā viharanti. ",
  "dn5:27.4.8.2": "Seyyathidaṁ—annasannidhiṁ pānasannidhiṁ vatthasannidhiṁ yānasannidhiṁ sayanasannidhiṁ gandhasannidhiṁ āmisasannidhiṁ, ",
  "dn5:27.4.8.3": "iti vā iti evarūpā sannidhikāraparibhogā paṭivirato hoti. ",
  "dn5:27.4.8.4": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.9.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ visūkadassanaṁ anuyuttā viharanti. ",
  "dn5:27.4.9.2": "Seyyathidaṁ—naccaṁ gītaṁ vāditaṁ pekkhaṁ akkhānaṁ pāṇissaraṁ vetāḷaṁ kumbhathūṇaṁ sobhanakaṁ caṇḍālaṁ vaṁsaṁ dhovanaṁ hatthiyuddhaṁ assayuddhaṁ mahiṁsayuddhaṁ usabhayuddhaṁ ajayuddhaṁ meṇḍayuddhaṁ kukkuṭayuddhaṁ vaṭṭakayuddhaṁ daṇḍayuddhaṁ muṭṭhiyuddhaṁ nibbuddhaṁ uyyodhikaṁ balaggaṁ senābyūhaṁ anīkadassanaṁ ",
  "dn5:27.4.9.3": "iti vā iti evarūpā visūkadassanā paṭivirato hoti. ",
  "dn5:27.4.9.4": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.10.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ jūtappamādaṭṭhānānuyogaṁ anuyuttā viharanti. ",
  "dn5:27.4.10.2": "Seyyathidaṁ—aṭṭhapadaṁ dasapadaṁ ākāsaṁ parihārapathaṁ santikaṁ khalikaṁ ghaṭikaṁ salākahatthaṁ akkhaṁ paṅgacīraṁ vaṅkakaṁ mokkhacikaṁ ciṅgulikaṁ pattāḷhakaṁ rathakaṁ dhanukaṁ akkharikaṁ manesikaṁ yathāvajjaṁ ",
  "dn5:27.4.10.3": "iti vā iti evarūpā jūtappamādaṭṭhānānuyogā paṭivirato hoti. ",
  "dn5:27.4.10.4": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.11.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ uccāsayanamahāsayanaṁ anuyuttā viharanti. ",
  "dn5:27.4.11.2": "Seyyathidaṁ—āsandiṁ pallaṅkaṁ gonakaṁ cittakaṁ paṭikaṁ paṭalikaṁ tūlikaṁ vikatikaṁ uddalomiṁ ekantalomiṁ kaṭṭissaṁ koseyyaṁ kuttakaṁ hatthattharaṁ assattharaṁ rathattharaṁ ajinappaveṇiṁ kadalimigapavarapaccattharaṇaṁ sauttaracchadaṁ ubhatolohitakūpadhānaṁ ",
  "dn5:27.4.11.3": "iti vā iti evarūpā uccāsayanamahāsayanā paṭivirato hoti. ",
  "dn5:27.4.11.4": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.12.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ maṇḍanavibhūsanaṭṭhānānuyogaṁ anuyuttā viharanti. ",
  "dn5:27.4.12.2": "Seyyathidaṁ—ucchādanaṁ parimaddanaṁ nhāpanaṁ sambāhanaṁ ādāsaṁ añjanaṁ mālāgandhavilepanaṁ mukhacuṇṇaṁ mukhalepanaṁ hatthabandhaṁ sikhābandhaṁ daṇḍaṁ nāḷikaṁ asiṁ chattaṁ citrupāhanaṁ uṇhīsaṁ maṇiṁ vālabījaniṁ odātāni vatthāni dīghadasāni ",
  "dn5:27.4.12.3": "iti vā iti evarūpā maṇḍanavibhūsanaṭṭhānānuyogā paṭivirato hoti. ",
  "dn5:27.4.12.4": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.13.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ tiracchānakathaṁ anuyuttā viharanti. ",
  "dn5:27.4.13.2": "Seyyathidaṁ—rājakathaṁ corakathaṁ mahāmattakathaṁ senākathaṁ bhayakathaṁ yuddhakathaṁ annakathaṁ pānakathaṁ vatthakathaṁ sayanakathaṁ mālākathaṁ gandhakathaṁ ñātikathaṁ yānakathaṁ gāmakathaṁ nigamakathaṁ nagarakathaṁ janapadakathaṁ itthikathaṁ sūrakathaṁ visikhākathaṁ kumbhaṭṭhānakathaṁ pubbapetakathaṁ nānattakathaṁ lokakkhāyikaṁ samuddakkhāyikaṁ itibhavābhavakathaṁ ",
  "dn5:27.4.13.3": "iti vā iti evarūpāya tiracchānakathāya paṭivirato hoti. ",
  "dn5:27.4.13.4": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.14.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ viggāhikakathaṁ anuyuttā viharanti. ",
  "dn5:27.4.14.2": "Seyyathidaṁ—na tvaṁ imaṁ dhammavinayaṁ ājānāsi, ahaṁ imaṁ dhammavinayaṁ ājānāmi, kiṁ tvaṁ imaṁ dhammavinayaṁ ājānissasi, micchā paṭipanno tvamasi, ahamasmi sammā paṭipanno, sahitaṁ me, asahitaṁ te, pure vacanīyaṁ pacchā avaca, pacchā vacanīyaṁ pure avaca, adhiciṇṇaṁ te viparāvattaṁ, āropito te vādo, niggahito tvamasi, cara vādappamokkhāya, nibbeṭhehi vā sace pahosīti ",
  "dn5:27.4.14.3": "iti vā iti evarūpāya viggāhikakathāya paṭivirato hoti. ",
  "dn5:27.4.14.4": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.15.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ dūteyyapahiṇagamanānuyogaṁ anuyuttā viharanti. ",
  "dn5:27.4.15.2": "Seyyathidaṁ—raññaṁ, rājamahāmattānaṁ, khattiyānaṁ, brāhmaṇānaṁ, gahapatikānaṁ, kumārānaṁ—idha gaccha, amutrāgaccha, idaṁ hara, amutra idaṁ āharā’ti ",
  "dn5:27.4.15.3": "iti vā iti evarūpā dūteyyapahiṇagamanānuyogā paṭivirato hoti. ",
  "dn5:27.4.15.4": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.16.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te kuhakā ca honti lapakā ca nemittikā ca nippesikā ca lābhena lābhaṁ nijigīsitāro ca. Iti evarūpā kuhanalapanā paṭivirato hoti. ",
  "dn5:27.4.16.2": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.16.3": "Majjhimasīlaṁ niṭṭhitaṁ. ",
  "dn5:27.4.17.0": "5.1.3. Mahāsīla ",
  "dn5:27.4.17.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn5:27.4.17.2": "Seyyathidaṁ—aṅgaṁ nimittaṁ uppātaṁ supinaṁ lakkhaṇaṁ mūsikacchinnaṁ aggihomaṁ dabbihomaṁ thusahomaṁ kaṇahomaṁ taṇḍulahomaṁ sappihomaṁ telahomaṁ mukhahomaṁ lohitahomaṁ aṅgavijjā vatthuvijjā khattavijjā sivavijjā bhūtavijjā bhūrivijjā ahivijjā visavijjā vicchikavijjā mūsikavijjā sakuṇavijjā vāyasavijjā pakkajjhānaṁ saraparittāṇaṁ migacakkaṁ ",
  "dn5:27.4.17.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn5:27.4.17.4": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.18.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn5:27.4.18.2": "Seyyathidaṁ—maṇilakkhaṇaṁ vatthalakkhaṇaṁ daṇḍalakkhaṇaṁ satthalakkhaṇaṁ asilakkhaṇaṁ usulakkhaṇaṁ dhanulakkhaṇaṁ āvudhalakkhaṇaṁ itthilakkhaṇaṁ purisalakkhaṇaṁ kumāralakkhaṇaṁ kumārilakkhaṇaṁ dāsalakkhaṇaṁ dāsilakkhaṇaṁ hatthilakkhaṇaṁ assalakkhaṇaṁ mahiṁsalakkhaṇaṁ usabhalakkhaṇaṁ golakkhaṇaṁ ajalakkhaṇaṁ meṇḍalakkhaṇaṁ kukkuṭalakkhaṇaṁ vaṭṭakalakkhaṇaṁ godhālakkhaṇaṁ kaṇṇikalakkhaṇaṁ kacchapalakkhaṇaṁ migalakkhaṇaṁ ",
  "dn5:27.4.18.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn5:27.4.18.4": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.19.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn5:27.4.19.2": "Seyyathidaṁ—raññaṁ niyyānaṁ bhavissati, raññaṁ aniyyānaṁ bhavissati, abbhantarānaṁ raññaṁ upayānaṁ bhavissati, bāhirānaṁ raññaṁ apayānaṁ bhavissati, bāhirānaṁ raññaṁ upayānaṁ bhavissati, abbhantarānaṁ raññaṁ apayānaṁ bhavissati, abbhantarānaṁ raññaṁ jayo bhavissati, bāhirānaṁ raññaṁ parājayo bhavissati, bāhirānaṁ raññaṁ jayo bhavissati, abbhantarānaṁ raññaṁ parājayo bhavissati, iti imassa jayo bhavissati, imassa parājayo bhavissati ",
  "dn5:27.4.19.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn5:27.4.19.4": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.20.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn5:27.4.20.2": "Seyyathidaṁ—candaggāho bhavissati, sūriyaggāho bhavissati, nakkhattaggāho bhavissati, candimasūriyānaṁ pathagamanaṁ bhavissati, candimasūriyānaṁ uppathagamanaṁ bhavissati, nakkhattānaṁ pathagamanaṁ bhavissati, nakkhattānaṁ uppathagamanaṁ bhavissati, ukkāpāto bhavissati, disāḍāho bhavissati, bhūmicālo bhavissati, devadudrabhi bhavissati, candimasūriyanakkhattānaṁ uggamanaṁ ogamanaṁ saṅkilesaṁ vodānaṁ bhavissati, evaṁvipāko candaggāho bhavissati, evaṁvipāko sūriyaggāho bhavissati, evaṁvipāko nakkhattaggāho bhavissati, evaṁvipākaṁ candimasūriyānaṁ pathagamanaṁ bhavissati, evaṁvipākaṁ candimasūriyānaṁ uppathagamanaṁ bhavissati, evaṁvipākaṁ nakkhattānaṁ pathagamanaṁ bhavissati, evaṁvipākaṁ nakkhattānaṁ uppathagamanaṁ bhavissati, evaṁvipāko ukkāpāto bhavissati, evaṁvipāko disāḍāho bhavissati, evaṁvipāko bhūmicālo bhavissati, evaṁvipāko devadudrabhi bhavissati, evaṁvipākaṁ candimasūriyanakkhattānaṁ uggamanaṁ ogamanaṁ saṅkilesaṁ vodānaṁ bhavissati ",
  "dn5:27.4.20.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn5:27.4.20.4": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.21.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn5:27.4.21.2": "Seyyathidaṁ—suvuṭṭhikā bhavissati, dubbuṭṭhikā bhavissati, subhikkhaṁ bhavissati, dubbhikkhaṁ bhavissati, khemaṁ bhavissati, bhayaṁ bhavissati, rogo bhavissati, ārogyaṁ bhavissati, muddā, gaṇanā, saṅkhānaṁ, kāveyyaṁ, lokāyataṁ ",
  "dn5:27.4.21.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn5:27.4.21.4": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.22.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn5:27.4.22.2": "Seyyathidaṁ—āvāhanaṁ vivāhanaṁ saṁvaraṇaṁ vivaraṇaṁ saṅkiraṇaṁ vikiraṇaṁ subhagakaraṇaṁ dubbhagakaraṇaṁ viruddhagabbhakaraṇaṁ jivhānibandhanaṁ hanusaṁhananaṁ hatthābhijappanaṁ hanujappanaṁ kaṇṇajappanaṁ ādāsapañhaṁ kumārikapañhaṁ devapañhaṁ ādiccupaṭṭhānaṁ mahatupaṭṭhānaṁ abbhujjalanaṁ sirivhāyanaṁ ",
  "dn5:27.4.22.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn5:27.4.22.4": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.23.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn5:27.4.23.2": "Seyyathidaṁ—santikammaṁ paṇidhikammaṁ bhūtakammaṁ bhūrikammaṁ vassakammaṁ vossakammaṁ vatthukammaṁ vatthuparikammaṁ ācamanaṁ nhāpanaṁ juhanaṁ vamanaṁ virecanaṁ uddhaṁvirecanaṁ adhovirecanaṁ sīsavirecanaṁ kaṇṇatelaṁ nettatappanaṁ natthukammaṁ añjanaṁ paccañjanaṁ sālākiyaṁ sallakattiyaṁ dārakatikicchā, mūlabhesajjānaṁ anuppadānaṁ, osadhīnaṁ paṭimokkho ",
  "dn5:27.4.23.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn5:27.4.23.4": "Idampissa hoti sīlasmiṁ. ",
  "dn5:27.4.24.1": "Sa kho so, brāhmaṇa, bhikkhu evaṁ sīlasampanno na kutoci bhayaṁ samanupassati, yadidaṁ sīlasaṁvarato. ",
  "dn5:27.4.24.2": "Seyyathāpi, brāhmaṇa, rājā khattiyo muddhābhisitto nihatapaccāmitto na kutoci bhayaṁ samanupassati, yadidaṁ paccatthikato; ",
  "dn5:27.4.24.3": "evameva kho, brāhmaṇa, bhikkhu evaṁ sīlasampanno na kutoci bhayaṁ samanupassati, yadidaṁ sīlasaṁvarato. ",
  "dn5:27.4.24.4": "So iminā ariyena sīlakkhandhena samannāgato ajjhattaṁ anavajjasukhaṁ paṭisaṁvedeti. ",
  "dn5:27.5": "Evaṁ kho, brāhmaṇa, bhikkhu sīlasampanno hoti. ",
  "dn5:27.5.1.6": "Mahāsīlaṁ niṭṭhitaṁ. ",
  "dn5:27.5.2.0.1": "5.2. Samādhi ",
  "dn5:27.5.2.0.2": "5.2.1. Indriyasaṁvara ",
  "dn5:27.5.2.1": "Kathañca, brāhmaṇa, bhikkhu indriyesu guttadvāro hoti? ",
  "dn5:27.5.2.2": "Idha, brāhmaṇa, bhikkhu cakkhunā rūpaṁ disvā na nimittaggāhī hoti nānubyañjanaggāhī. ",
  "dn5:27.5.2.3": "Yatvādhikaraṇamenaṁ cakkhundriyaṁ asaṁvutaṁ viharantaṁ abhijjhā domanassā pāpakā akusalā dhammā anvāssaveyyuṁ, tassa saṁvarāya paṭipajjati, rakkhati cakkhundriyaṁ, cakkhundriye saṁvaraṁ āpajjati. ",
  "dn5:27.5.2.4": "Sotena saddaṁ sutvā …pe… ",
  "dn5:27.5.2.5": "ghānena gandhaṁ ghāyitvā …pe… ",
  "dn5:27.5.2.6": "jivhāya rasaṁ sāyitvā …pe… ",
  "dn5:27.5.2.7": "kāyena phoṭṭhabbaṁ phusitvā …pe… ",
  "dn5:27.5.2.8": "manasā dhammaṁ viññāya na nimittaggāhī hoti nānubyañjanaggāhī. ",
  "dn5:27.5.2.9": "Yatvādhikaraṇamenaṁ manindriyaṁ asaṁvutaṁ viharantaṁ abhijjhā domanassā pāpakā akusalā dhammā anvāssaveyyuṁ, tassa saṁvarāya paṭipajjati, rakkhati manindriyaṁ, manindriye saṁvaraṁ āpajjati. ",
  "dn5:27.5.2.10": "So iminā ariyena indriyasaṁvarena samannāgato ajjhattaṁ abyāsekasukhaṁ paṭisaṁvedeti. ",
  "dn5:27.5.2.11": "Evaṁ kho, brāhmaṇa, bhikkhu indriyesu guttadvāro hoti. ",
  "dn5:27.5.3.0": "5.2.2. Satisampajañña ",
  "dn5:27.5.3.1": "Kathañca, brāhmaṇa, bhikkhu satisampajaññena samannāgato hoti? ",
  "dn5:27.5.3.2": "Idha, brāhmaṇa, bhikkhu abhikkante paṭikkante sampajānakārī hoti, ālokite vilokite sampajānakārī hoti, samiñjite pasārite sampajānakārī hoti, saṅghāṭipattacīvaradhāraṇe sampajānakārī hoti, asite pīte khāyite sāyite sampajānakārī hoti, uccārapassāvakamme sampajānakārī hoti, gate ṭhite nisinne sutte jāgarite bhāsite tuṇhībhāve sampajānakārī hoti. ",
  "dn5:27.5.3.3": "Evaṁ kho, brāhmaṇa, bhikkhu satisampajaññena samannāgato hoti. ",
  "dn5:27.5.4.0": "5.2.3. Santosa ",
  "dn5:27.5.4.1": "Kathañca, brāhmaṇa, bhikkhu santuṭṭho hoti? ",
  "dn5:27.5.4.2": "Idha, brāhmaṇa, bhikkhu santuṭṭho hoti kāyaparihārikena cīvarena, kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati, samādāyeva pakkamati. ",
  "dn5:27.5.4.3": "Seyyathāpi, brāhmaṇa, pakkhī sakuṇo yena yeneva ḍeti, sapattabhārova ḍeti; ",
  "dn5:27.5.4.4": "evameva kho, brāhmaṇa, bhikkhu santuṭṭho hoti kāyaparihārikena cīvarena kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati, samādāyeva pakkamati. ",
  "dn5:27.5.4.5": "Evaṁ kho, brāhmaṇa, bhikkhu santuṭṭho hoti. ",
  "dn5:27.5.5.0": "5.2.4. Nīvaraṇappahāna ",
  "dn5:27.5.5.1": "So iminā ca ariyena sīlakkhandhena samannāgato, iminā ca ariyena indriyasaṁvarena samannāgato, iminā ca ariyena satisampajaññena samannāgato, imāya ca ariyāya santuṭṭhiyā samannāgato, ",
  "dn5:27.5.5.2": "vivittaṁ senāsanaṁ bhajati araññaṁ rukkhamūlaṁ pabbataṁ kandaraṁ giriguhaṁ susānaṁ vanapatthaṁ abbhokāsaṁ palālapuñjaṁ. ",
  "dn5:27.5.5.3": "So pacchābhattaṁ piṇḍapātapaṭikkanto nisīdati pallaṅkaṁ ābhujitvā ujuṁ kāyaṁ paṇidhāya parimukhaṁ satiṁ upaṭṭhapetvā. ",
  "dn5:27.5.6.1": "So abhijjhaṁ loke pahāya vigatābhijjhena cetasā viharati, abhijjhāya cittaṁ parisodheti. ",
  "dn5:27.5.6.2": "Byāpādapadosaṁ pahāya abyāpannacitto viharati sabbapāṇabhūtahitānukampī, byāpādapadosā cittaṁ parisodheti. ",
  "dn5:27.5.6.3": "Thinamiddhaṁ pahāya vigatathinamiddho viharati ālokasaññī, sato sampajāno, thinamiddhā cittaṁ parisodheti. ",
  "dn5:27.5.6.4": "Uddhaccakukkuccaṁ pahāya anuddhato viharati, ajjhattaṁ vūpasantacitto, uddhaccakukkuccā cittaṁ parisodheti. ",
  "dn5:27.5.6.5": "Vicikicchaṁ pahāya tiṇṇavicikiccho viharati, akathaṅkathī kusalesu dhammesu, vicikicchāya cittaṁ parisodheti. ",
  "dn5:27.5.7.1": "Seyyathāpi, brāhmaṇa, puriso iṇaṁ ādāya kammante payojeyya. ",
  "dn5:27.5.7.2": "Tassa te kammantā samijjheyyuṁ. ",
  "dn5:27.5.7.3": "So yāni ca porāṇāni iṇamūlāni, tāni ca byantiṁ kareyya, siyā cassa uttariṁ avasiṭṭhaṁ dārabharaṇāya. ",
  "dn5:27.5.7.4": "Tassa evamassa: ",
  "dn5:27.5.7.5": "‘ahaṁ kho pubbe iṇaṁ ādāya kammante payojesiṁ. ",
  "dn5:27.5.7.6": "Tassa me te kammantā samijjhiṁsu. ",
  "dn5:27.5.7.7": "Sohaṁ yāni ca porāṇāni iṇamūlāni, tāni ca byantiṁ akāsiṁ, atthi ca me uttariṁ avasiṭṭhaṁ dārabharaṇāyā’ti. ",
  "dn5:27.5.7.8": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn5:27.5.8.1": "Seyyathāpi, brāhmaṇa, puriso ābādhiko assa dukkhito bāḷhagilāno; bhattañcassa nacchādeyya, na cassa kāye balamattā. ",
  "dn5:27.5.8.2": "So aparena samayena tamhā ābādhā mucceyya; bhattaṁ cassa chādeyya, siyā cassa kāye balamattā. ",
  "dn5:27.5.8.3": "Tassa evamassa: ",
  "dn5:27.5.8.4": "‘ahaṁ kho pubbe ābādhiko ahosiṁ dukkhito bāḷhagilāno; ",
  "dn5:27.5.8.5": "bhattañca me nacchādesi, na ca me āsi kāye balamattā. ",
  "dn5:27.5.8.6": "Somhi etarahi tamhā ābādhā mutto; ",
  "dn5:27.5.8.7": "bhattañca me chādeti, atthi ca me kāye balamattā’ti. ",
  "dn5:27.5.8.8": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn5:27.5.9.1": "Seyyathāpi, brāhmaṇa, puriso bandhanāgāre baddho assa. ",
  "dn5:27.5.9.2": "So aparena samayena tamhā bandhanāgārā mucceyya sotthinā abbhayena, na cassa kiñci bhogānaṁ vayo. ",
  "dn5:27.5.9.3": "Tassa evamassa: ",
  "dn5:27.5.9.4": "‘ahaṁ kho pubbe bandhanāgāre baddho ahosiṁ, somhi etarahi tamhā bandhanāgārā mutto sotthinā abbhayena. ",
  "dn5:27.5.9.5": "Natthi ca me kiñci bhogānaṁ vayo’ti. ",
  "dn5:27.5.9.6": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn5:27.5.10.1": "Seyyathāpi, brāhmaṇa, puriso dāso assa anattādhīno parādhīno na yenakāmaṅgamo. ",
  "dn5:27.5.10.2": "So aparena samayena tamhā dāsabyā mucceyya attādhīno aparādhīno bhujisso yenakāmaṅgamo. ",
  "dn5:27.5.10.3": "Tassa evamassa: ",
  "dn5:27.5.10.4": "‘ahaṁ kho pubbe dāso ahosiṁ anattādhīno parādhīno na yenakāmaṅgamo. ",
  "dn5:27.5.10.5": "Somhi etarahi tamhā dāsabyā mutto attādhīno aparādhīno bhujisso yenakāmaṅgamo’ti. ",
  "dn5:27.5.10.6": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn5:27.5.11.1": "Seyyathāpi, brāhmaṇa, puriso sadhano sabhogo kantāraddhānamaggaṁ paṭipajjeyya dubbhikkhaṁ sappaṭibhayaṁ. ",
  "dn5:27.5.11.2": "So aparena samayena taṁ kantāraṁ nitthareyya sotthinā, gāmantaṁ anupāpuṇeyya khemaṁ appaṭibhayaṁ. ",
  "dn5:27.5.11.3": "Tassa evamassa: ",
  "dn5:27.5.11.4": "‘ahaṁ kho pubbe sadhano sabhogo kantāraddhānamaggaṁ paṭipajjiṁ dubbhikkhaṁ sappaṭibhayaṁ. ",
  "dn5:27.5.11.5": "Somhi etarahi taṁ kantāraṁ nitthiṇṇo sotthinā, gāmantaṁ anuppatto khemaṁ appaṭibhayan’ti. ",
  "dn5:27.5.11.6": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn5:27.5.12.1": "Evameva kho, brāhmaṇa, bhikkhu yathā iṇaṁ yathā rogaṁ yathā bandhanāgāraṁ yathā dāsabyaṁ yathā kantāraddhānamaggaṁ, evaṁ ime pañca nīvaraṇe appahīne attani samanupassati. ",
  "dn5:27.5.12.2": "Seyyathāpi, brāhmaṇa, yathā āṇaṇyaṁ yathā ārogyaṁ yathā bandhanāmokkhaṁ yathā bhujissaṁ yathā khemantabhūmiṁ; ",
  "dn5:27.5.12.3": "evameva kho, brāhmaṇa, bhikkhu ime pañca nīvaraṇe pahīne attani samanupassati. ",
  "dn5:27.5.12.4": "Tassime pañca nīvaraṇe pahīne attani samanupassato pāmojjaṁ jāyati, pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṁ vedeti, sukhino cittaṁ samādhiyati. ",
  "dn5:27.5.13.0": "5.2.5. Paṭhamajhāna ",
  "dn5:27.6": "So vivicceva kāmehi, vivicca akusalehi dhammehi savitakkaṁ savicāraṁ vivekajaṁ pītisukhaṁ paṭhamaṁ jhānaṁ upasampajja viharati. ",
  "dn5:27.6.1.2": "So imameva kāyaṁ vivekajena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa vivekajena pītisukhena apphuṭaṁ hoti. ",
  "dn5:27.6.2.1": "Seyyathāpi, brāhmaṇa, dakkho nhāpako vā nhāpakantevāsī vā kaṁsathāle nhānīyacuṇṇāni ākiritvā udakena paripphosakaṁ paripphosakaṁ sanneyya, sāyaṁ nhānīyapiṇḍi snehānugatā snehaparetā santarabāhirā phuṭā snehena, na ca paggharaṇī; ",
  "dn5:27.6.2.2": "evameva kho, brāhmaṇa, bhikkhu imameva kāyaṁ vivekajena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa vivekajena pītisukhena apphuṭaṁ hoti. ",
  "dn5:27.7": "ayampi kho, brāhmaṇa, yañño purimehi yaññehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro ca …pe… ",
  "dn5:27.7.1.0": "5.2.6. Dutiyajhāna ",
  "dn5:27.8": "Puna caparaṁ, brāhmaṇa, bhikkhu vitakkavicārānaṁ vūpasamā ajjhattaṁ sampasādanaṁ cetaso ekodibhāvaṁ avitakkaṁ avicāraṁ samādhijaṁ pītisukhaṁ dutiyaṁ jhānaṁ upasampajja viharati. ",
  "dn5:27.8.1.2": "So imameva kāyaṁ samādhijena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa samādhijena pītisukhena apphuṭaṁ hoti. ",
  "dn5:27.8.2.1": "Seyyathāpi, brāhmaṇa, udakarahado gambhīro ubbhidodako tassa nevassa puratthimāya disāya udakassa āyamukhaṁ, na dakkhiṇāya disāya udakassa āyamukhaṁ, na pacchimāya disāya udakassa āyamukhaṁ, na uttarāya disāya udakassa āyamukhaṁ, devo ca na kālena kālaṁ sammādhāraṁ anuppaveccheyya. ",
  "dn5:27.8.2.2": "Atha kho tamhāva udakarahadā sītā vāridhārā ubbhijjitvā tameva udakarahadaṁ sītena vārinā abhisandeyya parisandeyya paripūreyya paripphareyya, nāssa kiñci sabbāvato udakarahadassa sītena vārinā apphuṭaṁ assa. ",
  "dn5:27.8.2.3": "Evameva kho, brāhmaṇa, bhikkhu imameva kāyaṁ samādhijena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa samādhijena pītisukhena apphuṭaṁ hoti. ",
  "dn5:27.8.2.4": "ayampi kho, brāhmaṇa, yañño purimehi yaññehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro ca …pe… ",
  "dn5:27.8.3.0": "5.2.7. Tatiyajhāna ",
  "dn5:27.9": "Puna caparaṁ, brāhmaṇa, bhikkhu pītiyā ca virāgā upekkhako ca viharati sato sampajāno, sukhañca kāyena paṭisaṁvedeti, yaṁ taṁ ariyā ācikkhanti: ‘upekkhako satimā sukhavihārī’ti, tatiyaṁ jhānaṁ upasampajja viharati. ",
  "dn5:27.9.1.2": "So imameva kāyaṁ nippītikena sukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa nippītikena sukhena apphuṭaṁ hoti. ",
  "dn5:27.9.2.1": "Seyyathāpi, brāhmaṇa, uppaliniyaṁ vā paduminiyaṁ vā puṇḍarīkiniyaṁ vā appekaccāni uppalāni vā padumāni vā puṇḍarīkāni vā udake jātāni udake saṁvaḍḍhāni udakānuggatāni antonimuggaposīni, tāni yāva caggā yāva ca mūlā sītena vārinā abhisannāni parisannāni paripūrāni paripphuṭāni, nāssa kiñci sabbāvataṁ uppalānaṁ vā padumānaṁ vā puṇḍarīkānaṁ vā sītena vārinā apphuṭaṁ assa; ",
  "dn5:27.9.2.2": "evameva kho, brāhmaṇa, bhikkhu imameva kāyaṁ nippītikena sukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa nippītikena sukhena apphuṭaṁ hoti. ",
  "dn5:27.9.2.3": "ayampi kho, brāhmaṇa, yañño purimehi yaññehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro ca …pe… ",
  "dn5:27.9.3.0": "5.2.8. Catutthajhāna ",
  "dn5:27.10": "Puna caparaṁ, brāhmaṇa, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā, pubbeva somanassadomanassānaṁ atthaṅgamā adukkhamasukhaṁ upekkhāsatipārisuddhiṁ catutthaṁ jhānaṁ upasampajja viharati. ",
  "dn5:27.10.1.2": "So imameva kāyaṁ parisuddhena cetasā pariyodātena pharitvā nisinno hoti, nāssa kiñci sabbāvato kāyassa parisuddhena cetasā pariyodātena apphuṭaṁ hoti. ",
  "dn5:27.10.2.1": "Seyyathāpi, brāhmaṇa, puriso odātena vatthena sasīsaṁ pārupitvā nisinno assa, nāssa kiñci sabbāvato kāyassa odātena vatthena apphuṭaṁ assa; ",
  "dn5:27.10.2.2": "evameva kho, brāhmaṇa, bhikkhu imameva kāyaṁ parisuddhena cetasā pariyodātena pharitvā nisinno hoti, nāssa kiñci sabbāvato kāyassa parisuddhena cetasā pariyodātena apphuṭaṁ hoti. ",
  "dn5:27.11": "ayampi kho, brāhmaṇa, yañño purimehi yaññehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro ca …pe… ",
  "dn5:27.11.1.0.1": "5.3. Aṭṭhañāṇa ",
  "dn5:27.11.1.0.2": "5.3.1. Vipassanāñāṇa ",
  "dn5:27.12": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte ñāṇadassanāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn5:27.12.1.2": "So evaṁ pajānāti: ",
  "dn5:27.12.1.3": "‘ayaṁ kho me kāyo rūpī cātumahābhūtiko mātāpettikasambhavo odanakummāsūpacayo aniccucchādanaparimaddanabhedanaviddhaṁsanadhammo; ",
  "dn5:27.12.1.4": "idañca pana me viññāṇaṁ ettha sitaṁ ettha paṭibaddhan’ti. ",
  "dn5:27.12.2.1": "Seyyathāpi, brāhmaṇa, maṇi veḷuriyo subho jātimā aṭṭhaṁso suparikammakato accho vippasanno anāvilo sabbākārasampanno. ",
  "dn5:27.12.2.2": "Tatrāssa suttaṁ āvutaṁ nīlaṁ vā pītaṁ vā lohitaṁ vā odātaṁ vā paṇḍusuttaṁ vā. ",
  "dn5:27.12.2.3": "Tamenaṁ cakkhumā puriso hatthe karitvā paccavekkheyya: ",
  "dn5:27.12.2.4": "‘ayaṁ kho maṇi veḷuriyo subho jātimā aṭṭhaṁso suparikammakato accho vippasanno anāvilo sabbākārasampanno; ",
  "dn5:27.12.2.5": "tatridaṁ suttaṁ āvutaṁ nīlaṁ vā pītaṁ vā lohitaṁ vā odātaṁ vā paṇḍusuttaṁ vā’ti. ",
  "dn5:27.12.2.6": "Evameva kho, brāhmaṇa, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte ñāṇadassanāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn5:27.12.2.7": "So evaṁ pajānāti: ",
  "dn5:27.12.2.8": "‘ayaṁ kho me kāyo rūpī cātumahābhūtiko mātāpettikasambhavo odanakummāsūpacayo aniccucchādanaparimaddanabhedanaviddhaṁsanadhammo; ",
  "dn5:27.12.2.9": "idañca pana me viññāṇaṁ ettha sitaṁ ettha paṭibaddhan’ti. ",
  "dn5:27.13": "ayampi kho, brāhmaṇa, yañño purimehi yaññehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro ca …pe… ",
  "dn5:27.13.1.0": "5.3.2. Manomayiddhiñāṇa ",
  "dn5:27.13.1.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte manomayaṁ kāyaṁ abhinimmānāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn5:27.13.1.2": "So imamhā kāyā aññaṁ kāyaṁ abhinimmināti rūpiṁ manomayaṁ sabbaṅgapaccaṅgiṁ ahīnindriyaṁ. ",
  "dn5:27.13.2.1": "Seyyathāpi, brāhmaṇa, puriso muñjamhā īsikaṁ pavāheyya. ",
  "dn5:27.13.2.2": "Tassa evamassa: ",
  "dn5:27.13.2.3": "‘ayaṁ muñjo, ayaṁ īsikā, añño muñjo, aññā īsikā, muñjamhā tveva īsikā pavāḷhā’ti. ",
  "dn5:27.13.2.4": "Seyyathā vā pana, brāhmaṇa, puriso asiṁ kosiyā pavāheyya. ",
  "dn5:27.13.2.5": "Tassa evamassa: ",
  "dn5:27.13.2.6": "‘ayaṁ asi, ayaṁ kosi, añño asi, aññā kosi, kosiyā tveva asi pavāḷho’ti. ",
  "dn5:27.13.2.7": "Seyyathā vā pana, brāhmaṇa, puriso ahiṁ karaṇḍā uddhareyya. ",
  "dn5:27.13.2.8": "Tassa evamassa: ",
  "dn5:27.13.2.9": "‘ayaṁ ahi, ayaṁ karaṇḍo. Añño ahi, añño karaṇḍo, karaṇḍā tveva ahi ubbhato’ti. ",
  "dn5:27.13.2.10": "Evameva kho, brāhmaṇa, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte manomayaṁ kāyaṁ abhinimmānāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn5:27.13.2.11": "So imamhā kāyā aññaṁ kāyaṁ abhinimmināti rūpiṁ manomayaṁ sabbaṅgapaccaṅgiṁ ahīnindriyaṁ. ",
  "dn5:27.13.2.12": "ayampi kho, brāhmaṇa, yañño purimehi yaññehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro ca …pe… ",
  "dn5:27.13.3.0": "5.3.3. Iddhividhañāṇa ",
  "dn5:27.13.3.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte iddhividhāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn5:27.13.3.2": "So anekavihitaṁ iddhividhaṁ paccanubhoti—ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti; āvibhāvaṁ tirobhāvaṁ tirokuṭṭaṁ tiropākāraṁ tiropabbataṁ asajjamāno gacchati seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṁ karoti seyyathāpi udake; udakepi abhijjamāne gacchati seyyathāpi pathaviyā; ākāsepi pallaṅkena kamati seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṁmahiddhike evaṁmahānubhāve pāṇinā parāmasati parimajjati; yāva brahmalokāpi kāyena vasaṁ vatteti. ",
  "dn5:27.13.4.1": "Seyyathāpi, brāhmaṇa, dakkho kumbhakāro vā kumbhakārantevāsī vā suparikammakatāya mattikāya yaṁ yadeva bhājanavikatiṁ ākaṅkheyya, taṁ tadeva kareyya abhinipphādeyya. ",
  "dn5:27.13.4.2": "Seyyathā vā pana, brāhmaṇa, dakkho dantakāro vā dantakārantevāsī vā suparikammakatasmiṁ dantasmiṁ yaṁ yadeva dantavikatiṁ ākaṅkheyya, taṁ tadeva kareyya abhinipphādeyya. ",
  "dn5:27.13.4.3": "Seyyathā vā pana, brāhmaṇa, dakkho suvaṇṇakāro vā suvaṇṇakārantevāsī vā suparikammakatasmiṁ suvaṇṇasmiṁ yaṁ yadeva suvaṇṇavikatiṁ ākaṅkheyya, taṁ tadeva kareyya abhinipphādeyya. ",
  "dn5:27.13.4.4": "Evameva kho, brāhmaṇa, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte iddhividhāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn5:27.13.4.5": "So anekavihitaṁ iddhividhaṁ paccanubhoti—ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti; āvibhāvaṁ tirobhāvaṁ tirokuṭṭaṁ tiropākāraṁ tiropabbataṁ asajjamāno gacchati seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṁ karoti seyyathāpi udake; udakepi abhijjamāne gacchati seyyathāpi pathaviyā; ākāsepi pallaṅkena kamati seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṁmahiddhike evaṁmahānubhāve pāṇinā parāmasati parimajjati; yāva brahmalokāpi kāyena vasaṁ vatteti. ",
  "dn5:27.13.4.6": "ayampi kho, brāhmaṇa, yañño purimehi yaññehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro ca …pe… ",
  "dn5:27.13.5.0": "5.3.4. Dibbasotañāṇa ",
  "dn5:27.13.5.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte dibbāya sotadhātuyā cittaṁ abhinīharati abhininnāmeti. ",
  "dn5:27.13.5.2": "So dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇāti dibbe ca mānuse ca ye dūre santike ca. ",
  "dn5:27.13.6.1": "Seyyathāpi, brāhmaṇa, puriso addhānamaggappaṭipanno. So suṇeyya bherisaddampi mudiṅgasaddampi saṅkhapaṇavadindimasaddampi. Tassa evamassa: ‘bherisaddo’ itipi, ‘mudiṅgasaddo’ itipi, ‘saṅkhapaṇavadindimasaddo’ itipi. ",
  "dn5:27.13.6.2": "Evameva kho, brāhmaṇa, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte dibbāya sotadhātuyā cittaṁ abhinīharati abhininnāmeti. ",
  "dn5:27.13.6.3": "So dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇāti dibbe ca mānuse ca ye dūre santike ca. ",
  "dn5:27.13.6.4": "ayampi kho, brāhmaṇa, yañño purimehi yaññehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro ca …pe… ",
  "dn5:27.13.7.0": "5.3.5. Cetopariyañāṇa ",
  "dn5:27.13.7.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte cetopariyañāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn5:27.13.7.2": "So parasattānaṁ parapuggalānaṁ cetasā ceto paricca pajānāti—",
  "dn5:27.13.7.3": "sarāgaṁ vā cittaṁ ‘sarāgaṁ cittan’ti pajānāti, ",
  "dn5:27.13.7.4": "vītarāgaṁ vā cittaṁ ‘vītarāgaṁ cittan’ti pajānāti, ",
  "dn5:27.13.7.5": "sadosaṁ vā cittaṁ ‘sadosaṁ cittan’ti pajānāti, ",
  "dn5:27.13.7.6": "vītadosaṁ vā cittaṁ ‘vītadosaṁ cittan’ti pajānāti, ",
  "dn5:27.13.7.7": "samohaṁ vā cittaṁ ‘samohaṁ cittan’ti pajānāti, ",
  "dn5:27.13.7.8": "vītamohaṁ vā cittaṁ ‘vītamohaṁ cittan’ti pajānāti, ",
  "dn5:27.13.7.9": "saṅkhittaṁ vā cittaṁ ‘saṅkhittaṁ cittan’ti pajānāti, ",
  "dn5:27.13.7.10": "vikkhittaṁ vā cittaṁ ‘vikkhittaṁ cittan’ti pajānāti, ",
  "dn5:27.13.7.11": "mahaggataṁ vā cittaṁ ‘mahaggataṁ cittan’ti pajānāti, ",
  "dn5:27.13.7.12": "amahaggataṁ vā cittaṁ ‘amahaggataṁ cittan’ti pajānāti, ",
  "dn5:27.13.7.13": "sauttaraṁ vā cittaṁ ‘sauttaraṁ cittan’ti pajānāti, ",
  "dn5:27.13.7.14": "anuttaraṁ vā cittaṁ ‘anuttaraṁ cittan’ti pajānāti, ",
  "dn5:27.13.7.15": "samāhitaṁ vā cittaṁ ‘samāhitaṁ cittan’ti pajānāti, ",
  "dn5:27.13.7.16": "asamāhitaṁ vā cittaṁ ‘asamāhitaṁ cittan’ti pajānāti, ",
  "dn5:27.13.7.17": "vimuttaṁ vā cittaṁ ‘vimuttaṁ cittan’ti pajānāti, ",
  "dn5:27.13.7.18": "avimuttaṁ vā cittaṁ ‘avimuttaṁ cittan’ti pajānāti. ",
  "dn5:27.13.8.1": "Seyyathāpi, brāhmaṇa, itthī vā puriso vā daharo yuvā maṇḍanajātiko ādāse vā parisuddhe pariyodāte acche vā udakapatte sakaṁ mukhanimittaṁ paccavekkhamāno sakaṇikaṁ vā ‘sakaṇikan’ti jāneyya, akaṇikaṁ vā ‘akaṇikan’ti jāneyya; ",
  "dn5:27.13.8.2": "evameva kho, brāhmaṇa, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte cetopariyañāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn5:27.13.8.3": "So parasattānaṁ parapuggalānaṁ cetasā ceto paricca pajānāti—",
  "dn5:27.13.8.4": "ayampi kho, brāhmaṇa, yañño purimehi yaññehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro ca …pe… ",
  "dn5:27.13.9.0": "5.3.6. Pubbenivāsānussatiñāṇa ",
  "dn5:27.13.9.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn5:27.13.9.2": "So anekavihitaṁ pubbenivāsaṁ anussarati, seyyathidaṁ—ekampi jātiṁ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṁsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṁvaṭṭakappe anekepi vivaṭṭakappe anekepi saṁvaṭṭavivaṭṭakappe, ‘amutrāsiṁ evaṁnāmo evaṅgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhappaṭisaṁvedī evamāyupariyanto, so tato cuto amutra udapādiṁ; tatrāpāsiṁ evaṁnāmo evaṅgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhappaṭisaṁvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṁ sauddesaṁ anekavihitaṁ pubbenivāsaṁ anussarati. ",
  "dn5:27.13.10.1": "Seyyathāpi, brāhmaṇa, puriso sakamhā gāmā aññaṁ gāmaṁ gaccheyya, tamhāpi gāmā aññaṁ gāmaṁ gaccheyya. So tamhā gāmā sakaṁyeva gāmaṁ paccāgaccheyya. Tassa evamassa: ‘ahaṁ kho sakamhā gāmā amuṁ gāmaṁ agacchiṁ, tatra evaṁ aṭṭhāsiṁ, evaṁ nisīdiṁ, evaṁ abhāsiṁ, evaṁ tuṇhī ahosiṁ, tamhāpi gāmā amuṁ gāmaṁ agacchiṁ, tatrāpi evaṁ aṭṭhāsiṁ, evaṁ nisīdiṁ, evaṁ abhāsiṁ, evaṁ tuṇhī ahosiṁ, somhi tamhā gāmā sakaṁyeva gāmaṁ paccāgato’ti. ",
  "dn5:27.13.10.2": "Evameva kho, brāhmaṇa, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn5:27.13.10.3": "So anekavihitaṁ pubbenivāsaṁ anussarati, seyyathidaṁ—ekampi jātiṁ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṁsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṁvaṭṭakappe anekepi vivaṭṭakappe anekepi saṁvaṭṭavivaṭṭakappe, ‘amutrāsiṁ evaṁnāmo evaṅgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhappaṭisaṁvedī evamāyupariyanto, so tato cuto amutra udapādiṁ; tatrāpāsiṁ evaṁnāmo evaṅgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhappaṭisaṁvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṁ sauddesaṁ anekavihitaṁ pubbenivāsaṁ anussarati. ",
  "dn5:27.13.10.4": "ayampi kho, brāhmaṇa, yañño purimehi yaññehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro ca …pe… ",
  "dn5:27.13.11.0": "5.3.7. Dibbacakkhuñāṇa ",
  "dn5:27.13.11.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte sattānaṁ cutūpapātañāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn5:27.13.11.2": "So dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate, yathākammūpage satte pajānāti: ‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṁ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā. Te kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapannā. Ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṁ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate, yathākammūpage satte pajānāti. ",
  "dn5:27.13.12.1": "Seyyathāpi, brāhmaṇa, majjhe siṅghāṭake pāsādo. Tattha cakkhumā puriso ṭhito passeyya manusse gehaṁ pavisantepi nikkhamantepi rathikāyapi vīthiṁ sañcarante majjhe siṅghāṭake nisinnepi. Tassa evamassa: ‘ete manussā gehaṁ pavisanti, ete nikkhamanti, ete rathikāya vīthiṁ sañcaranti, ete majjhe siṅghāṭake nisinnā’ti. ",
  "dn5:27.13.12.2": "Evameva kho, brāhmaṇa, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte sattānaṁ cutūpapātañāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn5:27.13.12.3": "So dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate, yathākammūpage satte pajānāti: ‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṁ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā, te kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapannā. Ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṁ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā. Te kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate; yathākammūpage satte pajānāti. ",
  "dn5:27.13.12.4": "ayampi kho, brāhmaṇa, yañño purimehi yaññehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro ca …pe… ",
  "dn5:27.13.13.0": "5.3.8. Āsavakkhayañāṇa ",
  "dn5:27.13.13.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṁ khayañāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn5:27.13.13.2": "So idaṁ dukkhanti yathābhūtaṁ pajānāti, ayaṁ dukkhasamudayoti yathābhūtaṁ pajānāti, ayaṁ dukkhanirodhoti yathābhūtaṁ pajānāti, ayaṁ dukkhanirodhagāminī paṭipadāti yathābhūtaṁ pajānāti. ",
  "dn5:27.13.13.3": "Ime āsavāti yathābhūtaṁ pajānāti, ayaṁ āsavasamudayoti yathābhūtaṁ pajānāti, ayaṁ āsavanirodhoti yathābhūtaṁ pajānāti, ayaṁ āsavanirodhagāminī paṭipadāti yathābhūtaṁ pajānāti. ",
  "dn5:27.13.13.4": "Tassa evaṁ jānato evaṁ passato kāmāsavāpi cittaṁ vimuccati, bhavāsavāpi cittaṁ vimuccati, avijjāsavāpi cittaṁ vimuccati, ",
  "dn5:27.13.13.5": "vimuttasmiṁ ‘vimuttam’iti ñāṇaṁ hoti, ",
  "dn5:27.14": "‘khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānāti. ",
  "dn5:27.14.1.1": "Seyyathāpi, brāhmaṇa, pabbatasaṅkhepe udakarahado accho vippasanno anāvilo. Tattha cakkhumā puriso tīre ṭhito passeyya sippisambukampi sakkharakathalampi macchagumbampi carantampi tiṭṭhantampi. Tassa evamassa: ‘ayaṁ kho udakarahado accho vippasanno anāvilo. Tatrime sippisambukāpi sakkharakathalāpi macchagumbāpi carantipi tiṭṭhantipī’ti. ",
  "dn5:27.14.1.2": "Evameva kho, brāhmaṇa, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṁ khayañāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn5:27.15": "Ayampi kho, brāhmaṇa, yañño purimehi yaññehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṁsataro ca. ",
  "dn5:27.16": "Imāya ca, brāhmaṇa, yaññasampadāya aññā yaññasampadā uttaritarā vā paṇītatarā vā natthī”ti. ",
  "dn5:28.0": "6. Kūṭadantaupāsakattapaṭivedanā ",
  "dn5:28.1": "Evaṁ vutte, kūṭadanto brāhmaṇo bhagavantaṁ etadavoca: ",
  "dn5:28.2": "“abhikkantaṁ, bho gotama, abhikkantaṁ, bho gotama. ",
  "dn5:28.3": "Seyyathāpi, bho gotama, nikkujjitaṁ vā ukkujjeyya, paṭicchannaṁ vā vivareyya, mūḷhassa vā maggaṁ ācikkheyya, andhakāre vā telapajjotaṁ dhāreyya: ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṁ bhotā gotamena anekapariyāyena dhammo pakāsito. ",
  "dn5:28.4": "Esāhaṁ bhavantaṁ gotamaṁ saraṇaṁ gacchāmi dhammañca bhikkhusaṅghañca. ",
  "dn5:28.5": "Upāsakaṁ maṁ bhavaṁ gotamo dhāretu ajjatagge pāṇupetaṁ saraṇaṁ gataṁ. ",
  "dn5:28.6": "Esāhaṁ, bho gotama, satta ca usabhasatāni satta ca vacchatarasatāni satta ca vacchatarīsatāni satta ca ajasatāni satta ca urabbhasatāni muñcāmi, jīvitaṁ demi, haritāni ceva tiṇāni khādantu, sītāni ca pānīyāni pivantu, sīto ca nesaṁ vāto upavāyatū”ti. ",
  "dn5:29.0": "7. Sotāpattiphalasacchikiriyā ",
  "dn5:29.1": "Atha kho bhagavā kūṭadantassa brāhmaṇassa anupubbiṁ kathaṁ kathesi, seyyathidaṁ—",
  "dn5:29.2": "dānakathaṁ sīlakathaṁ saggakathaṁ; kāmānaṁ ādīnavaṁ okāraṁ saṅkilesaṁ nekkhamme ānisaṁsaṁ pakāsesi. ",
  "dn5:29.3": "Yadā bhagavā aññāsi kūṭadantaṁ brāhmaṇaṁ kallacittaṁ muducittaṁ vinīvaraṇacittaṁ udaggacittaṁ pasannacittaṁ, atha yā buddhānaṁ sāmukkaṁsikā dhammadesanā, taṁ pakāsesi—",
  "dn5:29.4": "dukkhaṁ samudayaṁ nirodhaṁ maggaṁ. ",
  "dn5:29.5": "Seyyathāpi nāma suddhaṁ vatthaṁ apagatakāḷakaṁ sammadeva rajanaṁ paṭiggaṇheyya; ",
  "dn5:29.6": "evameva kūṭadantassa brāhmaṇassa tasmiññeva āsane virajaṁ vītamalaṁ dhammacakkhuṁ udapādi: ",
  "dn5:29.7": "“yaṁ kiñci samudayadhammaṁ sabbaṁ taṁ nirodhadhamman”ti. ",
  "dn5:30.1": "Atha kho kūṭadanto brāhmaṇo diṭṭhadhammo pattadhammo viditadhammo pariyogāḷhadhammo tiṇṇavicikiccho vigatakathaṅkatho vesārajjappatto aparappaccayo satthusāsane bhagavantaṁ etadavoca: ",
  "dn5:30.2": "“adhivāsetu me bhavaṁ gotamo svātanāya bhattaṁ saddhiṁ bhikkhusaṅghenā”ti. ",
  "dn5:30.3": "Adhivāsesi bhagavā tuṇhībhāvena. ",
  "dn5:30.4": "Atha kho kūṭadanto brāhmaṇo bhagavato adhivāsanaṁ viditvā uṭṭhāyāsanā bhagavantaṁ abhivādetvā padakkhiṇaṁ katvā pakkāmi. ",
  "dn5:30.5": "Atha kho kūṭadanto brāhmaṇo tassā rattiyā accayena sake yaññavāṭe paṇītaṁ khādanīyaṁ bhojanīyaṁ paṭiyādāpetvā bhagavato kālaṁ ārocāpesi: ",
  "dn5:30.6": "“kālo, bho gotama; niṭṭhitaṁ bhattan”ti. ",
  "dn5:30.7": "Atha kho bhagavā pubbaṇhasamayaṁ nivāsetvā pattacīvaramādāya saddhiṁ bhikkhusaṅghena yena kūṭadantassa brāhmaṇassa yaññavāṭo tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. ",
  "dn5:30.8": "Atha kho kūṭadanto brāhmaṇo buddhappamukhaṁ bhikkhusaṅghaṁ paṇītena khādanīyena bhojanīyena sahatthā santappesi sampavāresi. ",
  "dn5:30.9": "Atha kho kūṭadanto brāhmaṇo bhagavantaṁ bhuttāviṁ onītapattapāṇiṁ aññataraṁ nīcaṁ āsanaṁ gahetvā ekamantaṁ nisīdi. ",
  "dn5:30.10": "Ekamantaṁ nisinnaṁ kho kūṭadantaṁ brāhmaṇaṁ bhagavā dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṁsetvā uṭṭhāyāsanā pakkāmīti. ",
  "dn5:30.11": "Kūṭadantasuttaṁ niṭṭhitaṁ pañcamaṁ. "
}