{
  "dn6:0.1": "Dīgha Nikāya 6 ",
  "dn6:0.2": "Mahālisutta ",
  "dn6:1.0": "1. Brāhmaṇadūtavatthu ",
  "dn6:1.1": "Evaṁ me sutaṁ—",
  "dn6:1.2": "ekaṁ samayaṁ bhagavā vesāliyaṁ viharati mahāvane kūṭāgārasālāyaṁ. ",
  "dn6:1.3": "Tena kho pana samayena sambahulā kosalakā ca brāhmaṇadūtā māgadhakā ca brāhmaṇadūtā vesāliyaṁ paṭivasanti kenacideva karaṇīyena. ",
  "dn6:1.4": "Assosuṁ kho te kosalakā ca brāhmaṇadūtā māgadhakā ca brāhmaṇadūtā: ",
  "dn6:1.5": "“samaṇo khalu, bho, gotamo sakyaputto sakyakulā pabbajito vesāliyaṁ viharati mahāvane kūṭāgārasālāyaṁ. ",
  "dn6:1.6": "Taṁ kho pana bhavantaṁ gotamaṁ evaṁ kalyāṇo kittisaddo abbhuggato: ",
  "dn6:1.7": "‘itipi so bhagavā arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā’. ",
  "dn6:1.8": "So imaṁ lokaṁ sadevakaṁ samārakaṁ sabrahmakaṁ sassamaṇabrāhmaṇiṁ pajaṁ sadevamanussaṁ sayaṁ abhiññā sacchikatvā pavedeti. ",
  "dn6:1.9": "So dhammaṁ deseti ādikalyāṇaṁ majjhekalyāṇaṁ pariyosānakalyāṇaṁ sātthaṁ sabyañjanaṁ kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ pakāseti. ",
  "dn6:1.10": "Sādhu kho pana tathārūpānaṁ arahataṁ dassanaṁ hotī”ti. ",
  "dn6:2.1": "Atha kho te kosalakā ca brāhmaṇadūtā māgadhakā ca brāhmaṇadūtā yena mahāvanaṁ kūṭāgārasālā tenupasaṅkamiṁsu. ",
  "dn6:2.2": "Tena kho pana samayena āyasmā nāgito bhagavato upaṭṭhāko hoti. ",
  "dn6:2.3": "Atha kho te kosalakā ca brāhmaṇadūtā māgadhakā ca brāhmaṇadūtā yenāyasmā nāgito tenupasaṅkamiṁsu. upasaṅkamitvā āyasmantaṁ nāgitaṁ etadavocuṁ: ",
  "dn6:2.4": "“kahaṁ nu kho, bho nāgita, etarahi so bhavaṁ gotamo viharati? ",
  "dn6:2.5": "Dassanakāmā hi mayaṁ taṁ bhavantaṁ gotaman”ti. ",
  "dn6:2.6": "“Akālo kho, āvuso, bhagavantaṁ dassanāya, paṭisallīno bhagavā”ti. ",
  "dn6:2.7": "Atha kho te kosalakā ca brāhmaṇadūtā māgadhakā ca brāhmaṇadūtā tattheva ekamantaṁ nisīdiṁsu: ",
  "dn6:2.8": "“disvāva mayaṁ taṁ bhavantaṁ gotamaṁ gamissāmā”ti. ",
  "dn6:3.0": "2. Oṭṭhaddhalicchavīvatthu ",
  "dn6:3.1": "Oṭṭhaddhopi licchavī mahatiyā licchavīparisāya saddhiṁ yena mahāvanaṁ kūṭāgārasālā yenāyasmā nāgito tenupasaṅkami; upasaṅkamitvā āyasmantaṁ nāgitaṁ abhivādetvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhito kho oṭṭhaddhopi licchavī āyasmantaṁ nāgitaṁ etadavoca: ",
  "dn6:3.2": "“kahaṁ nu kho, bhante nāgita, etarahi so bhagavā viharati arahaṁ sammāsambuddho, ",
  "dn6:3.3": "dassanakāmā hi mayaṁ taṁ bhagavantaṁ arahantaṁ sammāsambuddhan”ti. ",
  "dn6:3.4": "“Akālo kho, mahāli, bhagavantaṁ dassanāya, paṭisallīno bhagavā”ti. ",
  "dn6:3.5": "Oṭṭhaddhopi licchavī tattheva ekamantaṁ nisīdi: ",
  "dn6:3.6": "“disvāva ahaṁ taṁ bhagavantaṁ gamissāmi arahantaṁ sammāsambuddhan”ti. ",
  "dn6:4.1": "Atha kho sīho samaṇuddeso yenāyasmā nāgito tenupasaṅkami; upasaṅkamitvā āyasmantaṁ nāgitaṁ abhivādetvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhito kho sīho samaṇuddeso āyasmantaṁ nāgitaṁ etadavoca: ",
  "dn6:4.2": "“ete, bhante kassapa, sambahulā kosalakā ca brāhmaṇadūtā māgadhakā ca brāhmaṇadūtā idhūpasaṅkantā bhagavantaṁ dassanāya; oṭṭhaddhopi licchavī mahatiyā licchavīparisāya saddhiṁ idhūpasaṅkanto bhagavantaṁ dassanāya, sādhu, bhante kassapa, labhataṁ esā janatā bhagavantaṁ dassanāyā”ti. ",
  "dn6:4.3": "“Tena hi, sīha, tvaññeva bhagavato ārocehī”ti. ",
  "dn6:4.4": "“Evaṁ, bhante”ti kho sīho samaṇuddeso āyasmato nāgitassa paṭissutvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ aṭṭhāsi. Ekamantaṁ ṭhito kho sīho samaṇuddeso bhagavantaṁ etadavoca: ",
  "dn6:4.5": "“ete, bhante, sambahulā kosalakā ca brāhmaṇadūtā māgadhakā ca brāhmaṇadūtā idhūpasaṅkantā bhagavantaṁ dassanāya, oṭṭhaddhopi licchavī mahatiyā licchavīparisāya saddhiṁ idhūpasaṅkanto bhagavantaṁ dassanāya. ",
  "dn6:4.6": "Sādhu, bhante, labhataṁ esā janatā bhagavantaṁ dassanāyā”ti. ",
  "dn6:4.7": "“Tena hi, sīha, vihārapacchāyāyaṁ āsanaṁ paññapehī”ti. ",
  "dn6:4.8": "“Evaṁ, bhante”ti kho sīho samaṇuddeso bhagavato paṭissutvā vihārapacchāyāyaṁ āsanaṁ paññapesi. ",
  "dn6:4.9": "Atha kho bhagavā vihārā nikkhamma vihārapacchāyāyaṁ paññatte āsane nisīdi. ",
  "dn6:5.1": "Atha kho te kosalakā ca brāhmaṇadūtā māgadhakā ca brāhmaṇadūtā yena bhagavā tenupasaṅkamiṁsu; upasaṅkamitvā bhagavatā saddhiṁ sammodiṁsu. ",
  "dn6:5.2": "Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ nisīdiṁsu. ",
  "dn6:5.3": "Oṭṭhaddhopi licchavī mahatiyā licchavīparisāya saddhiṁ yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṁ abhivādetvā ekamantaṁ nisīdi. Ekamantaṁ nisinno kho oṭṭhaddho licchavī bhagavantaṁ etadavoca: “purimāni, bhante, divasāni purimatarāni sunakkhatto licchaviputto yenāhaṁ tenupasaṅkami; upasaṅkamitvā maṁ etadavoca: ",
  "dn6:5.4": "‘yadagge ahaṁ, mahāli, bhagavantaṁ upanissāya viharāmi, na ciraṁ tīṇi vassāni, dibbāni hi kho rūpāni passāmi piyarūpāni kāmūpasaṁhitāni rajanīyāni, no ca kho dibbāni saddāni suṇāmi piyarūpāni kāmūpasaṁhitāni rajanīyānī’ti. ",
  "dn6:5.5": "Santāneva nu kho, bhante, sunakkhatto licchaviputto dibbāni saddāni nāssosi piyarūpāni kāmūpasaṁhitāni rajanīyāni, udāhu asantānī”ti? ",
  "dn6:5.6.0": "2.1. Ekaṁsabhāvitasamādhi ",
  "dn6:5.7": "“Santāneva kho, mahāli, sunakkhatto licchaviputto dibbāni saddāni nāssosi piyarūpāni kāmūpasaṁhitāni rajanīyāni, no asantānī”ti. ",
  "dn6:6.1": "“Ko nu kho, bhante, hetu, ko paccayo, yena santāneva sunakkhatto licchaviputto dibbāni saddāni nāssosi piyarūpāni kāmūpasaṁhitāni rajanīyāni, no asantānī”ti? ",
  "dn6:6.2": "“Idha, mahāli, bhikkhuno puratthimāya disāya ekaṁsabhāvito samādhi hoti dibbānaṁ rūpānaṁ dassanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ, no ca kho dibbānaṁ saddānaṁ savanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ. ",
  "dn6:6.3": "So puratthimāya disāya ekaṁsabhāvite samādhimhi dibbānaṁ rūpānaṁ dassanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ, no ca kho dibbānaṁ saddānaṁ savanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ. ",
  "dn6:6.4": "Puratthimāya disāya dibbāni rūpāni passati piyarūpāni kāmūpasaṁhitāni rajanīyāni, no ca kho dibbāni saddāni suṇāti piyarūpāni kāmūpasaṁhitāni rajanīyāni. ",
  "dn6:6.5": "Taṁ kissa hetu? ",
  "dn6:6.6": "Evañhetaṁ, mahāli, hoti bhikkhuno puratthimāya disāya ekaṁsabhāvite samādhimhi dibbānaṁ rūpānaṁ dassanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ, no ca kho dibbānaṁ saddānaṁ savanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ. ",
  "dn6:7.1": "Puna caparaṁ, mahāli, bhikkhuno dakkhiṇāya disāya …pe… ",
  "dn6:7.2": "pacchimāya disāya … ",
  "dn6:7.3": "uttarāya disāya … ",
  "dn6:7.4": "uddhamadho tiriyaṁ ekaṁsabhāvito samādhi hoti dibbānaṁ rūpānaṁ dassanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ, no ca kho dibbānaṁ saddānaṁ savanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ. ",
  "dn6:7.5": "So uddhamadho tiriyaṁ ekaṁsabhāvite samādhimhi dibbānaṁ rūpānaṁ dassanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ, no ca kho dibbānaṁ saddānaṁ savanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ. ",
  "dn6:7.6": "Uddhamadho tiriyaṁ dibbāni rūpāni passati piyarūpāni kāmūpasaṁhitāni rajanīyāni, no ca kho dibbāni saddāni suṇāti piyarūpāni kāmūpasaṁhitāni rajanīyāni. ",
  "dn6:7.7": "Taṁ kissa hetu? ",
  "dn6:7.8": "Evañhetaṁ, mahāli, hoti bhikkhuno uddhamadho tiriyaṁ ekaṁsabhāvite samādhimhi dibbānaṁ rūpānaṁ dassanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ, no ca kho dibbānaṁ saddānaṁ savanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ. ",
  "dn6:8.1": "Idha, mahāli, bhikkhuno puratthimāya disāya ekaṁsabhāvito samādhi hoti dibbānaṁ saddānaṁ savanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ, no ca kho dibbānaṁ rūpānaṁ dassanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ. ",
  "dn6:8.2": "So puratthimāya disāya ekaṁsabhāvite samādhimhi dibbānaṁ saddānaṁ savanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ, no ca kho dibbānaṁ rūpānaṁ dassanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ. ",
  "dn6:8.3": "Puratthimāya disāya dibbāni saddāni suṇāti piyarūpāni kāmūpasaṁhitāni rajanīyāni, no ca kho dibbāni rūpāni passati piyarūpāni kāmūpasaṁhitāni rajanīyāni. ",
  "dn6:8.4": "Taṁ kissa hetu? ",
  "dn6:8.5": "Evañhetaṁ, mahāli, hoti bhikkhuno puratthimāya disāya ekaṁsabhāvite samādhimhi dibbānaṁ saddānaṁ savanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ, no ca kho dibbānaṁ rūpānaṁ dassanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ. ",
  "dn6:9.1": "Puna caparaṁ, mahāli, bhikkhuno dakkhiṇāya disāya …pe… ",
  "dn6:9.2": "pacchimāya disāya … ",
  "dn6:9.3": "uttarāya disāya … ",
  "dn6:9.4": "uddhamadho tiriyaṁ ekaṁsabhāvito samādhi hoti dibbānaṁ saddānaṁ savanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ, no ca kho dibbānaṁ rūpānaṁ dassanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ. ",
  "dn6:9.5": "So uddhamadho tiriyaṁ ekaṁsabhāvite samādhimhi dibbānaṁ saddānaṁ savanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ, no ca kho dibbānaṁ rūpānaṁ dassanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ. ",
  "dn6:9.6": "Uddhamadho tiriyaṁ dibbāni saddāni suṇāti piyarūpāni kāmūpasaṁhitāni rajanīyāni, no ca kho dibbāni rūpāni passati piyarūpāni kāmūpasaṁhitāni rajanīyāni. ",
  "dn6:9.7": "Taṁ kissa hetu? ",
  "dn6:9.8": "Evañhetaṁ, mahāli, hoti bhikkhuno uddhamadho tiriyaṁ ekaṁsabhāvite samādhimhi dibbānaṁ saddānaṁ savanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ, no ca kho dibbānaṁ rūpānaṁ dassanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ. ",
  "dn6:10.1": "Idha, mahāli, bhikkhuno puratthimāya disāya ubhayaṁsabhāvito samādhi hoti dibbānañca rūpānaṁ dassanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ dibbānañca saddānaṁ savanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ. ",
  "dn6:10.2": "So puratthimāya disāya ubhayaṁsabhāvite samādhimhi dibbānañca rūpānaṁ dassanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ, dibbānañca saddānaṁ savanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ. ",
  "dn6:10.3": "Puratthimāya disāya dibbāni ca rūpāni passati piyarūpāni kāmūpasaṁhitāni rajanīyāni, dibbāni ca saddāni suṇāti piyarūpāni kāmūpasaṁhitāni rajanīyāni. ",
  "dn6:10.4": "Taṁ kissa hetu? ",
  "dn6:10.5": "Evañhetaṁ, mahāli, hoti bhikkhuno puratthimāya disāya ubhayaṁsabhāvite samādhimhi dibbānañca rūpānaṁ dassanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ dibbānañca saddānaṁ savanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ. ",
  "dn6:11.1": "Puna caparaṁ, mahāli, bhikkhuno dakkhiṇāya disāya …pe… ",
  "dn6:11.2": "pacchimāya disāya … ",
  "dn6:11.3": "uttarāya disāya … ",
  "dn6:11.4": "uddhamadho tiriyaṁ ubhayaṁsabhāvito samādhi hoti dibbānañca rūpānaṁ dassanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ, dibbānañca saddānaṁ savanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ. ",
  "dn6:11.5": "So uddhamadho tiriyaṁ ubhayaṁsabhāvite samādhimhi dibbānañca rūpānaṁ dassanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ dibbānañca saddānaṁ savanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ. ",
  "dn6:11.6": "Uddhamadho tiriyaṁ dibbāni ca rūpāni passati piyarūpāni kāmūpasaṁhitāni rajanīyāni, dibbāni ca saddāni suṇāti piyarūpāni kāmūpasaṁhitāni rajanīyāni. ",
  "dn6:11.7": "Taṁ kissa hetu? ",
  "dn6:11.8": "Evañhetaṁ, mahāli, hoti bhikkhuno uddhamadho tiriyaṁ ubhayaṁsabhāvite samādhimhi dibbānañca rūpānaṁ dassanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ, dibbānañca saddānaṁ savanāya piyarūpānaṁ kāmūpasaṁhitānaṁ rajanīyānaṁ. ",
  "dn6:11.9": "Ayaṁ kho, mahāli, hetu ayaṁ paccayo, yena santāneva sunakkhatto licchaviputto dibbāni saddāni nāssosi piyarūpāni kāmūpasaṁhitāni rajanīyāni, no asantānī”ti. ",
  "dn6:12.1": "“Etāsaṁ nūna, bhante, samādhibhāvanānaṁ sacchikiriyāhetu bhikkhū bhagavati brahmacariyaṁ carantī”ti. ",
  "dn6:12.2": "“Na kho, mahāli, etāsaṁ samādhibhāvanānaṁ sacchikiriyāhetu bhikkhū mayi brahmacariyaṁ caranti. ",
  "dn6:12.3": "Atthi kho, mahāli, aññeva dhammā uttaritarā ca paṇītatarā ca, yesaṁ sacchikiriyāhetu bhikkhū mayi brahmacariyaṁ carantī”ti. ",
  "dn6:13.0": "2.2. Catuariyaphala ",
  "dn6:13.1": "“Katame pana te, bhante, dhammā uttaritarā ca paṇītatarā ca, yesaṁ sacchikiriyāhetu bhikkhū bhagavati brahmacariyaṁ carantī”ti? ",
  "dn6:13.2": "“Idha, mahāli, bhikkhu tiṇṇaṁ saṁyojanānaṁ parikkhayā sotāpanno hoti avinipātadhammo niyato sambodhiparāyaṇo. ",
  "dn6:13.3": "Ayampi kho, mahāli, dhammo uttaritaro ca paṇītataro ca, yassa sacchikiriyāhetu bhikkhū mayi brahmacariyaṁ caranti. ",
  "dn6:13.4": "Puna caparaṁ, mahāli, bhikkhu tiṇṇaṁ saṁyojanānaṁ parikkhayā rāgadosamohānaṁ tanuttā sakadāgāmī hoti, sakideva imaṁ lokaṁ āgantvā dukkhassantaṁ karoti. ",
  "dn6:13.5": "Ayampi kho, mahāli, dhammo uttaritaro ca paṇītataro ca, yassa sacchikiriyāhetu bhikkhū mayi brahmacariyaṁ caranti. ",
  "dn6:13.6": "Puna caparaṁ, mahāli, bhikkhu pañcannaṁ orambhāgiyānaṁ saṁyojanānaṁ parikkhayā opapātiko hoti, tattha parinibbāyī, anāvattidhammo tasmā lokā. ",
  "dn6:13.7": "Ayampi kho, mahāli, dhammo uttaritaro ca paṇītataro ca, yassa sacchikiriyāhetu bhikkhū mayi brahmacariyaṁ caranti. ",
  "dn6:13.8": "Puna caparaṁ, mahāli, bhikkhu āsavānaṁ khayā anāsavaṁ cetovimuttiṁ paññāvimuttiṁ diṭṭheva dhamme sayaṁ abhiññā sacchikatvā upasampajja viharati. ",
  "dn6:13.9": "Ayampi kho, mahāli, dhammo uttaritaro ca paṇītataro ca, yassa sacchikiriyāhetu bhikkhū mayi brahmacariyaṁ caranti. ",
  "dn6:13.10": "Ime kho te, mahāli, dhammā uttaritarā ca paṇītatarā ca, yesaṁ sacchikiriyāhetu bhikkhū mayi brahmacariyaṁ carantī”ti. ",
  "dn6:14.0": "2.3. Ariyaaṭṭhaṅgikamagga ",
  "dn6:14.1": "“Atthi pana, bhante, maggo atthi paṭipadā etesaṁ dhammānaṁ sacchikiriyāyā”ti? ",
  "dn6:14.2": "“Atthi kho, mahāli, maggo atthi paṭipadā etesaṁ dhammānaṁ sacchikiriyāyā”ti. ",
  "dn6:14.3": "“Katamo pana, bhante, maggo katamā paṭipadā etesaṁ dhammānaṁ sacchikiriyāyā”ti? ",
  "dn6:14.4": "“Ayameva ariyo aṭṭhaṅgiko maggo. ",
  "dn6:14.5": "Seyyathidaṁ—sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhi. ",
  "dn6:14.6": "Ayaṁ kho, mahāli, maggo ayaṁ paṭipadā etesaṁ dhammānaṁ sacchikiriyāya. ",
  "dn6:15.0": "2.4. Dvepabbajitavatthu ",
  "dn6:15.1": "Ekamidāhaṁ, mahāli, samayaṁ kosambiyaṁ viharāmi ghositārāme. ",
  "dn6:15.2": "Atha kho dve pabbajitā—",
  "dn6:15.3": "muṇḍiyo ca paribbājako jāliyo ca dārupattikantevāsī yenāhaṁ tenupasaṅkamiṁsu. upasaṅkamitvā mayā saddhiṁ sammodiṁsu. ",
  "dn6:15.4": "Sammodanīyaṁ kathaṁ sāraṇīyaṁ vītisāretvā ekamantaṁ aṭṭhaṁsu. Ekamantaṁ ṭhitā kho te dve pabbajitā maṁ etadavocuṁ: ",
  "dn6:15.5": "‘kiṁ nu kho, āvuso gotama, taṁ jīvaṁ taṁ sarīraṁ, udāhu aññaṁ jīvaṁ aññaṁ sarīran’ti? ",
  "dn6:16.1": "‘Tena hāvuso, suṇātha sādhukaṁ manasi karotha bhāsissāmī’ti. ",
  "dn6:16.2": "‘Evamāvuso’ti kho te dve pabbajitā mama paccassosuṁ. ",
  "dn6:16.3": "Ahaṁ etadavocaṁ: ",
  "dn6:16.4": "“idha, mahārāja, tathāgato loke uppajjati arahaṁ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṁ buddho bhagavā. ",
  "dn6:16.4.1.2": "So imaṁ lokaṁ sadevakaṁ samārakaṁ sabrahmakaṁ sassamaṇabrāhmaṇiṁ pajaṁ sadevamanussaṁ sayaṁ abhiññā sacchikatvā pavedeti. ",
  "dn6:16.4.1.3": "So dhammaṁ deseti ādikalyāṇaṁ majjhekalyāṇaṁ pariyosānakalyāṇaṁ sātthaṁ sabyañjanaṁ, kevalaparipuṇṇaṁ parisuddhaṁ brahmacariyaṁ pakāseti. ",
  "dn6:16.4.2.1": "Taṁ dhammaṁ suṇāti gahapati vā gahapatiputto vā aññatarasmiṁ vā kule paccājāto. ",
  "dn6:16.4.2.2": "So taṁ dhammaṁ sutvā tathāgate saddhaṁ paṭilabhati. ",
  "dn6:16.4.2.3": "So tena saddhāpaṭilābhena samannāgato iti paṭisañcikkhati: ",
  "dn6:16.4.2.4": "‘sambādho gharāvāso rajopatho, abbhokāso pabbajjā. ",
  "dn6:16.4.2.5": "Nayidaṁ sukaraṁ agāraṁ ajjhāvasatā ekantaparipuṇṇaṁ ekantaparisuddhaṁ saṅkhalikhitaṁ brahmacariyaṁ carituṁ. ",
  "dn6:16.4.2.6": "Yannūnāhaṁ kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajeyyan’ti. ",
  "dn6:16.4.2.7": "So aparena samayena appaṁ vā bhogakkhandhaṁ pahāya mahantaṁ vā bhogakkhandhaṁ pahāya appaṁ vā ñātiparivaṭṭaṁ pahāya mahantaṁ vā ñātiparivaṭṭaṁ pahāya kesamassuṁ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṁ pabbajati. ",
  "dn6:16.4.3.1": "So evaṁ pabbajito samāno pātimokkhasaṁvarasaṁvuto viharati ācāragocarasampanno, aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu, kāyakammavacīkammena samannāgato kusalena, parisuddhājīvo sīlasampanno, indriyesu guttadvāro, satisampajaññena samannāgato, santuṭṭho. ",
  "dn6:16.4.4.0.1": "2.4.1. Sīla ",
  "dn6:16.4.4.0.2": "2.4.1.1. Cūḷasīla ",
  "dn6:16.4.4.1": "Kathañca, mahārāja, bhikkhu sīlasampanno hoti? ",
  "dn6:16.4.4.2": "Idha, mahārāja, bhikkhu pāṇātipātaṁ pahāya pāṇātipātā paṭivirato hoti. Nihitadaṇḍo nihitasattho lajjī dayāpanno sabbapāṇabhūtahitānukampī viharati. ",
  "dn6:16.4.4.3": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.4.4": "Adinnādānaṁ pahāya adinnādānā paṭivirato hoti dinnādāyī dinnapāṭikaṅkhī, athenena sucibhūtena attanā viharati. ",
  "dn6:16.4.4.5": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.4.6": "Abrahmacariyaṁ pahāya brahmacārī hoti ārācārī virato methunā gāmadhammā. ",
  "dn6:16.4.4.7": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.5.1": "Musāvādaṁ pahāya musāvādā paṭivirato hoti saccavādī saccasandho theto paccayiko avisaṁvādako lokassa. ",
  "dn6:16.4.5.2": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.5.3": "Pisuṇaṁ vācaṁ pahāya pisuṇāya vācāya paṭivirato hoti; ito sutvā na amutra akkhātā imesaṁ bhedāya; amutra vā sutvā na imesaṁ akkhātā, amūsaṁ bhedāya. Iti bhinnānaṁ vā sandhātā, sahitānaṁ vā anuppadātā, samaggārāmo samaggarato samagganandī samaggakaraṇiṁ vācaṁ bhāsitā hoti. ",
  "dn6:16.4.5.4": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.5.5": "Pharusaṁ vācaṁ pahāya pharusāya vācāya paṭivirato hoti; yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā tathārūpiṁ vācaṁ bhāsitā hoti. ",
  "dn6:16.4.5.6": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.5.7": "Samphappalāpaṁ pahāya samphappalāpā paṭivirato hoti kālavādī bhūtavādī atthavādī dhammavādī vinayavādī, nidhānavatiṁ vācaṁ bhāsitā hoti kālena sāpadesaṁ pariyantavatiṁ atthasaṁhitaṁ. ",
  "dn6:16.4.5.8": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.6.1": "Bījagāmabhūtagāmasamārambhā paṭivirato hoti …pe… ",
  "dn6:16.4.6.2": "ekabhattiko hoti rattūparato virato vikālabhojanā. ",
  "dn6:16.4.6.3": "Naccagītavāditavisūkadassanā paṭivirato hoti. ",
  "dn6:16.4.6.4": "Mālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānā paṭivirato hoti. ",
  "dn6:16.4.6.5": "Uccāsayanamahāsayanā paṭivirato hoti. ",
  "dn6:16.4.6.6": "Jātarūparajatapaṭiggahaṇā paṭivirato hoti. ",
  "dn6:16.4.6.7": "Āmakadhaññapaṭiggahaṇā paṭivirato hoti. ",
  "dn6:16.4.6.8": "Āmakamaṁsapaṭiggahaṇā paṭivirato hoti. ",
  "dn6:16.4.6.9": "Itthikumārikapaṭiggahaṇā paṭivirato hoti. ",
  "dn6:16.4.6.10": "Dāsidāsapaṭiggahaṇā paṭivirato hoti. ",
  "dn6:16.4.6.11": "Ajeḷakapaṭiggahaṇā paṭivirato hoti. ",
  "dn6:16.4.6.12": "Kukkuṭasūkarapaṭiggahaṇā paṭivirato hoti. ",
  "dn6:16.4.6.13": "Hatthigavassavaḷavapaṭiggahaṇā paṭivirato hoti. ",
  "dn6:16.4.6.14": "Khettavatthupaṭiggahaṇā paṭivirato hoti. ",
  "dn6:16.4.6.15": "Dūteyyapahiṇagamanānuyogā paṭivirato hoti. ",
  "dn6:16.4.6.16": "Kayavikkayā paṭivirato hoti. ",
  "dn6:16.4.6.17": "Tulākūṭakaṁsakūṭamānakūṭā paṭivirato hoti. ",
  "dn6:16.4.6.18": "Ukkoṭanavañcananikatisāciyogā paṭivirato hoti. ",
  "dn6:16.4.6.19": "Chedanavadhabandhanaviparāmosaālopasahasākārā paṭivirato hoti. ",
  "dn6:16.4.6.20": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.6.21": "Cūḷasīlaṁ niṭṭhitaṁ. ",
  "dn6:16.4.7.0": "2.4.1.2. Majjhimasīla ",
  "dn6:16.4.7.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ bījagāmabhūtagāmasamārambhaṁ anuyuttā viharanti. ",
  "dn6:16.4.7.2": "Seyyathidaṁ—mūlabījaṁ khandhabījaṁ phaḷubījaṁ aggabījaṁ bījabījameva pañcamaṁ, iti evarūpā bījagāmabhūtagāmasamārambhā paṭivirato hoti. ",
  "dn6:16.4.7.3": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.8.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ sannidhikāraparibhogaṁ anuyuttā viharanti. ",
  "dn6:16.4.8.2": "Seyyathidaṁ—annasannidhiṁ pānasannidhiṁ vatthasannidhiṁ yānasannidhiṁ sayanasannidhiṁ gandhasannidhiṁ āmisasannidhiṁ, ",
  "dn6:16.4.8.3": "iti vā iti evarūpā sannidhikāraparibhogā paṭivirato hoti. ",
  "dn6:16.4.8.4": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.9.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ visūkadassanaṁ anuyuttā viharanti. ",
  "dn6:16.4.9.2": "Seyyathidaṁ—naccaṁ gītaṁ vāditaṁ pekkhaṁ akkhānaṁ pāṇissaraṁ vetāḷaṁ kumbhathūṇaṁ sobhanakaṁ caṇḍālaṁ vaṁsaṁ dhovanaṁ hatthiyuddhaṁ assayuddhaṁ mahiṁsayuddhaṁ usabhayuddhaṁ ajayuddhaṁ meṇḍayuddhaṁ kukkuṭayuddhaṁ vaṭṭakayuddhaṁ daṇḍayuddhaṁ muṭṭhiyuddhaṁ nibbuddhaṁ uyyodhikaṁ balaggaṁ senābyūhaṁ anīkadassanaṁ ",
  "dn6:16.4.9.3": "iti vā iti evarūpā visūkadassanā paṭivirato hoti. ",
  "dn6:16.4.9.4": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.10.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ jūtappamādaṭṭhānānuyogaṁ anuyuttā viharanti. ",
  "dn6:16.4.10.2": "Seyyathidaṁ—aṭṭhapadaṁ dasapadaṁ ākāsaṁ parihārapathaṁ santikaṁ khalikaṁ ghaṭikaṁ salākahatthaṁ akkhaṁ paṅgacīraṁ vaṅkakaṁ mokkhacikaṁ ciṅgulikaṁ pattāḷhakaṁ rathakaṁ dhanukaṁ akkharikaṁ manesikaṁ yathāvajjaṁ ",
  "dn6:16.4.10.3": "iti vā iti evarūpā jūtappamādaṭṭhānānuyogā paṭivirato hoti. ",
  "dn6:16.4.10.4": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.11.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ uccāsayanamahāsayanaṁ anuyuttā viharanti. ",
  "dn6:16.4.11.2": "Seyyathidaṁ—āsandiṁ pallaṅkaṁ gonakaṁ cittakaṁ paṭikaṁ paṭalikaṁ tūlikaṁ vikatikaṁ uddalomiṁ ekantalomiṁ kaṭṭissaṁ koseyyaṁ kuttakaṁ hatthattharaṁ assattharaṁ rathattharaṁ ajinappaveṇiṁ kadalimigapavarapaccattharaṇaṁ sauttaracchadaṁ ubhatolohitakūpadhānaṁ ",
  "dn6:16.4.11.3": "iti vā iti evarūpā uccāsayanamahāsayanā paṭivirato hoti. ",
  "dn6:16.4.11.4": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.12.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ maṇḍanavibhūsanaṭṭhānānuyogaṁ anuyuttā viharanti. ",
  "dn6:16.4.12.2": "Seyyathidaṁ—ucchādanaṁ parimaddanaṁ nhāpanaṁ sambāhanaṁ ādāsaṁ añjanaṁ mālāgandhavilepanaṁ mukhacuṇṇaṁ mukhalepanaṁ hatthabandhaṁ sikhābandhaṁ daṇḍaṁ nāḷikaṁ asiṁ chattaṁ citrupāhanaṁ uṇhīsaṁ maṇiṁ vālabījaniṁ odātāni vatthāni dīghadasāni ",
  "dn6:16.4.12.3": "iti vā iti evarūpā maṇḍanavibhūsanaṭṭhānānuyogā paṭivirato hoti. ",
  "dn6:16.4.12.4": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.13.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ tiracchānakathaṁ anuyuttā viharanti. ",
  "dn6:16.4.13.2": "Seyyathidaṁ—rājakathaṁ corakathaṁ mahāmattakathaṁ senākathaṁ bhayakathaṁ yuddhakathaṁ annakathaṁ pānakathaṁ vatthakathaṁ sayanakathaṁ mālākathaṁ gandhakathaṁ ñātikathaṁ yānakathaṁ gāmakathaṁ nigamakathaṁ nagarakathaṁ janapadakathaṁ itthikathaṁ sūrakathaṁ visikhākathaṁ kumbhaṭṭhānakathaṁ pubbapetakathaṁ nānattakathaṁ lokakkhāyikaṁ samuddakkhāyikaṁ itibhavābhavakathaṁ ",
  "dn6:16.4.13.3": "iti vā iti evarūpāya tiracchānakathāya paṭivirato hoti. ",
  "dn6:16.4.13.4": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.14.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ viggāhikakathaṁ anuyuttā viharanti. ",
  "dn6:16.4.14.2": "Seyyathidaṁ—na tvaṁ imaṁ dhammavinayaṁ ājānāsi, ahaṁ imaṁ dhammavinayaṁ ājānāmi, kiṁ tvaṁ imaṁ dhammavinayaṁ ājānissasi, micchā paṭipanno tvamasi, ahamasmi sammā paṭipanno, sahitaṁ me, asahitaṁ te, pure vacanīyaṁ pacchā avaca, pacchā vacanīyaṁ pure avaca, adhiciṇṇaṁ te viparāvattaṁ, āropito te vādo, niggahito tvamasi, cara vādappamokkhāya, nibbeṭhehi vā sace pahosīti ",
  "dn6:16.4.14.3": "iti vā iti evarūpāya viggāhikakathāya paṭivirato hoti. ",
  "dn6:16.4.14.4": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.15.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṁ dūteyyapahiṇagamanānuyogaṁ anuyuttā viharanti. ",
  "dn6:16.4.15.2": "Seyyathidaṁ—raññaṁ, rājamahāmattānaṁ, khattiyānaṁ, brāhmaṇānaṁ, gahapatikānaṁ, kumārānaṁ—idha gaccha, amutrāgaccha, idaṁ hara, amutra idaṁ āharā’ti ",
  "dn6:16.4.15.3": "iti vā iti evarūpā dūteyyapahiṇagamanānuyogā paṭivirato hoti. ",
  "dn6:16.4.15.4": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.16.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te kuhakā ca honti lapakā ca nemittikā ca nippesikā ca lābhena lābhaṁ nijigīsitāro ca. Iti evarūpā kuhanalapanā paṭivirato hoti. ",
  "dn6:16.4.16.2": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.16.3": "Majjhimasīlaṁ niṭṭhitaṁ. ",
  "dn6:16.4.17.0": "2.4.1.3. Mahāsīla ",
  "dn6:16.4.17.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn6:16.4.17.2": "Seyyathidaṁ—aṅgaṁ nimittaṁ uppātaṁ supinaṁ lakkhaṇaṁ mūsikacchinnaṁ aggihomaṁ dabbihomaṁ thusahomaṁ kaṇahomaṁ taṇḍulahomaṁ sappihomaṁ telahomaṁ mukhahomaṁ lohitahomaṁ aṅgavijjā vatthuvijjā khattavijjā sivavijjā bhūtavijjā bhūrivijjā ahivijjā visavijjā vicchikavijjā mūsikavijjā sakuṇavijjā vāyasavijjā pakkajjhānaṁ saraparittāṇaṁ migacakkaṁ ",
  "dn6:16.4.17.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn6:16.4.17.4": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.18.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn6:16.4.18.2": "Seyyathidaṁ—maṇilakkhaṇaṁ vatthalakkhaṇaṁ daṇḍalakkhaṇaṁ satthalakkhaṇaṁ asilakkhaṇaṁ usulakkhaṇaṁ dhanulakkhaṇaṁ āvudhalakkhaṇaṁ itthilakkhaṇaṁ purisalakkhaṇaṁ kumāralakkhaṇaṁ kumārilakkhaṇaṁ dāsalakkhaṇaṁ dāsilakkhaṇaṁ hatthilakkhaṇaṁ assalakkhaṇaṁ mahiṁsalakkhaṇaṁ usabhalakkhaṇaṁ golakkhaṇaṁ ajalakkhaṇaṁ meṇḍalakkhaṇaṁ kukkuṭalakkhaṇaṁ vaṭṭakalakkhaṇaṁ godhālakkhaṇaṁ kaṇṇikalakkhaṇaṁ kacchapalakkhaṇaṁ migalakkhaṇaṁ ",
  "dn6:16.4.18.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn6:16.4.18.4": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.19.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn6:16.4.19.2": "Seyyathidaṁ—raññaṁ niyyānaṁ bhavissati, raññaṁ aniyyānaṁ bhavissati, abbhantarānaṁ raññaṁ upayānaṁ bhavissati, bāhirānaṁ raññaṁ apayānaṁ bhavissati, bāhirānaṁ raññaṁ upayānaṁ bhavissati, abbhantarānaṁ raññaṁ apayānaṁ bhavissati, abbhantarānaṁ raññaṁ jayo bhavissati, bāhirānaṁ raññaṁ parājayo bhavissati, bāhirānaṁ raññaṁ jayo bhavissati, abbhantarānaṁ raññaṁ parājayo bhavissati, iti imassa jayo bhavissati, imassa parājayo bhavissati ",
  "dn6:16.4.19.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn6:16.4.19.4": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.20.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn6:16.4.20.2": "Seyyathidaṁ—candaggāho bhavissati, sūriyaggāho bhavissati, nakkhattaggāho bhavissati, candimasūriyānaṁ pathagamanaṁ bhavissati, candimasūriyānaṁ uppathagamanaṁ bhavissati, nakkhattānaṁ pathagamanaṁ bhavissati, nakkhattānaṁ uppathagamanaṁ bhavissati, ukkāpāto bhavissati, disāḍāho bhavissati, bhūmicālo bhavissati, devadudrabhi bhavissati, candimasūriyanakkhattānaṁ uggamanaṁ ogamanaṁ saṅkilesaṁ vodānaṁ bhavissati, evaṁvipāko candaggāho bhavissati, evaṁvipāko sūriyaggāho bhavissati, evaṁvipāko nakkhattaggāho bhavissati, evaṁvipākaṁ candimasūriyānaṁ pathagamanaṁ bhavissati, evaṁvipākaṁ candimasūriyānaṁ uppathagamanaṁ bhavissati, evaṁvipākaṁ nakkhattānaṁ pathagamanaṁ bhavissati, evaṁvipākaṁ nakkhattānaṁ uppathagamanaṁ bhavissati, evaṁvipāko ukkāpāto bhavissati, evaṁvipāko disāḍāho bhavissati, evaṁvipāko bhūmicālo bhavissati, evaṁvipāko devadudrabhi bhavissati, evaṁvipākaṁ candimasūriyanakkhattānaṁ uggamanaṁ ogamanaṁ saṅkilesaṁ vodānaṁ bhavissati ",
  "dn6:16.4.20.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn6:16.4.20.4": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.21.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn6:16.4.21.2": "Seyyathidaṁ—suvuṭṭhikā bhavissati, dubbuṭṭhikā bhavissati, subhikkhaṁ bhavissati, dubbhikkhaṁ bhavissati, khemaṁ bhavissati, bhayaṁ bhavissati, rogo bhavissati, ārogyaṁ bhavissati, muddā, gaṇanā, saṅkhānaṁ, kāveyyaṁ, lokāyataṁ ",
  "dn6:16.4.21.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn6:16.4.21.4": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.22.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn6:16.4.22.2": "Seyyathidaṁ—āvāhanaṁ vivāhanaṁ saṁvaraṇaṁ vivaraṇaṁ saṅkiraṇaṁ vikiraṇaṁ subhagakaraṇaṁ dubbhagakaraṇaṁ viruddhagabbhakaraṇaṁ jivhānibandhanaṁ hanusaṁhananaṁ hatthābhijappanaṁ hanujappanaṁ kaṇṇajappanaṁ ādāsapañhaṁ kumārikapañhaṁ devapañhaṁ ādiccupaṭṭhānaṁ mahatupaṭṭhānaṁ abbhujjalanaṁ sirivhāyanaṁ ",
  "dn6:16.4.22.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn6:16.4.22.4": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.23.1": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṁ kappenti. ",
  "dn6:16.4.23.2": "Seyyathidaṁ—santikammaṁ paṇidhikammaṁ bhūtakammaṁ bhūrikammaṁ vassakammaṁ vossakammaṁ vatthukammaṁ vatthuparikammaṁ ācamanaṁ nhāpanaṁ juhanaṁ vamanaṁ virecanaṁ uddhaṁvirecanaṁ adhovirecanaṁ sīsavirecanaṁ kaṇṇatelaṁ nettatappanaṁ natthukammaṁ añjanaṁ paccañjanaṁ sālākiyaṁ sallakattiyaṁ dārakatikicchā, mūlabhesajjānaṁ anuppadānaṁ, osadhīnaṁ paṭimokkho ",
  "dn6:16.4.23.3": "iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. ",
  "dn6:16.4.23.4": "Idampissa hoti sīlasmiṁ. ",
  "dn6:16.4.24.1": "Sa kho so, mahārāja, bhikkhu evaṁ sīlasampanno na kutoci bhayaṁ samanupassati, yadidaṁ sīlasaṁvarato. ",
  "dn6:16.4.24.2": "Seyyathāpi, mahārāja, rājā khattiyo muddhābhisitto nihatapaccāmitto na kutoci bhayaṁ samanupassati, yadidaṁ paccatthikato; ",
  "dn6:16.4.24.3": "evameva kho, mahārāja, bhikkhu evaṁ sīlasampanno na kutoci bhayaṁ samanupassati, yadidaṁ sīlasaṁvarato. ",
  "dn6:16.4.24.4": "So iminā ariyena sīlakkhandhena samannāgato ajjhattaṁ anavajjasukhaṁ paṭisaṁvedeti. ",
  "dn6:16.5": "Evaṁ kho, mahārāja, bhikkhu sīlasampanno hoti. ",
  "dn6:16.5.1.6": "Mahāsīlaṁ niṭṭhitaṁ. ",
  "dn6:16.5.2.0.1": "4.3.2. Samādhi ",
  "dn6:16.5.2.0.2": "4.3.2.1. Indriyasaṁvara ",
  "dn6:16.5.2.1": "Kathañca, mahārāja, bhikkhu indriyesu guttadvāro hoti? ",
  "dn6:16.5.2.2": "Idha, mahārāja, bhikkhu cakkhunā rūpaṁ disvā na nimittaggāhī hoti nānubyañjanaggāhī. ",
  "dn6:16.5.2.3": "Yatvādhikaraṇamenaṁ cakkhundriyaṁ asaṁvutaṁ viharantaṁ abhijjhā domanassā pāpakā akusalā dhammā anvāssaveyyuṁ, tassa saṁvarāya paṭipajjati, rakkhati cakkhundriyaṁ, cakkhundriye saṁvaraṁ āpajjati. ",
  "dn6:16.5.2.4": "Sotena saddaṁ sutvā …pe… ",
  "dn6:16.5.2.5": "ghānena gandhaṁ ghāyitvā …pe… ",
  "dn6:16.5.2.6": "jivhāya rasaṁ sāyitvā …pe… ",
  "dn6:16.5.2.7": "kāyena phoṭṭhabbaṁ phusitvā …pe… ",
  "dn6:16.5.2.8": "manasā dhammaṁ viññāya na nimittaggāhī hoti nānubyañjanaggāhī. ",
  "dn6:16.5.2.9": "Yatvādhikaraṇamenaṁ manindriyaṁ asaṁvutaṁ viharantaṁ abhijjhā domanassā pāpakā akusalā dhammā anvāssaveyyuṁ, tassa saṁvarāya paṭipajjati, rakkhati manindriyaṁ, manindriye saṁvaraṁ āpajjati. ",
  "dn6:16.5.2.10": "So iminā ariyena indriyasaṁvarena samannāgato ajjhattaṁ abyāsekasukhaṁ paṭisaṁvedeti. ",
  "dn6:16.5.2.11": "Evaṁ kho, mahārāja, bhikkhu indriyesu guttadvāro hoti. ",
  "dn6:16.5.3.0": "2.4.2.2. Satisampajañña ",
  "dn6:16.5.3.1": "Kathañca, mahārāja, bhikkhu satisampajaññena samannāgato hoti? ",
  "dn6:16.5.3.2": "Idha, mahārāja, bhikkhu abhikkante paṭikkante sampajānakārī hoti, ālokite vilokite sampajānakārī hoti, samiñjite pasārite sampajānakārī hoti, saṅghāṭipattacīvaradhāraṇe sampajānakārī hoti, asite pīte khāyite sāyite sampajānakārī hoti, uccārapassāvakamme sampajānakārī hoti, gate ṭhite nisinne sutte jāgarite bhāsite tuṇhībhāve sampajānakārī hoti. ",
  "dn6:16.5.3.3": "Evaṁ kho, mahārāja, bhikkhu satisampajaññena samannāgato hoti. ",
  "dn6:16.5.4.0": "4.3.2.3. Santosa ",
  "dn6:16.5.4.1": "Kathañca, mahārāja, bhikkhu santuṭṭho hoti? ",
  "dn6:16.5.4.2": "Idha, mahārāja, bhikkhu santuṭṭho hoti kāyaparihārikena cīvarena, kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati, samādāyeva pakkamati. ",
  "dn6:16.5.4.3": "Seyyathāpi, mahārāja, pakkhī sakuṇo yena yeneva ḍeti, sapattabhārova ḍeti; ",
  "dn6:16.5.4.4": "evameva kho, mahārāja, bhikkhu santuṭṭho hoti kāyaparihārikena cīvarena kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati, samādāyeva pakkamati. ",
  "dn6:16.5.4.5": "Evaṁ kho, mahārāja, bhikkhu santuṭṭho hoti. ",
  "dn6:16.6": "…pe… ",
  "dn6:16.6.1.0": "2.4.2.4. Nīvaraṇappahāna ",
  "dn6:16.6.1.1": "So iminā ca ariyena sīlakkhandhena samannāgato, iminā ca ariyena indriyasaṁvarena samannāgato, iminā ca ariyena satisampajaññena samannāgato, imāya ca ariyāya santuṭṭhiyā samannāgato, ",
  "dn6:16.6.1.2": "vivittaṁ senāsanaṁ bhajati araññaṁ rukkhamūlaṁ pabbataṁ kandaraṁ giriguhaṁ susānaṁ vanapatthaṁ abbhokāsaṁ palālapuñjaṁ. ",
  "dn6:16.6.1.3": "So pacchābhattaṁ piṇḍapātapaṭikkanto nisīdati pallaṅkaṁ ābhujitvā ujuṁ kāyaṁ paṇidhāya parimukhaṁ satiṁ upaṭṭhapetvā. ",
  "dn6:16.6.2.1": "So abhijjhaṁ loke pahāya vigatābhijjhena cetasā viharati, abhijjhāya cittaṁ parisodheti. ",
  "dn6:16.6.2.2": "Byāpādapadosaṁ pahāya abyāpannacitto viharati sabbapāṇabhūtahitānukampī, byāpādapadosā cittaṁ parisodheti. ",
  "dn6:16.6.2.3": "Thinamiddhaṁ pahāya vigatathinamiddho viharati ālokasaññī, sato sampajāno, thinamiddhā cittaṁ parisodheti. ",
  "dn6:16.6.2.4": "Uddhaccakukkuccaṁ pahāya anuddhato viharati, ajjhattaṁ vūpasantacitto, uddhaccakukkuccā cittaṁ parisodheti. ",
  "dn6:16.6.2.5": "Vicikicchaṁ pahāya tiṇṇavicikiccho viharati, akathaṅkathī kusalesu dhammesu, vicikicchāya cittaṁ parisodheti. ",
  "dn6:16.6.3.1": "Seyyathāpi, mahārāja, puriso iṇaṁ ādāya kammante payojeyya. ",
  "dn6:16.6.3.2": "Tassa te kammantā samijjheyyuṁ. ",
  "dn6:16.6.3.3": "So yāni ca porāṇāni iṇamūlāni, tāni ca byantiṁ kareyya, siyā cassa uttariṁ avasiṭṭhaṁ dārabharaṇāya. ",
  "dn6:16.6.3.4": "Tassa evamassa: ",
  "dn6:16.6.3.5": "‘ahaṁ kho pubbe iṇaṁ ādāya kammante payojesiṁ. ",
  "dn6:16.6.3.6": "Tassa me te kammantā samijjhiṁsu. ",
  "dn6:16.6.3.7": "Sohaṁ yāni ca porāṇāni iṇamūlāni, tāni ca byantiṁ akāsiṁ, atthi ca me uttariṁ avasiṭṭhaṁ dārabharaṇāyā’ti. ",
  "dn6:16.6.3.8": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn6:16.6.4.1": "Seyyathāpi, mahārāja, puriso ābādhiko assa dukkhito bāḷhagilāno; bhattañcassa nacchādeyya, na cassa kāye balamattā. ",
  "dn6:16.6.4.2": "So aparena samayena tamhā ābādhā mucceyya; bhattaṁ cassa chādeyya, siyā cassa kāye balamattā. ",
  "dn6:16.6.4.3": "Tassa evamassa: ",
  "dn6:16.6.4.4": "‘ahaṁ kho pubbe ābādhiko ahosiṁ dukkhito bāḷhagilāno; ",
  "dn6:16.6.4.5": "bhattañca me nacchādesi, na ca me āsi kāye balamattā. ",
  "dn6:16.6.4.6": "Somhi etarahi tamhā ābādhā mutto; ",
  "dn6:16.6.4.7": "bhattañca me chādeti, atthi ca me kāye balamattā’ti. ",
  "dn6:16.6.4.8": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn6:16.6.5.1": "Seyyathāpi, mahārāja, puriso bandhanāgāre baddho assa. ",
  "dn6:16.6.5.2": "So aparena samayena tamhā bandhanāgārā mucceyya sotthinā abbhayena, na cassa kiñci bhogānaṁ vayo. ",
  "dn6:16.6.5.3": "Tassa evamassa: ",
  "dn6:16.6.5.4": "‘ahaṁ kho pubbe bandhanāgāre baddho ahosiṁ, somhi etarahi tamhā bandhanāgārā mutto sotthinā abbhayena. ",
  "dn6:16.6.5.5": "Natthi ca me kiñci bhogānaṁ vayo’ti. ",
  "dn6:16.6.5.6": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn6:16.6.6.1": "Seyyathāpi, mahārāja, puriso dāso assa anattādhīno parādhīno na yenakāmaṅgamo. ",
  "dn6:16.6.6.2": "So aparena samayena tamhā dāsabyā mucceyya attādhīno aparādhīno bhujisso yenakāmaṅgamo. ",
  "dn6:16.6.6.3": "Tassa evamassa: ",
  "dn6:16.6.6.4": "‘ahaṁ kho pubbe dāso ahosiṁ anattādhīno parādhīno na yenakāmaṅgamo. ",
  "dn6:16.6.6.5": "Somhi etarahi tamhā dāsabyā mutto attādhīno aparādhīno bhujisso yenakāmaṅgamo’ti. ",
  "dn6:16.6.6.6": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn6:16.6.7.1": "Seyyathāpi, mahārāja, puriso sadhano sabhogo kantāraddhānamaggaṁ paṭipajjeyya dubbhikkhaṁ sappaṭibhayaṁ. ",
  "dn6:16.6.7.2": "So aparena samayena taṁ kantāraṁ nitthareyya sotthinā, gāmantaṁ anupāpuṇeyya khemaṁ appaṭibhayaṁ. ",
  "dn6:16.6.7.3": "Tassa evamassa: ",
  "dn6:16.6.7.4": "‘ahaṁ kho pubbe sadhano sabhogo kantāraddhānamaggaṁ paṭipajjiṁ dubbhikkhaṁ sappaṭibhayaṁ. ",
  "dn6:16.6.7.5": "Somhi etarahi taṁ kantāraṁ nitthiṇṇo sotthinā, gāmantaṁ anuppatto khemaṁ appaṭibhayan’ti. ",
  "dn6:16.6.7.6": "So tatonidānaṁ labhetha pāmojjaṁ, adhigaccheyya somanassaṁ. ",
  "dn6:16.6.8.1": "Evameva kho, mahārāja, bhikkhu yathā iṇaṁ yathā rogaṁ yathā bandhanāgāraṁ yathā dāsabyaṁ yathā kantāraddhānamaggaṁ, evaṁ ime pañca nīvaraṇe appahīne attani samanupassati. ",
  "dn6:16.6.8.2": "Seyyathāpi, mahārāja, yathā āṇaṇyaṁ yathā ārogyaṁ yathā bandhanāmokkhaṁ yathā bhujissaṁ yathā khemantabhūmiṁ; ",
  "dn6:16.6.8.3": "evameva kho, mahārāja, bhikkhu ime pañca nīvaraṇe pahīne attani samanupassati. ",
  "dn6:16.6.8.4": "Tassime pañca nīvaraṇe pahīne attani samanupassato pāmojjaṁ jāyati, pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṁ vedeti, sukhino cittaṁ samādhiyati. ",
  "dn6:16.6.9.0": "4.3.2.5. Paṭhamajhāna ",
  "dn6:16.7": "So vivicceva kāmehi, vivicca akusalehi dhammehi savitakkaṁ savicāraṁ vivekajaṁ pītisukhaṁ paṭhamaṁ jhānaṁ upasampajja viharati. ",
  "dn6:16.7.1.2": "So imameva kāyaṁ vivekajena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa vivekajena pītisukhena apphuṭaṁ hoti. ",
  "dn6:16.7.2.1": "Seyyathāpi, mahārāja, dakkho nhāpako vā nhāpakantevāsī vā kaṁsathāle nhānīyacuṇṇāni ākiritvā udakena paripphosakaṁ paripphosakaṁ sanneyya, sāyaṁ nhānīyapiṇḍi snehānugatā snehaparetā santarabāhirā phuṭā snehena, na ca paggharaṇī; ",
  "dn6:16.7.2.2": "evameva kho, mahārāja, bhikkhu imameva kāyaṁ vivekajena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa vivekajena pītisukhena apphuṭaṁ hoti. ",
  "dn6:16.8": "Yo kho, āvuso, bhikkhu evaṁ jānāti evaṁ passati, kallaṁ nu kho tassetaṁ vacanāya: ",
  "dn6:16.9": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vāti? ",
  "dn6:16.10": "Yo so, āvuso, bhikkhu evaṁ jānāti evaṁ passati, kallaṁ tassetaṁ vacanāya: ",
  "dn6:16.11": "‘taṁ jīvaṁ taṁ sarīran’ti vā, ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vāti. ",
  "dn6:16.12": "Ahaṁ kho panetaṁ, āvuso, evaṁ jānāmi evaṁ passāmi. ",
  "dn6:16.13": "Atha ca panāhaṁ na vadāmi: ",
  "dn6:16.14": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vā …pe… ",
  "dn6:16.14.1.0": "2.4.2.6. Dutiyajhāna ",
  "dn6:17.1": "Puna caparaṁ, mahārāja, bhikkhu vitakkavicārānaṁ vūpasamā ajjhattaṁ sampasādanaṁ cetaso ekodibhāvaṁ avitakkaṁ avicāraṁ samādhijaṁ pītisukhaṁ dutiyaṁ jhānaṁ upasampajja viharati. ",
  "dn6:17.1.1.2": "So imameva kāyaṁ samādhijena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa samādhijena pītisukhena apphuṭaṁ hoti. ",
  "dn6:17.1.2.1": "Seyyathāpi, mahārāja, udakarahado gambhīro ubbhidodako tassa nevassa puratthimāya disāya udakassa āyamukhaṁ, na dakkhiṇāya disāya udakassa āyamukhaṁ, na pacchimāya disāya udakassa āyamukhaṁ, na uttarāya disāya udakassa āyamukhaṁ, devo ca na kālena kālaṁ sammādhāraṁ anuppaveccheyya. ",
  "dn6:17.1.2.2": "Atha kho tamhāva udakarahadā sītā vāridhārā ubbhijjitvā tameva udakarahadaṁ sītena vārinā abhisandeyya parisandeyya paripūreyya paripphareyya, nāssa kiñci sabbāvato udakarahadassa sītena vārinā apphuṭaṁ assa. ",
  "dn6:17.1.2.3": "Evameva kho, mahārāja, bhikkhu imameva kāyaṁ samādhijena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa samādhijena pītisukhena apphuṭaṁ hoti. ",
  "dn6:17.1.2.4": "Yo kho, āvuso, bhikkhu evaṁ jānāti evaṁ passati, kallaṁ nu kho tassetaṁ vacanāya: ",
  "dn6:17.1.2.5": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vāti? ",
  "dn6:17.1.2.6": "Yo so, āvuso, bhikkhu evaṁ jānāti evaṁ passati, kallaṁ tassetaṁ vacanāya: ",
  "dn6:17.1.2.7": "‘taṁ jīvaṁ taṁ sarīran’ti vā, ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vāti. ",
  "dn6:17.1.2.8": "Ahaṁ kho panetaṁ, āvuso, evaṁ jānāmi evaṁ passāmi. ",
  "dn6:17.1.2.9": "Atha ca panāhaṁ na vadāmi: ",
  "dn6:17.1.2.10": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vā …pe… ",
  "dn6:17.1.3.0": "2.4.2.7. Tatiyajhāna ",
  "dn6:17.2": "Puna caparaṁ, mahārāja, bhikkhu pītiyā ca virāgā upekkhako ca viharati sato sampajāno, sukhañca kāyena paṭisaṁvedeti, yaṁ taṁ ariyā ācikkhanti: ‘upekkhako satimā sukhavihārī’ti, tatiyaṁ jhānaṁ upasampajja viharati. ",
  "dn6:17.2.1.2": "So imameva kāyaṁ nippītikena sukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa nippītikena sukhena apphuṭaṁ hoti. ",
  "dn6:17.2.2.1": "Seyyathāpi, mahārāja, uppaliniyaṁ vā paduminiyaṁ vā puṇḍarīkiniyaṁ vā appekaccāni uppalāni vā padumāni vā puṇḍarīkāni vā udake jātāni udake saṁvaḍḍhāni udakānuggatāni antonimuggaposīni, tāni yāva caggā yāva ca mūlā sītena vārinā abhisannāni parisannāni paripūrāni paripphuṭāni, nāssa kiñci sabbāvataṁ uppalānaṁ vā padumānaṁ vā puṇḍarīkānaṁ vā sītena vārinā apphuṭaṁ assa; ",
  "dn6:17.2.2.2": "evameva kho, mahārāja, bhikkhu imameva kāyaṁ nippītikena sukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa nippītikena sukhena apphuṭaṁ hoti. ",
  "dn6:17.2.2.3": "Yo kho, āvuso, bhikkhu evaṁ jānāti evaṁ passati, kallaṁ nu kho tassetaṁ vacanāya: ",
  "dn6:17.2.2.4": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vāti? ",
  "dn6:17.2.2.5": "Yo so, āvuso, bhikkhu evaṁ jānāti evaṁ passati, kallaṁ tassetaṁ vacanāya: ",
  "dn6:17.2.2.6": "‘taṁ jīvaṁ taṁ sarīran’ti vā, ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vāti. ",
  "dn6:17.2.2.7": "Ahaṁ kho panetaṁ, āvuso, evaṁ jānāmi evaṁ passāmi. ",
  "dn6:17.2.2.8": "Atha ca panāhaṁ na vadāmi: ",
  "dn6:17.2.2.9": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vā …pe… ",
  "dn6:17.2.3.0": "2.4.2.8. Catutthajhāna ",
  "dn6:17.3": "Puna caparaṁ, mahārāja, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā, pubbeva somanassadomanassānaṁ atthaṅgamā adukkhamasukhaṁ upekkhāsatipārisuddhiṁ catutthaṁ jhānaṁ upasampajja viharati. ",
  "dn6:17.3.1.2": "So imameva kāyaṁ parisuddhena cetasā pariyodātena pharitvā nisinno hoti, nāssa kiñci sabbāvato kāyassa parisuddhena cetasā pariyodātena apphuṭaṁ hoti. ",
  "dn6:17.3.2.1": "Seyyathāpi, mahārāja, puriso odātena vatthena sasīsaṁ pārupitvā nisinno assa, nāssa kiñci sabbāvato kāyassa odātena vatthena apphuṭaṁ assa; ",
  "dn6:17.3.2.2": "evameva kho, mahārāja, bhikkhu imameva kāyaṁ parisuddhena cetasā pariyodātena pharitvā nisinno hoti, nāssa kiñci sabbāvato kāyassa parisuddhena cetasā pariyodātena apphuṭaṁ hoti. ",
  "dn6:17.4": "Yo kho, āvuso, bhikkhu evaṁ jānāti evaṁ passati, kallaṁ nu kho tassetaṁ vacanāya: ",
  "dn6:17.5": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vāti? ",
  "dn6:17.6": "Yo so, āvuso, bhikkhu evaṁ jānāti evaṁ passati, kallaṁ tassetaṁ vacanāya: ",
  "dn6:17.7": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vāti. ",
  "dn6:17.8": "Ahaṁ kho panetaṁ, āvuso, evaṁ jānāmi evaṁ passāmi. ",
  "dn6:17.9": "Atha ca panāhaṁ na vadāmi: ",
  "dn6:17.10": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vā …pe… ",
  "dn6:17.10.1.0.1": "2.4.3. Aṭṭhañāṇa ",
  "dn6:17.10.1.0.2": "2.4.3.1. Vipassanāñāṇa ",
  "dn6:18.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte ñāṇadassanāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn6:18.1.1.2": "So evaṁ pajānāti: ",
  "dn6:18.1.1.3": "‘ayaṁ kho me kāyo rūpī cātumahābhūtiko mātāpettikasambhavo odanakummāsūpacayo aniccucchādanaparimaddanabhedanaviddhaṁsanadhammo; ",
  "dn6:18.1.1.4": "idañca pana me viññāṇaṁ ettha sitaṁ ettha paṭibaddhan’ti. ",
  "dn6:18.1.2.1": "Seyyathāpi, mahārāja, maṇi veḷuriyo subho jātimā aṭṭhaṁso suparikammakato accho vippasanno anāvilo sabbākārasampanno. ",
  "dn6:18.1.2.2": "Tatrāssa suttaṁ āvutaṁ nīlaṁ vā pītaṁ vā lohitaṁ vā odātaṁ vā paṇḍusuttaṁ vā. ",
  "dn6:18.1.2.3": "Tamenaṁ cakkhumā puriso hatthe karitvā paccavekkheyya: ",
  "dn6:18.1.2.4": "‘ayaṁ kho maṇi veḷuriyo subho jātimā aṭṭhaṁso suparikammakato accho vippasanno anāvilo sabbākārasampanno; ",
  "dn6:18.1.2.5": "tatridaṁ suttaṁ āvutaṁ nīlaṁ vā pītaṁ vā lohitaṁ vā odātaṁ vā paṇḍusuttaṁ vā’ti. ",
  "dn6:18.1.2.6": "Evameva kho, mahārāja, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte ñāṇadassanāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn6:18.1.2.7": "So evaṁ pajānāti: ",
  "dn6:18.1.2.8": "‘ayaṁ kho me kāyo rūpī cātumahābhūtiko mātāpettikasambhavo odanakummāsūpacayo aniccucchādanaparimaddanabhedanaviddhaṁsanadhammo; ",
  "dn6:18.1.2.9": "idañca pana me viññāṇaṁ ettha sitaṁ ettha paṭibaddhan’ti. ",
  "dn6:18.2": "yo kho, āvuso, bhikkhu evaṁ jānāti evaṁ passati, kallaṁ nu kho tassetaṁ vacanāya: ",
  "dn6:18.3": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vāti? ",
  "dn6:18.4": "…pe… ",
  "dn6:18.5": "Yo so, āvuso, bhikkhu evaṁ jānāti evaṁ passati, kallaṁ tassetaṁ vacanāya: ",
  "dn6:18.6": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vāti. ",
  "dn6:18.7": "Ahaṁ kho panetaṁ, āvuso, evaṁ jānāmi evaṁ passāmi. ",
  "dn6:18.8": "Atha ca panāhaṁ na vadāmi: ",
  "dn6:18.9": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vā. …pe… ",
  "dn6:18.9.1.0": "2.4.3.2. Manomayiddhiñāṇa ",
  "dn6:18.9.1.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte manomayaṁ kāyaṁ abhinimmānāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn6:18.9.1.2": "So imamhā kāyā aññaṁ kāyaṁ abhinimmināti rūpiṁ manomayaṁ sabbaṅgapaccaṅgiṁ ahīnindriyaṁ. ",
  "dn6:18.9.2.1": "Seyyathāpi, mahārāja, puriso muñjamhā īsikaṁ pavāheyya. ",
  "dn6:18.9.2.2": "Tassa evamassa: ",
  "dn6:18.9.2.3": "‘ayaṁ muñjo, ayaṁ īsikā, añño muñjo, aññā īsikā, muñjamhā tveva īsikā pavāḷhā’ti. ",
  "dn6:18.9.2.4": "Seyyathā vā pana, mahārāja, puriso asiṁ kosiyā pavāheyya. ",
  "dn6:18.9.2.5": "Tassa evamassa: ",
  "dn6:18.9.2.6": "‘ayaṁ asi, ayaṁ kosi, añño asi, aññā kosi, kosiyā tveva asi pavāḷho’ti. ",
  "dn6:18.9.2.7": "Seyyathā vā pana, mahārāja, puriso ahiṁ karaṇḍā uddhareyya. ",
  "dn6:18.9.2.8": "Tassa evamassa: ",
  "dn6:18.9.2.9": "‘ayaṁ ahi, ayaṁ karaṇḍo. Añño ahi, añño karaṇḍo, karaṇḍā tveva ahi ubbhato’ti. ",
  "dn6:18.9.2.10": "Evameva kho, mahārāja, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte manomayaṁ kāyaṁ abhinimmānāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn6:18.9.2.11": "So imamhā kāyā aññaṁ kāyaṁ abhinimmināti rūpiṁ manomayaṁ sabbaṅgapaccaṅgiṁ ahīnindriyaṁ. ",
  "dn6:18.9.2.12": "yo kho, āvuso, bhikkhu evaṁ jānāti evaṁ passati, kallaṁ nu kho tassetaṁ vacanāya: ",
  "dn6:18.9.2.13": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vāti? ",
  "dn6:18.9.2.14": "…pe… ",
  "dn6:18.9.2.15": "Yo so, āvuso, bhikkhu evaṁ jānāti evaṁ passati, kallaṁ tassetaṁ vacanāya: ",
  "dn6:18.9.2.16": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vāti. ",
  "dn6:18.9.2.17": "Ahaṁ kho panetaṁ, āvuso, evaṁ jānāmi evaṁ passāmi. ",
  "dn6:18.9.2.18": "Atha ca panāhaṁ na vadāmi: ",
  "dn6:18.9.2.19": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vā. …pe… ",
  "dn6:18.9.3.0": "2.4.3.3. Iddhividhañāṇa ",
  "dn6:18.9.3.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte iddhividhāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn6:18.9.3.2": "So anekavihitaṁ iddhividhaṁ paccanubhoti—ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti; āvibhāvaṁ tirobhāvaṁ tirokuṭṭaṁ tiropākāraṁ tiropabbataṁ asajjamāno gacchati seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṁ karoti seyyathāpi udake; udakepi abhijjamāne gacchati seyyathāpi pathaviyā; ākāsepi pallaṅkena kamati seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṁmahiddhike evaṁmahānubhāve pāṇinā parāmasati parimajjati; yāva brahmalokāpi kāyena vasaṁ vatteti. ",
  "dn6:18.9.4.1": "Seyyathāpi, mahārāja, dakkho kumbhakāro vā kumbhakārantevāsī vā suparikammakatāya mattikāya yaṁ yadeva bhājanavikatiṁ ākaṅkheyya, taṁ tadeva kareyya abhinipphādeyya. ",
  "dn6:18.9.4.2": "Seyyathā vā pana, mahārāja, dakkho dantakāro vā dantakārantevāsī vā suparikammakatasmiṁ dantasmiṁ yaṁ yadeva dantavikatiṁ ākaṅkheyya, taṁ tadeva kareyya abhinipphādeyya. ",
  "dn6:18.9.4.3": "Seyyathā vā pana, mahārāja, dakkho suvaṇṇakāro vā suvaṇṇakārantevāsī vā suparikammakatasmiṁ suvaṇṇasmiṁ yaṁ yadeva suvaṇṇavikatiṁ ākaṅkheyya, taṁ tadeva kareyya abhinipphādeyya. ",
  "dn6:18.9.4.4": "Evameva kho, mahārāja, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte iddhividhāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn6:18.9.4.5": "So anekavihitaṁ iddhividhaṁ paccanubhoti—ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti; āvibhāvaṁ tirobhāvaṁ tirokuṭṭaṁ tiropākāraṁ tiropabbataṁ asajjamāno gacchati seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṁ karoti seyyathāpi udake; udakepi abhijjamāne gacchati seyyathāpi pathaviyā; ākāsepi pallaṅkena kamati seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṁmahiddhike evaṁmahānubhāve pāṇinā parāmasati parimajjati; yāva brahmalokāpi kāyena vasaṁ vatteti. ",
  "dn6:18.9.4.6": "yo kho, āvuso, bhikkhu evaṁ jānāti evaṁ passati, kallaṁ nu kho tassetaṁ vacanāya: ",
  "dn6:18.9.4.7": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vāti? ",
  "dn6:18.9.4.8": "…pe… ",
  "dn6:18.9.4.9": "Yo so, āvuso, bhikkhu evaṁ jānāti evaṁ passati, kallaṁ tassetaṁ vacanāya: ",
  "dn6:18.9.4.10": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vāti. ",
  "dn6:18.9.4.11": "Ahaṁ kho panetaṁ, āvuso, evaṁ jānāmi evaṁ passāmi. ",
  "dn6:18.9.4.12": "Atha ca panāhaṁ na vadāmi: ",
  "dn6:18.9.4.13": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vā. …pe… ",
  "dn6:18.9.5.0": "2.4.3.4. Dibbasotañāṇa ",
  "dn6:18.9.5.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte dibbāya sotadhātuyā cittaṁ abhinīharati abhininnāmeti. ",
  "dn6:18.9.5.2": "So dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇāti dibbe ca mānuse ca ye dūre santike ca. ",
  "dn6:18.9.6.1": "Seyyathāpi, mahārāja, puriso addhānamaggappaṭipanno. So suṇeyya bherisaddampi mudiṅgasaddampi saṅkhapaṇavadindimasaddampi. Tassa evamassa: ‘bherisaddo’ itipi, ‘mudiṅgasaddo’ itipi, ‘saṅkhapaṇavadindimasaddo’ itipi. ",
  "dn6:18.9.6.2": "Evameva kho, mahārāja, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte dibbāya sotadhātuyā cittaṁ abhinīharati abhininnāmeti. ",
  "dn6:18.9.6.3": "So dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇāti dibbe ca mānuse ca ye dūre santike ca. ",
  "dn6:18.9.6.4": "yo kho, āvuso, bhikkhu evaṁ jānāti evaṁ passati, kallaṁ nu kho tassetaṁ vacanāya: ",
  "dn6:18.9.6.5": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vāti? ",
  "dn6:18.9.6.6": "…pe… ",
  "dn6:18.9.6.7": "Yo so, āvuso, bhikkhu evaṁ jānāti evaṁ passati, kallaṁ tassetaṁ vacanāya: ",
  "dn6:18.9.6.8": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vāti. ",
  "dn6:18.9.6.9": "Ahaṁ kho panetaṁ, āvuso, evaṁ jānāmi evaṁ passāmi. ",
  "dn6:18.9.6.10": "Atha ca panāhaṁ na vadāmi: ",
  "dn6:18.9.6.11": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vā. …pe… ",
  "dn6:18.9.7.0": "2.4.3.5. Cetopariyañāṇa ",
  "dn6:18.9.7.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte cetopariyañāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn6:18.9.7.2": "So parasattānaṁ parapuggalānaṁ cetasā ceto paricca pajānāti—",
  "dn6:18.9.7.3": "sarāgaṁ vā cittaṁ ‘sarāgaṁ cittan’ti pajānāti, ",
  "dn6:18.9.7.4": "vītarāgaṁ vā cittaṁ ‘vītarāgaṁ cittan’ti pajānāti, ",
  "dn6:18.9.7.5": "sadosaṁ vā cittaṁ ‘sadosaṁ cittan’ti pajānāti, ",
  "dn6:18.9.7.6": "vītadosaṁ vā cittaṁ ‘vītadosaṁ cittan’ti pajānāti, ",
  "dn6:18.9.7.7": "samohaṁ vā cittaṁ ‘samohaṁ cittan’ti pajānāti, ",
  "dn6:18.9.7.8": "vītamohaṁ vā cittaṁ ‘vītamohaṁ cittan’ti pajānāti, ",
  "dn6:18.9.7.9": "saṅkhittaṁ vā cittaṁ ‘saṅkhittaṁ cittan’ti pajānāti, ",
  "dn6:18.9.7.10": "vikkhittaṁ vā cittaṁ ‘vikkhittaṁ cittan’ti pajānāti, ",
  "dn6:18.9.7.11": "mahaggataṁ vā cittaṁ ‘mahaggataṁ cittan’ti pajānāti, ",
  "dn6:18.9.7.12": "amahaggataṁ vā cittaṁ ‘amahaggataṁ cittan’ti pajānāti, ",
  "dn6:18.9.7.13": "sauttaraṁ vā cittaṁ ‘sauttaraṁ cittan’ti pajānāti, ",
  "dn6:18.9.7.14": "anuttaraṁ vā cittaṁ ‘anuttaraṁ cittan’ti pajānāti, ",
  "dn6:18.9.7.15": "samāhitaṁ vā cittaṁ ‘samāhitaṁ cittan’ti pajānāti, ",
  "dn6:18.9.7.16": "asamāhitaṁ vā cittaṁ ‘asamāhitaṁ cittan’ti pajānāti, ",
  "dn6:18.9.7.17": "vimuttaṁ vā cittaṁ ‘vimuttaṁ cittan’ti pajānāti, ",
  "dn6:18.9.7.18": "avimuttaṁ vā cittaṁ ‘avimuttaṁ cittan’ti pajānāti. ",
  "dn6:18.9.8.1": "Seyyathāpi, mahārāja, itthī vā puriso vā daharo yuvā maṇḍanajātiko ādāse vā parisuddhe pariyodāte acche vā udakapatte sakaṁ mukhanimittaṁ paccavekkhamāno sakaṇikaṁ vā ‘sakaṇikan’ti jāneyya, akaṇikaṁ vā ‘akaṇikan’ti jāneyya; ",
  "dn6:18.9.8.2": "evameva kho, mahārāja, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte cetopariyañāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn6:18.9.8.3": "So parasattānaṁ parapuggalānaṁ cetasā ceto paricca pajānāti—",
  "dn6:18.9.8.4": "yo kho, āvuso, bhikkhu evaṁ jānāti evaṁ passati, kallaṁ nu kho tassetaṁ vacanāya: ",
  "dn6:18.9.8.5": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vāti? ",
  "dn6:18.9.8.6": "…pe… ",
  "dn6:18.9.8.7": "Yo so, āvuso, bhikkhu evaṁ jānāti evaṁ passati, kallaṁ tassetaṁ vacanāya: ",
  "dn6:18.9.8.8": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vāti. ",
  "dn6:18.9.8.9": "Ahaṁ kho panetaṁ, āvuso, evaṁ jānāmi evaṁ passāmi. ",
  "dn6:18.9.8.10": "Atha ca panāhaṁ na vadāmi: ",
  "dn6:18.9.8.11": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vā. …pe… ",
  "dn6:18.9.9.0": "2.4.3.6. Pubbenivāsānussatiñāṇa ",
  "dn6:18.9.9.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn6:18.9.9.2": "So anekavihitaṁ pubbenivāsaṁ anussarati, seyyathidaṁ—ekampi jātiṁ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṁsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṁvaṭṭakappe anekepi vivaṭṭakappe anekepi saṁvaṭṭavivaṭṭakappe, ‘amutrāsiṁ evaṁnāmo evaṅgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhappaṭisaṁvedī evamāyupariyanto, so tato cuto amutra udapādiṁ; tatrāpāsiṁ evaṁnāmo evaṅgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhappaṭisaṁvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṁ sauddesaṁ anekavihitaṁ pubbenivāsaṁ anussarati. ",
  "dn6:18.9.10.1": "Seyyathāpi, mahārāja, puriso sakamhā gāmā aññaṁ gāmaṁ gaccheyya, tamhāpi gāmā aññaṁ gāmaṁ gaccheyya. So tamhā gāmā sakaṁyeva gāmaṁ paccāgaccheyya. Tassa evamassa: ‘ahaṁ kho sakamhā gāmā amuṁ gāmaṁ agacchiṁ, tatra evaṁ aṭṭhāsiṁ, evaṁ nisīdiṁ, evaṁ abhāsiṁ, evaṁ tuṇhī ahosiṁ, tamhāpi gāmā amuṁ gāmaṁ agacchiṁ, tatrāpi evaṁ aṭṭhāsiṁ, evaṁ nisīdiṁ, evaṁ abhāsiṁ, evaṁ tuṇhī ahosiṁ, somhi tamhā gāmā sakaṁyeva gāmaṁ paccāgato’ti. ",
  "dn6:18.9.10.2": "Evameva kho, mahārāja, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn6:18.9.10.3": "So anekavihitaṁ pubbenivāsaṁ anussarati, seyyathidaṁ—ekampi jātiṁ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṁsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṁvaṭṭakappe anekepi vivaṭṭakappe anekepi saṁvaṭṭavivaṭṭakappe, ‘amutrāsiṁ evaṁnāmo evaṅgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhappaṭisaṁvedī evamāyupariyanto, so tato cuto amutra udapādiṁ; tatrāpāsiṁ evaṁnāmo evaṅgotto evaṁvaṇṇo evamāhāro evaṁsukhadukkhappaṭisaṁvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṁ sauddesaṁ anekavihitaṁ pubbenivāsaṁ anussarati. ",
  "dn6:18.9.10.4": "yo kho, āvuso, bhikkhu evaṁ jānāti evaṁ passati, kallaṁ nu kho tassetaṁ vacanāya: ",
  "dn6:18.9.10.5": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vāti? ",
  "dn6:18.9.10.6": "…pe… ",
  "dn6:18.9.10.7": "Yo so, āvuso, bhikkhu evaṁ jānāti evaṁ passati, kallaṁ tassetaṁ vacanāya: ",
  "dn6:18.9.10.8": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vāti. ",
  "dn6:18.9.10.9": "Ahaṁ kho panetaṁ, āvuso, evaṁ jānāmi evaṁ passāmi. ",
  "dn6:18.9.10.10": "Atha ca panāhaṁ na vadāmi: ",
  "dn6:18.9.10.11": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vā. …pe… ",
  "dn6:18.9.11.0": "2.4.3.7. Dibbacakkhuñāṇa ",
  "dn6:18.9.11.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte sattānaṁ cutūpapātañāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn6:18.9.11.2": "So dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate, yathākammūpage satte pajānāti: ‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṁ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā. Te kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapannā. Ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṁ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate, yathākammūpage satte pajānāti. ",
  "dn6:18.9.12.1": "Seyyathāpi, mahārāja, majjhe siṅghāṭake pāsādo. Tattha cakkhumā puriso ṭhito passeyya manusse gehaṁ pavisantepi nikkhamantepi rathikāyapi vīthiṁ sañcarante majjhe siṅghāṭake nisinnepi. Tassa evamassa: ‘ete manussā gehaṁ pavisanti, ete nikkhamanti, ete rathikāya vīthiṁ sañcaranti, ete majjhe siṅghāṭake nisinnā’ti. ",
  "dn6:18.9.12.2": "Evameva kho, mahārāja, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte sattānaṁ cutūpapātañāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn6:18.9.12.3": "So dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate, yathākammūpage satte pajānāti: ‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṁ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā, te kāyassa bhedā paraṁ maraṇā apāyaṁ duggatiṁ vinipātaṁ nirayaṁ upapannā. Ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṁ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā. Te kāyassa bhedā paraṁ maraṇā sugatiṁ saggaṁ lokaṁ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate; yathākammūpage satte pajānāti. ",
  "dn6:18.9.12.4": "yo kho, āvuso, bhikkhu evaṁ jānāti evaṁ passati, kallaṁ nu kho tassetaṁ vacanāya: ",
  "dn6:18.9.12.5": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vāti? ",
  "dn6:18.9.12.6": "…pe… ",
  "dn6:18.9.12.7": "Yo so, āvuso, bhikkhu evaṁ jānāti evaṁ passati, kallaṁ tassetaṁ vacanāya: ",
  "dn6:18.9.12.8": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vāti. ",
  "dn6:18.9.12.9": "Ahaṁ kho panetaṁ, āvuso, evaṁ jānāmi evaṁ passāmi. ",
  "dn6:18.9.12.10": "Atha ca panāhaṁ na vadāmi: ",
  "dn6:18.9.12.11": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vā. …pe… ",
  "dn6:18.9.13.0": "2.4.3.8. Āsavakkhayañāṇa ",
  "dn6:18.9.13.1": "So evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṁ khayañāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn6:18.9.13.2": "So idaṁ dukkhanti yathābhūtaṁ pajānāti, ayaṁ dukkhasamudayoti yathābhūtaṁ pajānāti, ayaṁ dukkhanirodhoti yathābhūtaṁ pajānāti, ayaṁ dukkhanirodhagāminī paṭipadāti yathābhūtaṁ pajānāti. ",
  "dn6:18.9.13.3": "Ime āsavāti yathābhūtaṁ pajānāti, ayaṁ āsavasamudayoti yathābhūtaṁ pajānāti, ayaṁ āsavanirodhoti yathābhūtaṁ pajānāti, ayaṁ āsavanirodhagāminī paṭipadāti yathābhūtaṁ pajānāti. ",
  "dn6:18.9.13.4": "Tassa evaṁ jānato evaṁ passato kāmāsavāpi cittaṁ vimuccati, bhavāsavāpi cittaṁ vimuccati, avijjāsavāpi cittaṁ vimuccati, ",
  "dn6:18.9.13.5": "vimuttasmiṁ ‘vimuttam’iti ñāṇaṁ hoti, ",
  "dn6:19.1": "‘khīṇā jāti, vusitaṁ brahmacariyaṁ, kataṁ karaṇīyaṁ, nāparaṁ itthattāyā’ti pajānāti. ",
  "dn6:19.1.1.1": "Seyyathāpi, mahārāja, pabbatasaṅkhepe udakarahado accho vippasanno anāvilo. Tattha cakkhumā puriso tīre ṭhito passeyya sippisambukampi sakkharakathalampi macchagumbampi carantampi tiṭṭhantampi. Tassa evamassa: ‘ayaṁ kho udakarahado accho vippasanno anāvilo. Tatrime sippisambukāpi sakkharakathalāpi macchagumbāpi carantipi tiṭṭhantipī’ti. ",
  "dn6:19.1.1.2": "Evameva kho, mahārāja, bhikkhu evaṁ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṁ khayañāṇāya cittaṁ abhinīharati abhininnāmeti. ",
  "dn6:19.2": "Yo kho, āvuso, bhikkhu evaṁ jānāti evaṁ passati, kallaṁ nu kho tassetaṁ vacanāya: ",
  "dn6:19.3": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vāti? ",
  "dn6:19.4": "Yo so, āvuso, bhikkhu evaṁ jānāti evaṁ passati na kallaṁ tassetaṁ vacanāya: ",
  "dn6:19.5": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vāti. ",
  "dn6:19.6": "Ahaṁ kho panetaṁ, āvuso, evaṁ jānāmi evaṁ passāmi. ",
  "dn6:19.7": "Atha ca panāhaṁ na vadāmi: ",
  "dn6:19.8": "‘taṁ jīvaṁ taṁ sarīran’ti vā ‘aññaṁ jīvaṁ aññaṁ sarīran’ti vā”ti. ",
  "dn6:19.9": "Idamavoca bhagavā. ",
  "dn6:19.10": "Attamano oṭṭhaddho licchavī bhagavato bhāsitaṁ abhinandīti. ",
  "dn6:19.11": "Mahālisuttaṁ niṭṭhitaṁ chaṭṭhaṁ. "
}